{"pages":[{"title":"微观察","text":"微观察是西南交通大学学生会青年之声的特色栏目之一，栏目主要通过访问同学的方式，收集同学对校内改变或问题的看法和建议。两年来，青年之声工作站共举行9次微观察活动，活动涉及广，活动内容深，真实反映了同学们的心声。","link":"/DOC2/index.html"},{"title":"今天你又收到传单了吗？","text":"题目： 今天你又收到传单了吗？ 封面： 导语： ​ 传单可谓是宣传方式变迁史上的活化石，在网络时代正在洗刷历史习惯的今天，许多传统推销方式已经成为了历史的背景色逐渐暗淡下去，难觅踪迹，而传单却始终活跃地在我们生活的方方面面彰显它的存在感。吃个饭，有人守在门口发传单；散个步，有人挡在路上发传单；就算是宅在宿舍，也有人上门送传单。面对这样的发传单乱象，同学们早就心存芥蒂，只是隐忍不发，而当青年之声工作站的同学针对传单问题对同学们进行采访时，同学们的不满才涌露出来。 正文： ​ 在今年第一次全面收集提案的工作中，有同学向青青反映学校商业街存在着大量工作人员派送传单，给同学们的出行造成了很多困扰的问题。收到问题就要解决问题，青青立即对有关情况做了实地采访，收集同学们的真实想法。 传单接不接？对待那些直接怼在自己面前的传单，接或是不接，这是一个问题，是默然忍受无处安放的传单，还是绕道而行，避而远之。面对这个问题，不同的人有不同的解答，有人说“勿以善小而不为，随手而为，帮助他人”，也有人说“这是以打扰别人为代价来获取利益，绝不能容忍”。这样的小问题似乎不值一提，不过挥手间的事，但这样的小问题存在于我们生活的每时每刻，如蚊噆肤，若是没有条件反射般的回应速度，迟疑犹豫总是会心有不爽。当传单递来，同学们又会有怎样的反应呢？ 听了同学们的回答，又看了看地上满是脚印的传单、垃圾桶旁溢出的纸张，青青不禁满是认同。传单问题绝对不是仅仅对同学们个人生活造成困扰，对大家共同的生活环境也是有破坏的！ 传单如何管但是，问题有了，怎么解决呢？商业活动学校如何出面管制？派发商业传单的同学和社会人士如何识别？识别后需要进行惩治吗？一个个问题在青青的头脑中盘旋，却百思不得其解，正在青青苦思冥想之际，有个小姐姐提出了建议。 还有同学说可以将发传单这件事情流程化，让他们先通过申请再发传单。也有同学表示：“这是大学文化的一种组成；完全禁止，不允许发传单的话算是让大学少了一种它的特色之处。但是可以对社会人士或是相关机构进行规范化整理，也可以让保卫处和他们签订协议来规范他们的行为。” 嗯嗯，这真的可以是一个好办法！青青一定要为同学们的智慧点个赞！看到同学们踊跃参与采访，我们的工作热情越发高涨啦！青青定会不忘初心，为同学们做出更好的权益工作的。 同学们的事都不是小事，对于青青来说都是放在心上的第一位的头等大事。所以大家对日常生活有什么建议的话，都可以告诉小青，我们会作为同学们的贴心伙伴，及时将意见反馈给学校，给同学们营造一个“巴适的很”的环境哦！","link":"/DOC2/%E5%BE%AE%E8%A7%82%E5%AF%9F1.html"},{"title":"三级联动方案","text":"一、联动目的为便于广泛听取学生意见，代表和维护广大同学合法权益，加强院校班三级信息沟通和交流，特编写《“青年之声“校、院、班三级联动》。 二、青年之声工作站自身组织工作建设2017年2月，西南交通大学学生会“青年之声”工作站正式启动运行，本站以维护学生权益为己任，致力于做学生与学校领导沟通的桥梁，学生工作的建言献策者，提高学生群体权益意识的主力军，积极将青年之声平台建设成为建言献策、维权发声的中流砥柱。 青年之声工作站将以“提案”工作为重心，设置3个工作组处理相关问题。其中应提案内容设置两个组，分别为校园管理与教学小组，基础设施与服务小组，应部门建设设置对接与综合小组。前两个小组共同负责提案的采集、分析、筛选，分别负责对应提案的调查和回复，对接与综合小组负责与学生会其他部门的工作对接和部门各项活动的筹备工作。 在提案采集方面，西南交通大学学生会“青年之声”工作站将构建起线上与线下相结合的学生意见反映和收集渠道。 线上：西南交通大学学生会微信公众号已开设维权服务专栏，另外，西南交通大学学生会官方微博、西南交通大学学生会官方QQ、“青年之声”工作站官方QQ均会24小时接收维权提案。 线下：西南交通大学将会定时召开校级以及院级权益联动会议，届时将会对各院或各班的维权提案进行统计和上报。 在提案的调查回复方面，依托于校院两级权益联动会议，优化完善协调化解机制。西南交通大学学生会以及各院学生会会主动联系与学生利益密切相关的职能部门，沟通协商化解办法。紧密联系“校领导接待日”平台以及“小惠请你来喝茶”活动，及时反映涉及同学们重大事项、重要问题。 青年之声工作站采取三级响应机制： 初级响应：提案小组每周筛查、分类同学们的意见和建议，对基础性、政策性的简单问题，依法依规做好回复工作。 中级响应：提案小组每月整理出相关问题的办理进展，对同学们反映的共性问题、紧急问题，做好苗头性、倾向性问题的预警，邀请相关单位负责人与同学们面对面进行解答和回复。 高级响应：对同学们反映强烈且难以协调化解的重要问题，提案小组负责筛选分析研判，上报校领导接待日等进行处理。 三、联动会议校级联动会议：为方便各学院间进行权益工作交流，也便于了解各学院工作进展，西南交通大学“青年之声”工作站将于每月召开一次联动会议（时间定于周三中午12:30，召开教室由“青年之声”工作站负责借用，届时会提前通知），各学院维权部门的负责人应准时与会。 院级联动会议：各院权益部门负责人应至少每月一次组织召开院级联动会议并通知院内各班权益委员与会，会议主要用于收集各院同学们的问题与建议，具体会议时间地点由各院权益部门负责人自行拟定。 四、各学院学生会职责范围1、负责开展代表和维护学院师生合法权益的日常工作； 2、加强校-院-班三级联动，各院级学生会要做好学院与班级之间的衔接，做班级学生与学院之间的桥梁 3、各院级学生会权益部门（或主要负责组织）建立日常维权机制，搭建网络新媒体平台，及时收集、听取涉及班级同学切身利益和普遍诉求的问题，分层次整理同学们的问题，对直接能回复的问题直接回复； 需要跟学院有关部门、组织进行沟通的问题由各学院权益部门（或主要负责组织）会议讨论决定处理方案，并由各学院学生会自行跟进，直接与相关部门负责人进行协商处理，切实推动问题的解决； 需要跟学校有关部门进行沟通的问题通过网络平台或者联动会议及时向西南交通大学学生会“青年之声”工作站反映，并由西南交通大学学生会“青年之声”工作站进行跟进，切实推动问题的解决； 4、及时转载西南交通大学学生会官方微信公众号推出的“青年之声”系列推送以及“青年之声”工作站官方QQ的维权服务相关说说到各院班群。 5、负责与内各班的权益委员直接交流，并定期召开院级联动会议。 6、对应权益部门负责人每两周一次参与联动会议并及时将发现的制度漏洞反应给西南交通大学“青年之声”工作站，而后进行权益维护相关的工作交流以及想法分享。 7、每学期期末做一个学期工作汇报，汇报内容包括提案搜集情况、处理情况、反馈情况、未来计划等。 五、问题收集端口1、线上：西南交通大学学生会微信公众号、西南交通大学学生会官方QQ、西南交通大学学生会官方微博、“青年之声”工作站官方QQ； 注：1、线上窗口设置使用统一的问卷星模板，可根据各学院特色增加相应内容。 2、窗口设置在菜单栏一级窗口，使用统一名称青年之声 2、线下：由联动会议收集组成。 六、运行机制1、西南交通大学学生会“青年之声”工作站例会每周举行一次，日常运行可以进行线上或线下的讨论。 2、线上回复： 所有端口在收集到问题建议后，进行消息处理和收到通知； 各学院学生会负责在问题解决中和解决后进行回复，以及每月一次的报告推送； 3、线下收单： 由各班权益委员负责统计班上同学的问题建议并在院级联动会议上或线上进行反应，各院学生会对收集到的问题建议进行筛选，对于不能直接解决的才在校级联动会议上或线上报西南交通大学“青年之声”工作站处理。 七、问题反馈1、向线上平台直接发送的问题建议： 经解决后直接在“青年之声”工作站官方QQ 和西南交通大学学生会官方微信平台同步发送说说或推送回复。 2、向院级学生会提交的问题建议： 1）院级学生会有能力直接解决的由院级学生会全权负责并自主回复。 2）院级学生会无法直接解决的，在校院联动会议上反映给西南交通大学“青年之声”工作站，“青年之声”工作站经过处理后将结果再次返回给院级学生会，由院级学生会进行传达。 八、考核制度西南交通大学“青年之声”工作站将不定期联合学院学生会对各院的联动工作情况进行抽查，并对于抽查结果给定评分。评分由西南交通大学“青年之声”工作站的打分部分（占总分70%）和其它学院学生会打分部分（占总分30%）组成。各学院权益维护工作在“十佳优秀学生会”评选中占17分，“青年之声”工作站将在“十佳优秀学生会”评选前夕统计所有抽查结果。 考核内容如下： 序号 考核事项 细则 分数 院班 1 联动机制 各院完善学院（学生会权益部）、班级（权益委员）两级权益工作联动机制（方案） 1分 2 联动会议 定期召开院班联动会议，有完整会议记录 1分 3 提案工作 对于院内可自行解决的提案，及时跟进处理情况，做好提案反馈工作 1分 4 调研机制 有相对完善的调研机制，学期内至少进行两次走访调研活动，了解学生对相关权益工作的想法及反馈，形成图像及文字记录，并在新媒体平台发布推送 1分 5 对提案按类归档 提案按校园管理、教学教研、成长成才、基础设施、生活服务五大类归档 1分 校院 6 配合“青年之声”展开相关工作 配合“青年之声”平台开展相关工作，帮转权益工作相关推送（权益工作相关活动、提案进度反馈等） 1分，少推一次扣0.2分，扣完为止 7 相关人员参与三级联动会议 分管主席参加青年之声校院联动会议，分管主席或权益部部长参加院班联动会议考核 1分，无故缺席一次扣0.2分，请假说明由其他主席团成员代替可不扣分，迟到早退一次扣0.1分，扣完为止 8 提案质量 学院应对收集提案进行初级筛选，综合考察提案可行性、重复性、周期性等问题，确保提案有效性，并及时提交至西南交通大学“青年之声”工作站 5分 9 提案数量 考虑到各院人数差距及多方面问题，不对提案数量制定强制性统一规定，按照各院大小对上交提案数量进行灵活性打分。 2分 10 权益工作总结 学期末按要求提交本学期权益工作总结 2分，每次1分 常代表全程监督院系在学期内的相关权益工作，据各院权益工作实际开展情况进行参与，包括线下定期调研访谈活动，班级权益委员工作进程，院班联动会议记录等，在学期末形成学院年度观察报告，并上交至青年之声工作站。 除此之外，西南交通大学“青年之声”工作站将对班级权益委员关于学院联动会议的展开情况、看法和建议进行随机提问。 九、奖惩制度各院学生会联动工作与权益维护工作开展情况将直接影响“十佳优秀学生会”评选成绩，以及个人荣誉评定。 每学期期末将评选出建言献策、维权服务工作和提升权益意识工作最出色的学院学生会以及权益委员，校会青年之声工作站将授予奖状和奖品。 十、针对部分学院学生会无新媒体平台及学院组织负责权益负责的解决方案1、因部分学院学生会无新媒体平台，为及时收集、听取涉及广大同学切身利益和普遍诉求的问题，建议利用学院组织新媒体平台进行线上问题收集，并要求由学院学生会权益部门主要负责问题收集以及整体运营、对接。 2、因部分学院目前由学院组织负责权益维护，为更好实现“扁平化”，要求学院学生会加强权益部门的建设，并由学院学生会相关负责人进行对接。 十一、相关细则1、提案质量、数量具体细则： 针对不同院系情况，对提案数量的要求不尽相同，将以学院人数系数为标准对所有学院排序，取前六个院“大院”，其余为“小院”。当学院人数系数存在明显分层时，则按人数系数分层情况来进行分类，并不拘泥于单一形式。 （人数系数=大一学生人数+**大二学生人数X0.4）** 对于“大院”而言，学期有效提案总数达到5份为优秀（2分），有效提案达到3份为良好（1分），有效提案达到2份为合格（0.5分），有效提案低于2份不合格，不计分。 对于“小院”而言，学期有效提案总数达到4份为优秀（2分），有效提案达到2份为良好（1分），有效提案达到1份为合格（0.5分），有效提案低于1份不合格，不计分。 提案质量将从各院有效提案的实施难度、重复性、周期性、完整性等其他多方面进行综合考虑评分，各院一视同仁。 2、“院院考核”细则：1、为了让各院了解联动工作的具体评分情况，促进各院间相互学习、相互监督，了解监督青年之声工作站的打分过程和打分情况，要求各院对于其他院联动工作情况进行评分。 2、对各学院的权益工作评定在“十佳优秀学生会”评选中共占17分，其中青年之声工作站评分占70%，各院互评占30%。 3、各院间的评分工作由青年之声工作站组织统筹，互评对象由青年之声工作站安排，各院每学期对另一个院进行考核，为保证评分环节客观公正，考核双方身份将于第一次校院联动会议上进行公示，青年之声工作站负责中间协商工作，考核顺序及考核表将在青年之声与各学院沟通之后发布。 4、各院互相考核的内容如下： 1) 各院权益负责人按考核表出席对应被考核学院的院班联动会议，并现场打分。 2) 各院在进行走访调研活动时，应邀请相应考核学院权益负责人一同进行走访调研，以监督各院的调研工作。 3) 学期末，青年之声工作站将对各院学期提案总数进行整理，考核院应充分考察各提案的完整性（是否严格按照指定格式书写提案）、可行性（包括实施难度、实施周期等）、创新性（是否能引起同学的注意力和兴趣，是否对学校长远发展和学生权益维护有益，是否具有其他发展前景等）、广泛性（是否适用于多数同学）、具体性（要求问题描述细致，设想解决办法、有必要时应提供相应照片或现实素材）等方面，对相应被考核院本学期形成提案进行评价。 4) 若在学期工作中，有其他文件或活动需要院院考核互评，青年之声工作站将视现实情况灵活进行组织统筹。 5、各院进行评分时应按照青年之声工作站提供的具体评分标准执行。 6、各院考核人员在考核时均需到场，未到场者将酌情扣分。 7、考核人员评分需做到公平公正，如有严重评分失实的情况，则评分作废。","link":"/DOC1/%E4%B8%89%E7%BA%A7%E8%81%94%E5%8A%A82019.html"},{"title":"三级联动制度","text":"三级联动制度旨在 广泛听取学生意见，代表和维护广大同学合法权益，加强院校班三级信息沟通和交流 。自2018年广泛实行以来，收集同学提案170余份，为学校权益工作提供了充足的提案来源，收获了各院系的一致好评","link":"/DOC1/index.html"},{"title":"index","text":"","link":"/index/index.html"},{"title":"提案回复","text":"提案是青年之声工作站的工作核心，是青年之声与广大同学交流的主要载体。青年之声在收到来自各院系的提案后会及时进入提案处理流程，尽快为同学们解决问题、解答疑惑并及时将提案归档整理。","link":"/DOC4/index.html"},{"title":"关于网课学习下的效率问题的提案的回复","text":"关于网课学习下的效率问题的提案的回复 亲爱的电气工程学院的张子潼同学： 你好！贵院提交的提案，经我们询问考证后，现答复如下： \\1. 每个学科都有各自适合的教学方法，同学们如果有对于具体学科教学的建议可以直接向任课老师提出，在网上教学的条件下，相信任课老师是乐意接受大家的意见，积极实行适合学科的教学方法。 \\2. 对于同学们的松懈与轻视问题，无论线上线下都无法避免。建议学院学生会针对学科或年级进行学风倡议活动，或者联系辅导员老师进行一定程度的学风督察。 感谢你为学校提出的宝贵建议，学校会积极努力，为同学们提供舒适且优质的学习与生活条件。祝你学习进步、生活愉快！ 西南交通大学学生会青年之声工作站 ​ 2020年5月5日 ​","link":"/DOC4/%E5%9B%9E%E5%A4%8D1.html"},{"title":"院班联动会议","text":"懒得写","link":"/DOC3/index.html"}],"posts":[{"title":"青年之声工作站","text":"2017年2月，西南交通大学学生会“青年之声”工作站正式启动运行，本站以维护学生权益为己任，致力于做学生与学校领导沟通的桥梁，学生工作的建言献策者，提高学生群体权益意识的主力军，积极将青年之声平台建设成为建言献策、维权发声的中流砥柱。 青年之声工作站将以“提案”工作为重心，线上依托西南交通大学学生会官方公众号收集提案，线下依托三级联动制度收集提案 ，2018年至2020年度以来，共开展9次微观察，4次大调研，共计有效提案120余份。 青年之声工作站自成立以来，始终坚持高标准、严要求完成部门工作，始终坚持以维护学生权益为己任，积极处理各学院提案，切实发挥学生与学校领导间沟通的桥梁和纽带作用，致力于为学生谋求更多利益窗口，对学校发展提供意见和参考方向。在未来，我们仍将继续以服务学生、维护权益为己任，不断推进交大特色权益品牌建设。","link":"/index/"}],"tags":[],"categories":[]}