<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>《C和指针》 - 饮冰室</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta name="description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x535A;&amp;#x5BA2;&amp;#x4E3B;&amp;#x8981;&amp;#x5BF9;&amp;#x81EA;&amp;#x5DF1;&amp;#x8BFB;&amp;#x300A;C&amp;#x548C;&amp;#x6307;&amp;#x9488;&amp;#x300B;&amp;#x4E00;&amp;#x4E66;&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&amp;#x505A;&amp;#x8BB0;&amp;#x5F55;&amp;#xFF0C;&amp;#x4E0D">
<meta property="og:type" content="article">
<meta property="og:title" content="《C和指针》">
<meta property="og:url" content="http://yoursite.com/C%E5%92%8C%E6%8C%87%E9%92%88/index.html">
<meta property="og:site_name" content="饮冰室">
<meta property="og:description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x535A;&amp;#x5BA2;&amp;#x4E3B;&amp;#x8981;&amp;#x5BF9;&amp;#x81EA;&amp;#x5DF1;&amp;#x8BFB;&amp;#x300A;C&amp;#x548C;&amp;#x6307;&amp;#x9488;&amp;#x300B;&amp;#x4E00;&amp;#x4E66;&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&amp;#x505A;&amp;#x8BB0;&amp;#x5F55;&amp;#xFF0C;&amp;#x4E0D">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2020-09-10T17:35:42.000Z">
<meta property="article:modified_time" content="2020-09-11T16:22:08.960Z">
<meta property="article:author" content="Junhui Luo">
<meta property="article:tag" content="C++">
<meta property="article:tag" content="C">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/images/logo.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/Vision/">视觉</a>
            
            <a class="navbar-item "
               href="/categories/CPlus/">C++</a>
            
            <a class="navbar-item "
               href="/categories/Algorithm/">算法</a>
            
            <a class="navbar-item "
               href="/categories/Study/">学习</a>
            
            <a class="navbar-item "
               href="/about/">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目录">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#">1&nbsp;&nbsp;<b>快速上手</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">2&nbsp;&nbsp;<b>基本概念</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">3&nbsp;&nbsp;<b>数据</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">4&nbsp;&nbsp;<b>语句</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">5&nbsp;&nbsp;<b>操作符和表达式</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">6&nbsp;&nbsp;<b>指针</b></a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/luojunhui1" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            《C和指针》
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-09-10T17:35:42.000Z" itemprop="datePublished">9月 11 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/CPlus/">CPlus</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            14 分钟 读完 (约 2148 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x672C;&#x7BC7;&#x535A;&#x5BA2;&#x4E3B;&#x8981;&#x5BF9;&#x81EA;&#x5DF1;&#x8BFB;&#x300A;C&#x548C;&#x6307;&#x9488;&#x300B;&#x4E00;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x505A;&#x8BB0;&#x5F55;&#xFF0C;&#x4E0D;&#x6210;&#x6574;&#x4F53;&#xFF0C;&#x6BD4;&#x8F83;&#x96F6;&#x788E;&#x3002;</p>
<a id="more"></a>

<h2><span id="&#x5FEB;&#x901F;&#x4E0A;&#x624B;">&#x5FEB;&#x901F;&#x4E0A;&#x624B;</span></h2><p>&#x8FD9;&#x4E00;&#x7AE0;&#x4F5C;&#x8005;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x4E00;&#x4E9B;C&#x8BED;&#x8A00;&#x57FA;&#x672C;&#x7684;&#x51FD;&#x6570;&#x548C;&#x6982;&#x5FF5;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x51E0;&#x70B9;&#x503C;&#x5F97;&#x8BB0;&#x5F55;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E9B;&#x58F0;&#x660E;&#x9700;&#x8981;&#x7528;&#x4E8E;&#x591A;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x58F0;&#x660E;&#x5199;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5728;&#x540E;&#x7EED;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5305;&#x542B;&#x8FD9;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5373;&#x53EF;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x5728;&#x7EF4;&#x62A4;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x65F6;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</li>
<li>&#x6807;&#x51C6;&#x672A;&#x786C;&#x6027;&#x89C4;&#x5B9A;C&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x6570;&#x7EC4;&#x7684;&#x4E0B;&#x6807;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7F16;&#x8BD1;&#x5668;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6700;&#x597D;&#x5BF9;&#x6570;&#x7EC4;&#x7684;&#x4E0B;&#x6807;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#xFF0C;<del>&#x5373;&#x4F7F;&#x662F;&#x8BA4;&#x4E3A;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x5730;&#x65B9;</del>&#x3002;</li>
<li><strong>&#x5728;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5F53;&#x60F3;&#x4F7F;&#x7528;&amp;&amp;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x8BEF;&#x4F7F;&#x7528;&amp;&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x540E;&#x8005;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x201D;&#x6309;&#x4F4D;&#x4E0E;&#x201C;&#x64CD;&#x4F5C;&#xFF0C;&#x4E8C;&#x8005;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;</strong></li>
<li>&#x5728;&#x4F7F;&#x7528;&#x5E93;&#x5305;&#x542B;&#x7684;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x67E5;&#x770B;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x4E86;&#x89E3;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x4F8B;&#x5982;EOF&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x578B;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x7528;int&#x578B;&#x6765;&#x63A5;&#x53D7;&#x5B57;&#x7B26;&#x4FE1;&#x606F;&#xFF0C;&#x518D;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x4E3A;&#x7A7A;&#xFF0C;&#x9632;&#x6B62;&#x5B57;&#x7B26;&#x610F;&#x5916;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;EOF&#x3002;</li>
</ul>
<h2><span id="&#x57FA;&#x672C;&#x6982;&#x5FF5;">&#x57FA;&#x672C;&#x6982;&#x5FF5;</span></h2><ul>
<li><p>&#x5728;&#x7F16;&#x8BD1;&#x5E76;&#x94FE;&#x63A5;&#x5B8C;&#x5168;&#x5305;&#x542B;&#x4E8E;&#x4E00;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x7684;C&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x5982;</p>
<p></p><figure class="highlight c hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cc program.c</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;a.out&#x7684;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;(&#x672A;&#x7528;-o&#x9009;&#x9879;&#x9009;&#x5B9A;&#x8F93;&#x51FA;&#x540D;&#x79F0;)&#xFF0C;&#x4E2D;&#x95F4;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;program.o&#x7684;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#xFF0C;&#x8BE5;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x4F1A;&#x5728;&#x94FE;&#x63A5;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x540E;&#x88AB;&#x5220;&#x9664;&#x3002;&#x800C;&#x5F53;&#x7F16;&#x8BD1;&#x6587;&#x4EF6;&#x8D85;&#x8FC7;&#x4E00;&#x4E2A;&#x65F6;&#xFF0C;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x5C31;&#x4E0D;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x53EA;&#x4FEE;&#x6539;&#x4E86;&#x90E8;&#x5206;&#x6E90;&#x6587;&#x4EF6;&#x65F6;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x7684;&#x64CD;&#x4F5C;&#xFF1A;</p>
<p></p><figure class="highlight c hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cc main.o lookup.o sort.c</span><br></pre></td></tr></tbody></table></figure><p></p>
</li>
<li><p><strong>&#x4E09;&#x5B57;&#x6BCD;&#x8BCD;</strong>&#x3002;&#x8FD9;&#x4E2A;&#x6709;&#x4E9B;&#x730E;&#x5947;&#xFF0C;&#x73B0;&#x5728;&#x57FA;&#x672C;&#x4E0A;&#x770B;&#x4E0D;&#x89C1;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#xFF0C;&#x6709;&#x4E9B;&#x7F16;&#x8BD1;&#x5668;&#x751A;&#x81F3;&#x4E0D;&#x5904;&#x7406;&#x4E09;&#x5B57;&#x6BCD;&#x8BCD;&#x800C;&#x53EA;&#x662F;&#x5F53;&#x4F5C;&#x666E;&#x901A;&#x5B57;&#x7B26;&#x4E32;&#x5904;&#x7406;&#x3002;</p>
</li>
<li><p>&#x6240;&#x6709;&#x7684;&#x6CE8;&#x91CA;&#x90FD;&#x4F1A;&#x88AB;<strong>&#x9884;&#x5904;&#x7406;&#x5668;</strong>&#x62FF;&#x6389;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x3002;&#x6240;&#x4EE5;&#x4EE5;&#x4E0B;&#x8BED;&#x53E5;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF1A;</p>
<p></p><figure class="highlight c hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-keyword">int</span><span class="hljs-comment">/*comment*/</span>x</span><br></pre></td></tr></tbody></table></figure><p></p>
</li>
<li><p>&#x7EDD;&#x5927;&#x591A;&#x6570;&#x6CE8;&#x91CA;&#x4EE5;&#x5757;&#x7684;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x4E0A;&#x66F4;&#x7A81;&#x51FA;&#x3002;</p>
</li>
</ul>
<h2><span id="&#x6570;&#x636E;">&#x6570;&#x636E;</span></h2><ul>
<li><p>&#x5C3D;&#x7BA1;&#x8BBE;&#x8BA1;char&#x7C7B;&#x578B;&#x662F;&#x8BA9;&#x5B83;&#x4EEC;&#x5BB9;&#x7EB3;&#x5B57;&#x7B26;&#x578B;&#x503C;&#xFF0C;&#x4F46;&#x5B57;&#x7B26;&#x5728;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5C0F;&#x6574;&#x578B;&#x503C;&#xFF0C;&#x7F3A;&#x7701;&#x7684;char&#x8981;&#x4E48;&#x662F;signed char &#x8981;&#x4E48;&#x662F; unsigned cha&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x5B9E;&#x9645;&#x4E0A;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x540C;&#x673A;&#x5668;&#x7684;char&#x53EF;&#x80FD;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x4E00;&#x4E2A;char&#x578B;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x5904;&#x4E8E;signed char &#x548C; unsigned char&#x7684;&#x4EA4;&#x96C6;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x624D;&#x662F;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x3002;<strong>&#x4F46;&#x662F;</strong>&#xFF0C;&#x8BB8;&#x591A;&#x5904;&#x7406;&#x5B57;&#x7B26;&#x7684;&#x5E93;&#x51FD;&#x6570;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x53C2;&#x6570;&#x58F0;&#x660E;&#x4E3A;char&#xFF0C;&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x4E3A;signed&#x6216;unsigned&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;&#x5B57;&#x7B26;&#x5E38;&#x91CF;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x603B;&#x662F;int,&#x4E0D;&#x80FD;&#x5728;&#x540E;&#x9762;&#x52A0;&#x4E0A;unsigned&#x6216;long&#x540E;&#x7F00;&#x3002;&#xFF08;&#x5B57;&#x7B26;&#x5E38;&#x91CF;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x5355;&#x5F15;&#x53F7;&#x5305;&#x56F4;&#x8D77;&#x6765;&#x7684;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#xFF09;</p>
</li>
<li><p>&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x91CF;&#x7684;&#x76F4;&#x63A5;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x5373;&#x6307;&#x5411;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x6240;&#x5B58;&#x50A8;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x672C;&#x8EAB;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;&#x6307;&#x9488;&#x6765;&#x8BF4;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x5728;&#x58F0;&#x660E;&#x7684;&#x65F6;&#x5019;&#x5199;&#x6210;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#xFF1A;int* a,&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x76F4;&#x89C2;&#xFF0C;&#x5373;a&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;int&#x578B;&#x6570;&#x636E;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x4F46;&#x6B63;&#x786E;&#x89C4;&#x8303;&#x7684;&#x5199;&#x6CD5;&#x5E94;&#x8BE5;&#x662F;&#xFF1A;int <em>a,&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x5728;&#x540C;&#x65F6;&#x58F0;&#x660E;&#x591A;&#x4E2A;&#x6307;&#x9488;&#x65F6;&#xFF0C;int\</em> a,b,c,d;&#x53EA;&#x6709;a&#x662F;&#x6307;&#x9488;&#xFF0C;&#x5176;&#x5B83;&#x90FD;&#x662F;&#x53D8;&#x91CF;&#xFF0C;*&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x662F;&#x8868;&#x8FBE;&#x5F0F;*a&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
</li>
<li><p>&#x5E94;&#x8BE5;&#x7528;typedef&#x800C;&#x4E0D;&#x662F;#define&#x6765;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7C7B;&#x578B;&#x540D;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x8005;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x5730;&#x5904;&#x7406;&#x6307;&#x9488;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<p></p><figure class="highlight plain hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">#define ptr_to_char char*</span><br><span class="line">ptr_to_char a,b;</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>a&#x88AB;&#x6B63;&#x786E;&#x5730;&#x58F0;&#x660E;&#x4E86;&#xFF0C;b&#x5374;&#x88AB;&#x58F0;&#x660E;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;</p>
</li>
<li><p>&#x6D89;&#x53CA;&#x5230;&#x6307;&#x9488;&#x5E38;&#x91CF;&#x5B9A;&#x4E49;&#x65F6;&#xFF0C;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x6CE8;&#x610F;&#xFF1A;int const *pci&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x6574;&#x578B;&#x5E38;&#x91CF;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x6307;&#x9488;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x6307;&#x9488;&#x6307;&#x5411;&#x7684;&#x503C;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;int * const cpic&#x5219;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x6574;&#x578B;&#x7684;&#x5E38;&#x91CF;&#x6307;&#x9488;&#xFF0C;&#x6B64;&#x65F6;&#x6307;&#x9488;&#x662F;&#x5E38;&#x91CF;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x65E0;&#x6CD5;&#x4FEE;&#x6539;&#x4F46;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x5B83;&#x6307;&#x5411;&#x7684;&#x6574;&#x5F62;&#x7684;&#x503C;&#x3002;</p>
</li>
<li><p>&#x6807;&#x8BC6;&#x7B26;&#x7684;<strong>&#x94FE;&#x63A5;&#x5C5E;&#x6027;</strong>&#x6709;&#x4E09;&#x79CD;&#xFF1A;none,internal&#x548C;external&#xFF0C;&#x5176;&#x4E2D;none&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x603B;&#x662F;&#x88AB;&#x5F53;&#x4F5C;&#x5355;&#x72EC;&#x7684;&#x4E2A;&#x4F53;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x58F0;&#x660E;&#x5C31;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x591A;&#x5C11;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5B9E;&#x4F53;&#x3002;internal&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x58F0;&#x660E;&#x90FD;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x6807;&#x5B9E;&#x4F53;&#xFF0C;&#x4F46;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x591A;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x5C31;&#x5206;&#x5C5E;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F53;&#x3002;external&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x4E0D;&#x8BBA;&#x58F0;&#x660E;&#x591A;&#x5C11;&#x6B21;&#x3001;&#x4F4D;&#x4E8E;&#x51E0;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x90FD;&#x8868;&#x793A;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x3002;<strong>&#x5173;&#x952E;&#x8BCD;</strong>extern&#x548C;static&#x7528;&#x4E8E;&#x5728;&#x58F0;&#x660E;&#x4E2D;&#x4FEE;&#x6539;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x94FE;&#x63A5;&#x5C5E;&#x6027;.&#x5BF9;&#x4E8E;&#x7F3A;&#x7701;&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#x4E3A;external&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5728;&#x5B83;&#x524D;&#x9762;&#x52A0;&#x4E0A;static&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#x6539;&#x53D8;&#x4E3A;internal&#x3002;&#x5F53;extern&#x7528;&#x4E8E;&#x6E90;&#x6587;&#x4EF6;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x58F0;&#x660E;&#x4E2D;&#x65F6;&#xFF0C;&#x5B83;&#x6307;&#x5B9A;&#x8BE5;&#x6807;&#x8BC6;&#x7B26;&#x6709;external&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x82E5;&#x5B83;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x7B2C;&#x4E8C;&#x6B21;&#x6216;&#x4E4B;&#x540E;&#x7684;&#x58F0;&#x660E;&#x65F6;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x66F4;&#x6539;&#x7531;&#x7B2C;&#x4E00;&#x6B21;&#x58F0;&#x660E;&#x6307;&#x5B9A;&#x7684;&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;&#x81EA;&#x52A8;&#x53D8;&#x91CF;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x7684;&#x540C;&#x65F6;&#x521D;&#x59CB;&#x5316;&#x548C;&#x5148;&#x58F0;&#x660E;&#x540E;&#x8D4B;&#x503C;&#x53EA;&#x6709;&#x98CE;&#x683C;&#x4E4B;&#x5DEE;&#xFF0C;&#x5E76;&#x65E0;&#x6548;&#x7387;&#x5DEE;&#x522B;&#x3002;&#x539F;&#x56E0;&#x662F;&#x81EA;&#x52A8;&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#x5728;&#x7A0B;&#x5E8F;&#x94FE;&#x63A5;&#x65F6;&#x8FD8;&#x5E76;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x4F4D;&#x7F6E;&#xFF0C;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x7406;&#x7531;&#xFF0C;&#x81EA;&#x52A8;&#x53D8;&#x91CF;&#x6CA1;&#x6709;&#x7F3A;&#x7701;&#x7684;&#x521D;&#x59CB;&#x503C;&#x3002;</p>
</li>
<li><p>&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x4E2D;&#x65F6;&#xFF0C;static&#x5173;&#x952E;&#x5B57;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x610F;&#x601D;&#x3002;&#x7528;&#x4E8E;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF0C;&#x6216;&#x4EE3;&#x7801;&#x5757;&#x4E4B;&#x5916;&#x7684;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x65F6;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x4FEE;&#x6539;&#x94FE;&#x63A5;&#x5C5E;&#x6027;&#xFF0C;&#x7528;&#x4E8E;&#x4EE3;&#x7801;&#x5757;&#x5185;&#x90E8;&#x7684;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x65F6;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x4FEE;&#x6539;&#x5B58;&#x50A8;&#x7C7B;&#x578B;&#xFF08;&#x9759;&#x6001;&#xFF09;&#x3002;</p>
</li>
</ul>
<h2><span id="&#x8BED;&#x53E5;">&#x8BED;&#x53E5;</span></h2><p>&#x65E0;</p>
<h2><span id="&#x64CD;&#x4F5C;&#x7B26;&#x548C;&#x8868;&#x8FBE;&#x5F0F;">&#x64CD;&#x4F5C;&#x7B26;&#x548C;&#x8868;&#x8FBE;&#x5F0F;</span></h2><ul>
<li><p>&#x4F4D;&#x64CD;&#x4F5C;&#x7B26;&#x5E38;&#x4E0E;&#x903B;&#x8F91;&#x64CD;&#x4F5C;&#x7B26;&#x6DF7;&#x6DC6;&#xFF0C;&#x4F46;&#x4E8C;&#x8005;&#x6709;&#x7740;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x540E;&#x8005;&#x6709;&#x7740;<strong>&#x6700;&#x77ED;&#x8DEF;&#x6027;&#x8D28;</strong>&#xFF0C;&#x82E5;&#x8868;&#x8FBE;&#x5F0F;&#x6839;&#x636E;&#x5DE6;&#x64CD;&#x4F5C;&#x6570;&#x5C31;&#x53EF;&#x51B3;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4E0D;&#x5BF9;&#x53F3;&#x64CD;&#x4F5C;&#x6570;&#x518D;&#x6C42;&#x503C;&#xFF0C;&#x7B2C;&#x4E8C;&#xFF0C;&#x903B;&#x8F91;&#x64CD;&#x4F5C;&#x7B26;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x96F6;&#x503C;&#x548C;&#x975E;&#x96F6;&#x503C;&#xFF0C;&#x800C;&#x4F4D;&#x64CD;&#x4F5C;&#x7B26;&#x7528;&#x4E8E;&#x6BD4;&#x8F83;&#x5B83;&#x4EEC;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x4F4D;&#x3002;&#x5BF9;&#x4E8E;&#x4EE5;&#x4E0B;&#x4E24;&#x6761;&#x8BED;&#x53E5;&#xFF0C;a=1,b=2,&#x4E8C;&#x8005;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x4E0D;&#x76F8;&#x540C;&#xFF1A;</p>
<p></p><figure class="highlight c hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-keyword">if</span>(a&amp;&amp;b)</span><br><span class="line"><span class="hljs-keyword">if</span>(a&amp;b)</span><br></pre></td></tr></tbody></table></figure><p></p>
</li>
<li><p><strong>&#x9017;&#x53F7;&#x64CD;&#x4F5C;&#x7B26;</strong>&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x5DE7;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x5F88;&#x5C11;&#x89C1;&#x5230;&#x3002;&#x9017;&#x53F7;&#x64CD;&#x4F5C;&#x7B26;&#x5C06;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x64CD;&#x4F5C;&#x7B26;&#x5206;&#x9694;&#x5F00;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x81EA;&#x5DE6;&#x5411;&#x53F3;&#x6328;&#x4E2A;&#x6C42;&#x503C;&#xFF0C;&#x6574;&#x4E2A;&#x9017;&#x53F7;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x5C31;&#x662F;&#x6700;&#x540E;&#x90A3;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5E94;&#x7528;&#xFF1A;</p>
<p></p><figure class="highlight c hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-keyword">while</span>(a=get_value(),count_value(a),a&gt;<span class="hljs-number">0</span>)</span><br><span class="line">{</span><br><span class="line">    <span class="hljs-comment">/*content*/</span></span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure><p></p>
</li>
</ul>
<h2><span id="&#x6307;&#x9488;">&#x6307;&#x9488;</span></h2><p>&#x200B;    &#x6307;&#x9488;&#x7684;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x53EA;&#x9650;&#x4E8E;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x7B2C;&#x4E00;&#x79CD;&#x4E3A;<br>$$<br>&#x6307;&#x9488;\quad\pm\quad&#x6574;&#x6570;<br>$$<br>&#x7B2C;&#x4E8C;&#x79CD;&#x4E3A;<br>$$<br>&#x6307;&#x9488;\quad-\quad&#x6307;&#x9488;<br>$$<br>&#x5176;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x53EA;&#x6709;&#x5F53;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x624D;&#x5141;&#x8BB8;&#x8FD9;&#x6837;&#x64CD;&#x4F5C;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x5BF9;&#x5E94;&#x5143;&#x7D20;&#x4E0B;&#x6807;&#x4E4B;&#x5DEE;&#x3002;&#x5BF9;&#x6307;&#x9488;&#x6267;&#x884C;<strong>&#x5173;&#x7CFB;&#x8FD0;&#x7B97;</strong>&#x4EA6;&#x6709;&#x9650;&#x5236;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x80FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#xFF08;&#x76F8;&#x7B49;&#x8FD0;&#x7B97;&#x9664;&#x5916;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x6307;&#x9488;&#xFF09;&#xFF0C;&#x4F46;&#x6807;&#x51C6;&#x5141;&#x8BB8;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x6307;&#x9488;&#x4E0E;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x540E;&#x9762;&#x7684;&#x90A3;&#x4E2A;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x7684;&#x6307;&#x9488;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x4F46;&#x4E0D;&#x5141;&#x8BB8;&#x4E0E;&#x6307;&#x5411;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E4B;&#x524D;&#x7684;&#x90A3;&#x4E2A;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x7684;&#x6307;&#x9488;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;</p>
<p></p><figure class="highlight c hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-comment">/*&#x53EF;&#x884C;&#x4F8B;*/</span></span><br><span class="line"><span class="hljs-keyword">for</span>(vp=&amp;value[<span class="hljs-number">0</span>];vp&lt;&amp;vp[N_VALUES];)</span><br><span class="line">	*vp++ = <span class="hljs-number">0</span>;</span><br><span class="line">	</span><br><span class="line"><span class="hljs-comment">/*&#x9519;&#x8BEF;&#x4F8B;*/</span></span><br><span class="line"><span class="hljs-keyword">for</span>(vp=&amp;value[N_VALUES<span class="hljs-number">-1</span>];vp&gt;&amp;vp[<span class="hljs-number">0</span>];vp--)</span><br><span class="line">	*vp = <span class="hljs-number">0</span>;</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x540E;&#x8005;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x5927;&#x591A;&#x6570;&#x7F16;&#x8BD1;&#x5668;&#x4E2D;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x987A;&#x5229;&#x5730;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x6807;&#x51C6;&#x5E76;&#x4E0D;&#x4FDD;&#x8BC1;&#x5B83;&#x53EF;&#x884C;&#xFF0C;&#x4E3A;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#xFF0C;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/C/">#C++</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/C/">#C</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/Academic-Writing/">Academic Writing</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-5f4bad760706948f' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/C%E5%92%8C%E6%8C%87%E9%92%88/';
        this.page.identifier = 'C和指针/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'https-www-youngvoice-online-1' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Junhui Luo&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="西南交通大学官网" href="http://jwc.swjtu.edu.cn/index.html" target="_blank" rel="noopener">
                    
                    西南交通大学官网
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Taunt" href="https://blog.csdn.net/Taunt_" target="_blank" rel="noopener">
                    
                    Taunt
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>