<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>计组-指令系统 - 饮冰室</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta name="description" content="&amp;#x6307;&amp;#x4EE4;&amp;#x683C;&amp;#x5F0F;&amp;#x200B;    &amp;#x6307;&amp;#x4EE4;&amp;#x662F;&amp;#x673A;&amp;#x5668;&amp;#x8BED;&amp;#x8A00;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x8BED;&amp;#x53E5;&amp;#xFF0C;&amp;#x7531;&amp;#x64CD;&amp;#x4F5C;&amp;#x7801;&amp;#x5B57;&amp;#x6BB5;&amp;#x5">
<meta property="og:type" content="article">
<meta property="og:title" content="计组-指令系统">
<meta property="og:url" content="http://yoursite.com/%E8%AE%A1%E7%BB%84-%E6%8C%87%E4%BB%A4%E7%B3%BB%E7%BB%9F/index.html">
<meta property="og:site_name" content="饮冰室">
<meta property="og:description" content="&amp;#x6307;&amp;#x4EE4;&amp;#x683C;&amp;#x5F0F;&amp;#x200B;    &amp;#x6307;&amp;#x4EE4;&amp;#x662F;&amp;#x673A;&amp;#x5668;&amp;#x8BED;&amp;#x8A00;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x8BED;&amp;#x53E5;&amp;#xFF0C;&amp;#x7531;&amp;#x64CD;&amp;#x4F5C;&amp;#x7801;&amp;#x5B57;&amp;#x6BB5;&amp;#x5">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2020-08-14T15:16:36.000Z">
<meta property="article:modified_time" content="2020-08-16T09:43:28.497Z">
<meta property="article:author" content="Junhui Luo">
<meta property="article:tag" content="学习">
<meta property="article:tag" content="计算机组成原理">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/images/logo.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/Vision/">视觉</a>
            
            <a class="navbar-item "
               href="/categories/CPlus/">C++</a>
            
            <a class="navbar-item "
               href="/categories/Algorithm/">算法</a>
            
            <a class="navbar-item "
               href="/categories/Study/">学习</a>
            
            <a class="navbar-item "
               href="/about/">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目录">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#">1&nbsp;&nbsp;<b>指令格式</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">2&nbsp;&nbsp;<b>寻址技术</b></a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/luojunhui1" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            计组-指令系统
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-08-14T15:16:36.000Z" itemprop="datePublished">8月 14 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Study/">Study</a><span>></span><a class="article-category-link" href="/categories/Study/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86/">计算机组成原理</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            12 分钟 读完 (约 1850 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><h2><span id="&#x6307;&#x4EE4;&#x683C;&#x5F0F;">&#x6307;&#x4EE4;&#x683C;&#x5F0F;</span></h2><p>&#x200B;    &#x6307;&#x4EE4;&#x662F;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x7531;<strong>&#x64CD;&#x4F5C;&#x7801;&#x5B57;&#x6BB5;</strong>&#x548C;<strong>&#x5730;&#x5740;&#x7801;&#x5B57;&#x6BB5;</strong>&#x6784;&#x6210;&#x3002;&#x6307;&#x4EE4;&#x7684;&#x957F;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;&#x64CD;&#x4F5C;&#x7801;&#x7684;&#x957F;&#x5EA6;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x5730;&#x5740;&#x53CA;&#x957F;&#x5EA6;&#x3002;&#x82E5;&#x5728;&#x4E00;&#x4E2A;&#x6307;&#x4EE4;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6307;&#x4EE4;&#x957F;&#x5EA6;&#x90FD;&#x76F8;&#x7B49;&#xFF0C;&#x5219;&#x79F0;&#x8BE5;&#x6307;&#x4EE4;&#x7CFB;&#x7EDF;&#x4E3A;<strong>&#x5B9A;&#x957F;&#x6307;&#x4EE4;&#x5B57;&#x7ED3;&#x6784;</strong>&#xFF0C;&#x82E5;&#x5404;&#x79CD;&#x6307;&#x4EE4;&#x7684;&#x957F;&#x5EA6;&#x968F;&#x6307;&#x4EE4;&#x529F;&#x80FD;&#x800C;&#x5F02;&#xFF0C;&#x5C31;&#x79F0;&#x8BE5;&#x6307;&#x4EE4;&#x7CFB;&#x7EDF;&#x4E3A;<strong>&#x53D8;&#x957F;&#x6307;&#x4EE4;&#x5B57;&#x7ED3;&#x6784;</strong>&#x3002;</p>
<a id="more"></a>

<p>&#x200B;    &#x4ECE;<strong>&#x5730;&#x5740;&#x7ED3;&#x6784;</strong>&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECB;&#x7ECD;&#x4EE5;&#x4E0B;&#x4E94;&#x79CD;&#x6307;&#x4EE4;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x4E0B;&#x51FA;&#x73B0;&#x7684;&#x5730;&#x5740;&#x7686;&#x4E3A;<strong>&#x663E;&#x5730;&#x5740;</strong>&#xFF0C;&#x82E5;&#x662F;&#x6309;&#x7167;&#x5B9E;&#x73B0;&#x7EA6;&#x5B9A;&#xFF0C;&#x7528;&#x9690;&#x542B;&#x7684;&#x65B9;&#x5F0F;&#x7ED9;&#x51FA;&#x7684;&#x5730;&#x5740;&#x79F0;&#x4E3A;<strong>&#x9690;&#x5730;&#x5740;</strong>&#x3002;</p>
<ul>
<li>&#x56DB;&#x5730;&#x5740;&#x6307;&#x4EE4;&#xFF1A;&#x56DB;&#x4E2A;&#x5730;&#x5740;&#x5206;&#x522B;&#x4E3A;&#x64CD;&#x4F5C;&#x6570;1&#x5730;&#x5740;&#x3001;&#x64CD;&#x4F5C;&#x6570;2&#x5730;&#x5740;&#x3001;&#x7ED3;&#x679C;&#x5B58;&#x653E;&#x5730;&#x5740;&#x3001;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x5730;&#x5740;</li>
<li>&#x4E09;&#x5730;&#x5740;&#x6307;&#x4EE4;&#xFF1A;&#x76F8;&#x6BD4;&#x56DB;&#x5730;&#x5740;&#x6307;&#x4EE4;&#xFF0C;&#x5C11;&#x4E86;&#x201C;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x5730;&#x5740;&#x201D;&#x4E00;&#x9879;&#xFF0C;&#x5176;&#x4EA4;&#x7ED9;PC(Program Counter)&#x7ED9;&#x51FA;&#x3002;</li>
<li>&#x4E8C;&#x5730;&#x5740;&#x6307;&#x4EE4;&#xFF1A;&#x76F8;&#x6BD4;&#x4E09;&#x5730;&#x5740;&#x6307;&#x4EE4;&#xFF0C;&#x5C11;&#x4E86;&#x201C;&#x7ED3;&#x679C;&#x5B58;&#x653E;&#x5730;&#x5740;&#x201D;&#x4E00;&#x9879;&#xFF0C;&#x5C06;&#x64CD;&#x4F5C;&#x6570;1&#x5730;&#x5740;&#x89C6;&#x4E3A;<strong>&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5730;&#x5740;</strong>&#xFF0C;&#x64CD;&#x4F5C;&#x6570;2&#x5730;&#x5740;&#x89C6;&#x4E3A;<strong>&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x5730;&#x5740;</strong>&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4FDD;&#x5B58;&#x5728;<strong>&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5730;&#x5740;</strong>&#x4E2D;&#x3002;</li>
<li>&#x4E00;&#x5730;&#x5740;&#x6307;&#x4EE4;&#xFF1A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x5730;&#x5740;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x9690;&#x542B;&#x7ED9;&#x51FA;&#xFF0C;&#x5728;<strong>&#x7D2F;&#x52A0;&#x5BC4;&#x5B58;&#x5668;</strong>&#x4E2D;&#x3002;</li>
<li>&#x96F6;&#x5730;&#x5740;&#x6307;&#x4EE4;&#xFF1A;&#x96F6;&#x5730;&#x5740;&#x7684;&#x7B97;&#x672F;&#x903B;&#x8F91;&#x7C7B;&#x6307;&#x4EE4;&#x662F;&#x7528;&#x5728;&#x5806;&#x6808;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#xFF0C;&#x8349;&#x9C7C;&#x7B97;&#x672F;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7684;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x9690;&#x542B;&#x5730;&#x4ECE;&#x5806;&#x6808;&#x9876;&#x90E8;&#x5F39;&#x51FA;&#x3002;</li>
</ul>
<p>&#x6307;&#x4EE4;&#x7684;&#x64CD;&#x4F5C;&#x7801;&#x5206;&#x4E3A;<strong>&#x89C4;&#x6574;&#x6027;&#x7F16;&#x7801;&#xFF08;&#x5B9A;&#x957F;&#x7F16;&#x7801;&#xFF09;</strong>&#x548C;<strong>&#x975E;&#x89C4;&#x6574;&#x6027;&#x7F16;&#x7801;</strong>&#xFF0C;&#x6700;&#x5E38;&#x7528;&#x7684;&#x975E;&#x89C4;&#x6574;&#x578B;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x662F;<strong>&#x6269;&#x5C55;&#x64CD;&#x4F5C;&#x7801;&#x6CD5;</strong>&#xFF0C;&#x6269;&#x5C55;&#x64CD;&#x4F5C;&#x7801;&#x6CD5;&#x7684;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4F46;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x5141;&#x8BB8;&#x77ED;&#x7801;&#x662F;&#x957F;&#x7801;&#x7684;&#x524D;&#x7F00;&#x3002;</li>
<li>&#x5404;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x64CD;&#x4F5C;&#x7801;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x91CD;&#x590D;&#xFF0C;&#x4E14;&#x5404;&#x7C7B;&#x6307;&#x4EE4;&#x7684;&#x683C;&#x5F0F;&#x5B89;&#x6392;&#x5E94;&#x8BE5;&#x7EDF;&#x4E00;&#x3002;</li>
</ul>
<h2><span id="&#x5BFB;&#x5740;&#x6280;&#x672F;">&#x5BFB;&#x5740;&#x6280;&#x672F;</span></h2><p>&#x5BFB;&#x5740;&#x6280;&#x672F;&#x5305;&#x62EC;<strong>&#x7F16;&#x5740;&#x65B9;&#x5F0F;</strong>&#x548C;<strong>&#x5BFB;&#x5740;&#x65B9;&#x5F0F;</strong>&#x3002;&#x901A;&#x5E38;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x9700;&#x8981;&#x7F16;&#x5236;&#x7684;&#x6709;CPU&#x4E2D;&#x7684;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x548C;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x8BBE;&#x5907;&#x4E09;&#x79CD;&#xFF0C;&#x7F16;&#x5740;&#x5355;&#x4F4D;&#x5E38;&#x7528;&#x7684;&#x6709;<strong>&#x5B57;&#x7F16;&#x5740;</strong>&#x3001;<strong>&#x5B57;&#x8282;&#x7F16;&#x5740;</strong>&#x548C;<strong>&#x4F4D;&#x7F16;&#x5740;</strong>&#xFF0C;&#x8FD9;&#x662F;&#x6309;&#x7F16;&#x5740;&#x5355;&#x4F4D;&#x533A;&#x5206;&#x7684;&#xFF0C;&#x7F16;&#x5740;&#x5355;&#x4F4D;&#xFF08;&#x6700;&#x5C0F;&#x5BFB;&#x5740;&#x5355;&#x4F4D;&#xFF09;&#x4E0E;&#x4E3B;&#x5B58;&#x5BB9;&#x91CF;&#x51B3;&#x5B9A;&#x4E86;&#x6307;&#x4EE4;&#x683C;&#x5F0F;&#x4E2D;&#x6BCF;&#x4E2A;&#x5730;&#x5740;&#x7801;&#x7684;&#x4F4D;&#x6570;&#xFF0C;&#x5BB9;&#x91CF;&#x8D8A;&#x5927;&#xFF0C;&#x7F16;&#x5236;&#x5355;&#x4F4D;&#x8D8A;&#x5C0F;&#xFF0C;&#x5730;&#x5740;&#x7801;&#x4F4D;&#x6570;&#x81EA;&#x7136;&#x8D8A;&#x957F;&#x3002;</p>
<p>&#x5BFB;&#x5740;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;<strong>&#x6307;&#x4EE4;&#x5BFB;&#x5740;</strong>&#x548C;<strong>&#x6570;&#x636E;&#x5BFB;&#x5740;</strong>&#xFF0C;&#x524D;&#x8005;&#x5BFB;&#x627E;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x540E;&#x8005;&#x5BFB;&#x627E;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x5730;&#x5740;&#x3002;&#x6307;&#x4EE4;&#x5BFB;&#x5740;&#x53C8;&#x53EF;&#x5206;&#x4E3A;&#x987A;&#x5E8F;&#x5BFB;&#x5740;&#x548C;<strong>&#x8DF3;&#x8DC3;&#x5BFB;&#x5740;</strong>&#x3002;&#x987A;&#x5E8F;&#x5BFB;&#x5740;&#x53EF;&#x901A;&#x8FC7;PC&#x81EA;&#x52A8;&#x52A0;&#x4E00;&#x83B7;&#x5F97;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x8DF3;&#x8DC3;&#x5BFB;&#x5740;&#x9700;&#x8981;&#x7A0B;&#x5E8F;&#x8F6C;&#x79FB;&#x7C7B;&#x6307;&#x4EE4;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x8DF3;&#x8DC3;&#x5BFB;&#x5740;&#x7684;&#x8F6C;&#x79FB;&#x5730;&#x5740;&#x5F62;&#x6210;&#x65B9;&#x5F0F;&#x6709;&#x4E09;&#x79CD;&#xFF0C;&#x5206;&#x522B;&#x4E3A;&#xFF1A;<strong>&#x76F4;&#x63A5;&#xFF08;&#x7EDD;&#x5BF9;&#xFF09;&#x3001;&#x76F8;&#x5BF9;&#x548C;&#x95F4;&#x63A5;&#x5BFB;&#x5740;</strong>&#xFF0C;&#x8FD9;&#x4E0E;&#x6570;&#x636E;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x4E2D;&#x5BF9;&#x5E94;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x5BFB;&#x627E;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#x3002;&#x4EE5;&#x3002;&#x4E0B;&#x4EE5;&#x65B9;&#x5F0F;&#x8F83;&#x591A;&#x7684;&#x6570;&#x636E;&#x5BFB;&#x5740;&#x6765;&#x89E3;&#x91CA;&#x5404;&#x79CD;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li><p><strong>&#x7ACB;&#x5373;&#x5BFB;&#x5740;</strong>&#x3002;&#x6307;&#x4EE4;&#x4E2D;&#x64CD;&#x4F5C;&#x7801;&#x540E;&#x9762;&#x7684;&#x5B57;&#x6BB5;&#x4E0D;&#x662F;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x662F;&#x64CD;&#x4F5C;&#x6570;&#x672C;&#x8EAB;&#x3002;</p>
</li>
<li><p><strong>&#x5BC4;&#x5B58;&#x5668;&#x5BFB;&#x5740;</strong>&#x3002;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x6307;&#x4EE4;&#x4E2D;&#x64CD;&#x4F5C;&#x7801;&#x540E;&#x9762;&#x7ED9;&#x51FA;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x7F16;&#x53F7;&#x3002;</p>
</li>
<li><p><strong>&#x76F4;&#x63A5;&#x5BFB;&#x5740;</strong>&#x3002;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x4E3B;&#x5B58;&#x4E2D;&#xFF0C;&#x6307;&#x4EE4;&#x4E2D;&#x64CD;&#x4F5C;&#x7801;&#x540E;&#x9762;&#x7ED9;&#x51FA;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x6709;&#x6548;&#x5730;&#x5740;&#xFF0C;&#x6B64;&#x65F6;<strong>&#x5F62;&#x5F0F;&#x5730;&#x5740;</strong>&#x5373;&#x4E3A;<strong>&#x6709;&#x6548;&#x5730;&#x5740;</strong>&#x3002;</p>
</li>
<li><p><strong>&#x95F4;&#x63A5;&#x5BFB;&#x5740;</strong>&#x3002;&#x53EF;&#x5206;&#x4E3A;&#x4E00;&#x6B21;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x548C;&#x591A;&#x6B21;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#xFF0C;&#x6269;&#x5927;&#x4E86;&#x5BFB;&#x5740;&#x8303;&#x56F4;&#xFF0C;&#x53EF;&#x5C06;&#x4E3B;&#x5B58;&#x5355;&#x5143;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x7684;&#x5730;&#x5740;&#x6307;&#x9488;&#xFF0C;&#x4F46;&#x4E5F;&#x964D;&#x4F4E;&#x4E86;&#x53D6;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x5BF9;&#x4E8E;&#x591A;&#x6B21;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x6765;&#x8BF4;&#xFF0C;&#x5E94;&#x7ED9;&#x8BBE;&#x6709;<strong>&#x95F4;&#x5740;&#x6807;&#x5FD7;&#x4F4D;</strong>&#xFF0C;&#x6765;&#x533A;&#x5206;&#x5F53;&#x524D;&#x4E3B;&#x5B58;&#x5355;&#x5143;&#x5B58;&#x653E;&#x7684;&#x662F;&#x5730;&#x5740;&#x8FD8;&#x662F;&#x64CD;&#x4F5C;&#x6570;&#x3002;</p>
</li>
<li><p><strong>&#x5BC4;&#x5B58;&#x5668;&#x95F4;&#x63A5;&#x5BFB;&#x5740;</strong>&#x3002;&#x64CD;&#x4F5C;&#x6570;&#x653E;&#x5728;&#x4E3B;&#x5B58;&#x4E2D;&#xFF0C;&#x6307;&#x4EE4;&#x4E2D;&#x64CD;&#x4F5C;&#x7801;&#x540E;&#x9762;&#x7ED9;&#x51FA;&#x5B58;&#x6709;&#x64CD;&#x4F5C;&#x6570;&#x5730;&#x5740;&#x7684;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x7F16;&#x53F7;&#x3002;</p>
</li>
<li><p><strong>&#x53D8;&#x5740;&#x5BFB;&#x5740;</strong>&#x3002;&#x5C06;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5F62;&#x5F0F;&#x5730;&#x5740;&#x4E0E;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;$R_x$&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x76F8;&#x52A0;&#x5F97;&#x5230;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x6709;&#x6548;&#x5730;&#x5740;&#x3002;&#x5728;&#x5177;&#x6709;&#x53D8;&#x5740;&#x5BFB;&#x5740;&#x7684;&#x6307;&#x4EE4;&#x4E2D;&#xFF0C;&#x9664;&#x53BB;&#x64CD;&#x4F5C;&#x7801;&#x548C;&#x5F62;&#x5F0F;&#x5730;&#x5740;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x5E94;&#x5177;&#x6709;&#x53D8;&#x5740;&#x5BFB;&#x5740;&#x6807;&#x5FD7;&#xFF0C;&#x5F53;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x65F6;&#xFF0C;&#x8FD8;&#x5E94;&#x6307;&#x660E;&#x5177;&#x4F53;&#x7684;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x3002;<br>$$<br>S = ((R_x) + A)<br>$$</p>
</li>
<li><p><strong>&#x57FA;&#x5740;&#x5BFB;&#x5740;</strong>&#x3002;&#x5C06;&#x6307;&#x4EE4;&#x4E2D;&#x64CD;&#x4F5C;&#x7801;&#x540E;&#x9762;&#x7ED9;&#x51FA;&#x7684;&#x4F4D;&#x79FB;&#x91CF;D&#x4E0E;&#x57FA;&#x5740;&#x5BC4;&#x5B58;&#x5668;$R_b$&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x76F8;&#x52A0;&#xFF0C;&#x5F97;&#x5230;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x6709;&#x6548;&#x5730;&#x5740;&#x3002;&#x5728;&#x903B;&#x8F91;&#x751A;&#x81F3;&#x786C;&#x4EF6;&#x5B9E;&#x73B0;&#x4E0A;&#x90FD;&#x548C;&#x53D8;&#x5740;&#x5BFB;&#x5740;&#x5373;&#x4E3A;&#x76F8;&#x4F3C;&#x3002;&#x4F46;&#x662F;&#x4E8C;&#x8005;&#x7684;&#x4E3B;&#x8981;&#x4E0D;&#x540C;&#x5728;&#x4E8E;&#xFF1A;&#x53D8;&#x5740;&#x5BFB;&#x5740;&#x4E2D;&#x6307;&#x4EE4;&#x63D0;&#x4F9B;&#x57FA;&#x51C6;&#x503C;&#xFF08;&#x56FA;&#x5B9A;&#x7684;&#xFF09;&#xFF0C;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x63D0;&#x4F9B;&#x4FEE;&#x6539;&#x91CF;&#xFF08;&#x53EF;&#x53D8;&#x7684;&#xFF09;&#xFF1B;&#x800C;&#x57FA;&#x5740;&#x5BFB;&#x5740;&#x4E2D;&#xFF0C;&#x57FA;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x63D0;&#x4F9B;&#x57FA;&#x51C6;&#x503C;&#xFF0C;&#x6307;&#x4EE4;&#x4E2D;&#x63D0;&#x4F9B;&#x4F4D;&#x79FB;&#x91CF;&#x3002;&#x524D;&#x8005;&#x9762;&#x5411;&#x7528;&#x6237;&#xFF0C;&#x540E;&#x8005;&#x9762;&#x5411;&#x7CFB;&#x7EDF;&#x3002;</p>
</li>
<li><p><strong>&#x76F8;&#x5BF9;&#x5BFB;&#x5740;</strong>&#x3002;&#x76F8;&#x5BF9;&#x5BFB;&#x5740;&#x662F;&#x57FA;&#x5740;&#x5BFB;&#x5740;&#x7684;&#x4E00;&#x79CD;&#x53D8;&#x901A;&#xFF0C;&#x7531;PC&#x63D0;&#x4F9B;&#x57FA;&#x51C6;&#x5730;&#x5740;&#x3002;</p>
</li>
<li><p><strong>&#x9875;&#x9762;&#x5BFB;&#x5740;</strong>&#x3002;&#x9875;&#x9762;&#x5BFB;&#x5740;&#x53EF;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;3&#x7C7B;&#xFF1A;</p>
<ul>
<li><strong>&#x57FA;&#x9875;&#x5BFB;&#x5740;</strong>&#x3002;&#x53C8;&#x79F0;&#x96F6;&#x9875;&#x5BFB;&#x5740;&#xFF0C;&#x6B64;&#x65F6;&#x76F8;&#x5F53;&#x4E8E;&#x76F4;&#x63A5;&#x5BFB;&#x5740;&#x3002;</li>
<li><strong>&#x5F53;&#x524D;&#x9875;&#x5BFB;&#x5740;</strong>&#x3002;&#x53D6;PC&#x4E2D;&#x7684;&#x9AD8;&#x4F4D;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x5F97;&#x5230;&#x5F53;&#x524D;&#x6307;&#x4EE4;&#x6240;&#x5904;&#x9875;&#x9762;&#xFF0C;&#x548C;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5F62;&#x5F0F;&#x5730;&#x5740;&#x62FC;&#x63A5;&#xFF0C;&#x5F97;&#x5230;&#x64CD;&#x4F5C;&#x6570;&#x5730;&#x5740;&#x3002;</li>
<li><strong>&#x9875;&#x5BC4;&#x5B58;&#x5668;&#x5BFB;&#x5740;</strong>&#x3002;&#x9875;&#x9762;&#x5730;&#x5740;&#x53D6;&#x81EA;&#x9875;&#x5BC4;&#x5B58;&#x5668;&#x3002;</li>
</ul>
</li>
</ul>
<p>&#x9664;&#x4EE5;&#x4E0A;&#x5E38;&#x7528;&#x7684;9&#x4E2D;&#x57FA;&#x672C;&#x7684;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x5916;&#xFF0C;&#x8FD8;&#x6709;3&#x79CD;&#x7531;&#x8FD9;&#x4E9B;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x53D8;&#x578B;&#x6216;&#x7EC4;&#x5408;&#x800C;&#x6765;&#x7684;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x3002;</p>
<ul>
<li><p><strong>&#x81EA;&#x589E;&#x578B;&#x5BC4;&#x5B58;&#x5668;&#x95F4;&#x5740;</strong>&#x548C;<strong>&#x81EA;&#x51CF;&#x578B;&#x5BC4;&#x5B58;&#x5668;&#x95F4;&#x5740;</strong>&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5BC4;&#x5B58;&#x5668;&#x95F4;&#x63A5;&#x5BFB;&#x5740;&#x7684;&#x53D8;&#x578B;&#xFF0C;&#x5BF9;&#x4E8E;&#x81EA;&#x589E;&#x5BFB;&#x5740;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x7684;&#x5BFB;&#x5740;&#x64CD;&#x4F5C;&#x903B;&#x8F91;&#x4E3A;&#xFF1A;<br>$$<br>1.\space EA = (R_i)\<br>2.\space (Ri) = (R_i) + d\<br>$$<br><del>&#x8BB0;&#x4F5C;:EA = (R_i)+</del>&#x3002;&#x81EA;&#x51CF;&#x5BFB;&#x5740;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x4E00;&#x70B9;&#x683C;&#x5916;&#x6CE8;&#x610F;&#xFF0C;&#x81EA;&#x589E;&#x5BFB;&#x5740;&#x662F;&#x5148;&#x64CD;&#x4F5C;&#x518D;&#x4FEE;&#x6539;$((R_i)+)$,&#x800C;&#x81EA;&#x51CF;&#x5BFB;&#x5740;&#x662F;&#x5148;&#x4FEE;&#x6539;&#x518D;&#x64CD;&#x4F5C;$(-(R_i))$,&#x4FEE;&#x6539;&#x540E;&#x7684;&#x5185;&#x5BB9;&#x624D;&#x4F5C;&#x4E3A;&#x6709;&#x6548;&#x5730;&#x5740;&#x3002;</p>
</li>
<li><p><strong>&#x6269;&#x5C55;&#x53D8;&#x5740;&#x65B9;&#x5F0F;</strong>&#x3002;&#x628A;&#x53D8;&#x5740;&#x548C;&#x95F4;&#x5740;&#x4E24;&#x79CD;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x7EC4;&#x5408;&#xFF0C;&#x6309;&#x64CD;&#x4F5C;&#x987A;&#x5E8F;&#x5206;&#x4E3A;<strong>&#x524D;&#x53D8;&#x5740;</strong>&#x548C;<strong>&#x540E;&#x53D8;&#x5740;</strong>&#x4E24;&#x79CD;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x524D;&#x53D8;&#x5740;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x903B;&#x8F91;&#x3002;</p>
</li>
</ul>
<p>$$<br>EA = ((R_x)+A)\<br>  S = (((R_x)+A))<br>$$</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x540E;&#x53D8;&#x5740;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x903B;&#x8F91;&#xFF1A;<br>$$<br>EA = (R_x) + (A)\<br>S = ((R_x) + (A))<br>$$<br>&#x200B;                &#x540E;&#x53D8;&#x5740;&#x5148;&#x5C06;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5730;&#x5740;&#x7801;&#x53D8;&#x5740;&#xFF0C;&#x518D;&#x4E0E;&#x53D8;&#x5740;&#x503C;&#x8FD0;&#x7B97;&#x5F97;&#x5230;&#x6709;&#x6548;&#x5730;&#x5740;&#x3002;</p>
<ul>
<li><strong>&#x57FA;&#x5740;&#x53D8;&#x5740;&#x5BFB;&#x5740;</strong>&#x3002;&#x6700;&#x4E3A;&#x7075;&#x6D3B;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x5740;&#x7531;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x4F4D;&#x79FB;&#x91CF;&#xFF0C;&#x57FA;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x503C;&#x76F8;&#x52A0;&#x7684;&#x6765;&#xFF0C;&#x5373;</li>
</ul>
<p>$$<br>EA = (R_b) + (R_x) + D<br>$$</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E5%AD%A6%E4%B9%A0/">#学习</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86/">#计算机组成原理</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/%E8%AE%A1%E7%BB%84-%E5%AD%98%E5%82%A8%E7%B3%BB%E7%BB%9F%E5%92%8C%E7%BB%93%E6%9E%84/">计组-存储系统和结构</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/%E4%BA%92%E8%81%94%E7%BD%91%E6%90%9C%E7%B4%A2%E5%BC%95%E6%93%8E/">互联网搜索引擎</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-5f4bad760706948f' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/%E8%AE%A1%E7%BB%84-%E6%8C%87%E4%BB%A4%E7%B3%BB%E7%BB%9F/';
        this.page.identifier = '计组-指令系统/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'https-www-youngvoice-online-1' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Junhui Luo&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="西南交通大学官网" href="http://jwc.swjtu.edu.cn/index.html" target="_blank" rel="noopener">
                    
                    西南交通大学官网
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Taunt" href="https://blog.csdn.net/Taunt_" target="_blank" rel="noopener">
                    
                    Taunt
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Seldon" href="https://seldon1224.top" target="_blank" rel="noopener">
                    
                    Seldon
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>