<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>计算机网络 - PHENOMENON</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta property="og:type" content="article">
<meta property="og:title" content="计算机网络">
<meta property="og:url" content="http://yoursite.com/Computer-Network/index.html">
<meta property="og:site_name" content="PHENOMENON">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200924195950.jpg">
<meta property="og:image" content="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200929004132.jpg">
<meta property="og:image" content="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200930001744.jpg">
<meta property="article:published_time" content="2020-09-24T11:42:59.000Z">
<meta property="article:modified_time" content="2020-10-01T13:12:37.278Z">
<meta property="article:author" content="Junhui Luo">
<meta property="article:tag" content="Study">
<meta property="article:tag" content="Computer Network">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200924195950.jpg">





<link rel="icon" href="/images/logo.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/Vision/">视觉</a>
            
            <a class="navbar-item "
               href="/categories/CPlus/">C++</a>
            
            <a class="navbar-item "
               href="/categories/Algorithm/">算法</a>
            
            <a class="navbar-item "
               href="/categories/Study/">学习</a>
            
            <a class="navbar-item "
               href="/about/">关于</a>
            
            <a class="navbar-item "
               href="/categories/Linux/">Linux</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目录">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#">1&nbsp;&nbsp;<b>互联网概述</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#">2&nbsp;&nbsp;<b>互联网体系结构-物理层</b></a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/luojunhui1" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            计算机网络
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-09-24T11:42:59.000Z" itemprop="datePublished">9月 24 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Study/">Study</a><span>></span><a class="article-category-link" href="/categories/Study/Computer-Network/">Computer Network</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            29 分钟 读完 (约 4424 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p><img src="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200924195950.jpg" alt="&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;"></p>
<a id="more"></a>

<h2><span id="&#x4E92;&#x8054;&#x7F51;&#x6982;&#x8FF0;">&#x4E92;&#x8054;&#x7F51;&#x6982;&#x8FF0;</span></h2><p>&#x73B0;&#x4EE3;&#x793E;&#x4F1A;&#x6709;&#x5927;&#x5BB6;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;&#x4E09;&#x79CD;&#x7F51;&#x7EDC;&#xFF0C;&#x5373;<strong>&#x7535;&#x4FE1;&#x7F51;&#x7EDC;</strong>&#x3001;<strong>&#x6709;&#x7EBF;&#x7535;&#x89C6;&#x7F51;&#x7EDC;</strong>&#x548C;<strong>&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;</strong>&#xFF0C;&#x8FD9;&#x4E09;&#x8005;&#x5728;&#x6700;&#x521D;&#x8BBE;&#x8BA1;&#x65F6;&#x5404;&#x6709;&#x5206;&#x5DE5;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x5404;&#x81EA;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x7535;&#x4FE1;&#x7F51;&#x7EDC;&#x548C;&#x6709;&#x7EBF;&#x7535;&#x89C6;&#x7F51;&#x7EDC;&#x9010;&#x6E10;&#x878D;&#x5165;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x3002;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E09;&#x79CD;&#x7F51;&#x7EDC;&#x878D;&#x5408;&#x4E3A;&#x4E00;&#x79CD;&#x7F51;&#x7EDC;&#x6765;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x201C;<strong>&#x4E09;&#x7F51;&#x878D;&#x5408;</strong>&#x201D;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p><strong>&#x201C;&#x4E92;&#x8054;&#x7F51;&#x201D;&#xFF08;Internet&#xFF09;</strong>&#x548C;<strong>&#x201C;&#x4E92;&#x8FDE;&#x7F51;&#x201D;&#xFF08;internet&#xFF09;</strong>&#x6982;&#x5FF5;&#x5E76;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x540E;&#x8005;&#x901A;&#x5E38;&#x6CDB;&#x6307;&#x7531;&#x591A;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4E92;&#x8FDE;&#x800C;&#x6210;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;,&#x9700;&#x8981;&#x660E;&#x786E;&#x7684;&#x6982;&#x5FF5;&#x662F;&#xFF1A;&#x7F51;&#x7EDC;&#x628A;&#x591A;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x800C;&#x4E92;&#x8FDE;&#x7F51;&#x628A;&#x8BB8;&#x591A;&#x7F51;&#x7EDC;&#x901A;&#x8FC7;&#x8DEF;&#x7531;&#x5668;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6240;&#x4EE5;&#x4E92;&#x8FDE;&#x7F51;&#x4E5F;&#x662F;&#x201C;<strong>&#x7F51;&#x7EDC;&#x7684;&#x7F51;&#x7EDC;</strong>&#x201D;&#xFF0C;&#x800C;&#x524D;&#x8005;&#x901A;&#x5E38;&#x7279;&#x6307;&#x5F53;&#x524D;&#x5168;&#x7403;&#x6700;&#x5927;&#x7684;&#x3001;&#x5F00;&#x653E;&#x7684;&#x3001;&#x7531;&#x4F17;&#x591A;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x800C;&#x6210;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x4E92;&#x8FDE;&#x7F51;&#xFF0C;&#x5B83;&#x91C7;&#x7528;<strong>TCP/IP&#x534F;&#x8BAE;&#x65CF;</strong>&#x4F5C;&#x4E3A;&#x901A;&#x4FE1;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x524D;&#x8EAB;&#x4E3A;&#x7F8E;&#x56FD;&#x7684;ARPANET&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x53D1;&#x5C55;&#x5171;&#x6709;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;<strong>&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x662F;&#x4ECE;&#x5355;&#x4E2A;&#x7F51;&#x7EDC;ARPANET&#x5411;&#x4E92;&#x8FDE;&#x7F51;&#x53D1;&#x5C55;&#x7684;&#x8FC7;&#x7A0B;</strong>&#xFF0C;<strong>&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x662F;&#x5EFA;&#x6210;&#x4E86;&#x4E09;&#x7EA7;&#x7ED3;&#x6784;&#x7684;&#x4E92;&#x8054;&#x7F51;</strong>&#xFF0C;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x8D44;&#x52A9;&#x7684;NSFNET&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#xFF0C;&#x5206;&#x4E3A;&#x4E3B;&#x5E72;&#x7F51;&#x3001;&#x5730;&#x533A;&#x7F51;&#x548C;&#x6821;&#x56ED;&#x7F51;&#xFF08;&#x4F01;&#x4E1A;&#x7F51;&#xFF09;&#xFF0C;&#x5728;&#x8FD9;&#x9636;&#x6BB5;&#x8BB8;&#x591A;&#x516C;&#x53F8;&#x5C31;&#x5DF2;&#x7ECF;&#x63A5;&#x5165;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x51B3;&#x5B9A;&#x5C06;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4E3B;&#x5E72;&#x7F51;&#x4EA4;&#x7ED9;&#x79C1;&#x4EBA;&#x516C;&#x53F8;&#x6765;&#x7ECF;&#x8425;&#x3002;<strong>&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#x7684;&#x7279;&#x70B9;&#x662F;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x4E86;&#x591A;&#x5C42;&#x6B21;&#x7684;ISP&#xFF08;Internet Service Provider&#xFF09;&#x7ED3;&#x6784;&#x7684;&#x4E92;&#x8054;&#x7F51;</strong>&#xFF0C;&#x6839;&#x636E;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x8986;&#x76D6;&#x9762;&#x79EF;&#x4EE5;&#x53CA;&#x62E5;&#x6709;&#x7684;IP&#x5730;&#x5740;&#x6570;&#x76EE;&#x7684;&#x4E0D;&#x540C;&#xFF0C;ISP&#x4E5F;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#xFF1A;&#x4E3B;&#x5E72;ISP&#x3001;&#x5730;&#x533A;ISP&#x548C;&#x672C;&#x5730;ISP&#xFF0C;&#x968F;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x66F4;&#x5FEB;&#x5730;&#x8F6C;&#x53D1;&#x5206;&#x7EC4;&#x4EE5;&#x53CA;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5229;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x8D44;&#x6E90;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4EA4;&#x6362;&#x70B9;&#x51FA;&#x73B0;&#x4E86;&#xFF08;IXP, Internet eXchange Point&#xFF09;&#xFF0C;<strong>IXP&#x901A;&#x5E38;&#x91C7;&#x7528;&#x5DE5;&#x4F5C;&#x5728;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;</strong>&#xFF0C;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;&#x901A;&#x5E38;&#x7528;&#x5C40;&#x57DF;&#x7F51;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x4ECE;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x4E0A;&#x6765;&#x8BF4;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;<strong>&#x8FB9;&#x7F18;&#x90E8;&#x5206;</strong>&#x548C;<strong>&#x6838;&#x5FC3;&#x90E8;&#x5206;</strong>&#xFF0C;<strong>&#x524D;&#x8005;&#x7531;&#x7528;&#x6237;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7684;&#x8FDE;&#x63A5;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x4E3B;&#x673A;&#x7EC4;&#x6210;&#xFF0C;&#x540E;&#x8005;&#x7531;&#x7F51;&#x7EDC;&#x548C;&#x8FDE;&#x63A5;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x7EC4;&#x6210;</strong>&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4E3A;&#x8FB9;&#x7F18;&#x63D0;&#x4F9B;&#x8FDE;&#x901A;&#x6027;&#x548C;&#x4EA4;&#x6362;&#x3002;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8FB9;&#x7F18;&#x90E8;&#x5206;&#xFF0C;&#x7AEF;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;<strong>&#x5BA2;&#x6237;-&#x670D;&#x52A1;&#x5668;(Client-Server )&#x65B9;&#x5F0F;</strong>&#x53CA;<strong>&#x5BF9;&#x7B49;&#x65B9;&#x5F0F;&#xFF08;P2P, Peer-to-Peer&#xFF09;</strong>&#xFF0C;&#x524D;&#x8005;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x4E3A;&#x5BA2;&#x6237;&#x4E3A;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#x65B9;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x662F;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x65B9;&#xFF1B;&#x540E;&#x8005;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x8BF4;&#x4ECD;&#x7136;&#x662F;CS&#x65B9;&#x5F0F;&#xFF0C;&#x53EA;&#x662F;&#x5BF9;&#x7B49;&#x8FDE;&#x63A5;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x65E2;&#x662F;&#x5BA2;&#x6237;&#x53C8;&#x662F;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x662F;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x6784;&#x5EFA;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;<strong>&#x5206;&#x7EC4;&#x8F6C;&#x53D1;</strong>&#xFF0C;&#x91C7;&#x7528;<strong>&#x5B58;&#x50A8;&#x8F6C;&#x53D1;&#x6280;&#x672F;</strong>&#xFF0C;&#x5C06;&#x62A5;&#x6587;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x7B49;&#x957F;&#x7684;&#x6570;&#x636E;&#x6BB5;&#xFF0C;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x5FC5;&#x8981;&#x4FE1;&#x606F;&#x7EC4;&#x6210;&#x7684;&#x9996;&#x90E8;&#xFF0C;&#x5C31;&#x6784;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF08;&#x5305;&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x5206;&#x7EC4;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x8BF8;&#x5982;&#x76EE;&#x7684;&#x5730;&#x5740;&#x548C;&#x6E90;&#x5730;&#x5740;&#x7B49;&#x4E3B;&#x8981;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x90FD;&#x80FD;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x72EC;&#x7ACB;&#x5730;&#x9009;&#x62E9;&#x4F20;&#x8F93;&#x8DEF;&#x5F84;&#xFF0C;&#x5E76;&#x88AB;&#x6B63;&#x786E;&#x5730;&#x4EA4;&#x4ED8;&#x5230;&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#x7684;&#x7EC8;&#x70B9;&#x3002;<strong>&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#x65F6;&#x4F1A;&#x4E00;&#x6BB5;&#x4E00;&#x6BB5;&#x5730;&#x65AD;&#x7EED;&#x5360;&#x7528;&#x901A;&#x4FE1;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x975E;&#x5E38;&#x9002;&#x5408;&#x4F20;&#x9001;&#x7A81;&#x53D1;&#x5F0F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6570;&#x636E;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x7535;&#x8DEF;&#x4EA4;&#x6362;&#x6240;&#x9700;&#x7684;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x548C;&#x91CA;&#x653E;&#x8FDE;&#x63A5;&#x7684;&#x5F00;&#x9500;</strong>&#xFF0C;&#x4F20;&#x8F93;&#x7684;&#x6548;&#x7387;&#x5C31;&#x66F4;&#x9AD8;&#x3002;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x901A;&#x4FE1;&#x65F6;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5E26;&#x5BBD;&#xFF0C;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x65F6;&#x5EF6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x7F51;&#x4E5F;&#x9700;&#x8981;&#x5177;&#x6709;&#x5904;&#x7406;&#x5305;&#x5934;&#x4E0A;&#x7684;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200929004132.jpg" alt="&#x7535;&#x8DEF;&#x4EA4;&#x6362; &#x62A5;&#x6587;&#x4EA4;&#x6362; &#x5206;&#x7EC4;&#x4EA4;&#x6362;"></p>
<p>&#x4E92;&#x8054;&#x7F51;&#x6709;&#x4E24;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5373;<strong>&#x8FDE;&#x901A;&#x6027;</strong>&#x548C;<strong>&#x8D44;&#x6E90;&#x5171;&#x4EAB;</strong>&#xFF0C;&#x524D;&#x8005;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x7ECF;&#x6D4E;&#x3001;&#x4FBF;&#x6377;&#x7684;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x540E;&#x8005;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4FBF;&#x6377;&#x5730;&#x5229;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#x3002;</p>
<p><strong>&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;</strong>&#x9700;&#x8981;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6982;&#x5FF5;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#xFF0C;&#x5B83;&#x6307;&#x7531;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x3001;&#x53EF;&#x7F16;&#x7A0B;&#x7684;&#x786C;&#x4EF6;&#x4E92;&#x8FDE;&#x800C;&#x6210;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6309;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7C7B;&#x6807;&#x51C6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x5206;&#x4E3A;&#xFF1A;</p>
<ul>
<li>&#x6309;&#x7F51;&#x7EDC;&#x4F5C;&#x7528;&#x7684;&#x8303;&#x56F4;&#x5206;&#x7C7B;&#xFF1A;<strong>&#x5E7F;&#x57DF;&#x7F51;&#xFF08;WAN,Wide Area Network&#xFF09;&#x3001;&#x57CE;&#x57DF;&#x7F51;(MAN,Metropolitan Area Network)&#x3001;&#x5C40;&#x57DF;&#x7F51;(LAN,Local Area Network)&#x3001;&#x4E2A;&#x4EBA;&#x533A;&#x57DF;&#x7F51;(PAN,Personal Area Network)</strong>&#x3002;</li>
<li>&#x6309;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x8005;&#x5206;&#x7C7B;&#xFF1A;<strong>&#x516C;&#x7528;&#x7F51;&#x3001;&#x4E13;&#x7528;&#x7F51;</strong></li>
</ul>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x628A;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5373;<strong>&#x63A5;&#x5165;&#x7F51;</strong>&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x65E2;&#x4E0D;&#x5C5E;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x4E5F;&#x4E0D;&#x5C5E;&#x4E8E;&#x8FB9;&#x7F18;&#x90E8;&#x5206;&#xFF0C;<strong>&#x4ECE;&#x8986;&#x76D6;&#x8303;&#x56F4;&#x6765;&#x770B;&#xFF0C;&#x5F88;&#x591A;&#x63A5;&#x5165;&#x7F51;&#x8FD8;&#x5C5E;&#x4E8E;&#x5C40;&#x57DF;&#x7F51;</strong>&#x3002;</p>
<p>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x7684;&#x6982;&#x5FF5;&#x4E2D;&#xFF0C;&#x5206;&#x5C42;&#x6B21;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x662F;&#x6700;&#x57FA;&#x672C;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;<strong>&#x5C06;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x9762;&#x5BF9;&#x7684;&#x5E9E;&#x5927;&#x800C;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x8F6C;&#x5316;&#x4E3A;&#x82E5;&#x5E72;&#x8F83;&#x5C0F;&#x7684;&#x6613;&#x4E8E;&#x7814;&#x7A76;&#x548C;&#x5904;&#x7406;&#x7684;&#x5C40;&#x90E8;&#x95EE;&#x9898;</strong>&#xFF0C;&#x5206;&#x5C42;&#x53EF;&#x4EE5;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x597D;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5404;&#x5C42;&#x4E4B;&#x95F4;&#x662F;&#x72EC;&#x7ACB;&#x7684;</li>
<li>&#x7075;&#x6D3B;&#x6027;&#x597D;</li>
<li>&#x7ED3;&#x6784;&#x4E0A;&#x53EF;&#x5206;&#x9694;&#x5F00;</li>
<li>&#x6613;&#x4E8E;&#x5B9E;&#x73B0;&#x548C;&#x7EF4;&#x62A4;</li>
<li>&#x80FD;&#x4FC3;&#x8FDB;&#x6807;&#x51C6;&#x5316;&#x5DE5;&#x4F5C;</li>
</ul>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5206;&#x5C42;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x7F3A;&#x70B9;&#xFF0C;&#x4F8B;&#x5982;&#x6709;&#x4E9B;&#x529F;&#x80FD;&#x4F1A;&#x5728;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#x4E2D;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#xFF0C;&#x56E0;&#x800C;&#x4EA7;&#x751F;&#x4E86;&#x989D;&#x5916;&#x7684;&#x5F00;&#x9500;&#x3002;&#x5206;&#x5C42;&#x5E94;&#x4F7F;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x529F;&#x80FD;&#x90FD;&#x5C3D;&#x91CF;&#x660E;&#x786E;&#xFF0C;&#x5C42;&#x6570;&#x592A;&#x5C11;&#x5C31;&#x4F1A;&#x4F7F;&#x6BCF;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x5C42;&#x6570;&#x592A;&#x591A;&#x53C8;&#x4F1A;&#x5728;&#x63CF;&#x8FF0;&#x548C;&#x7EFC;&#x5408;&#x5404;&#x5C42;&#x529F;&#x80FD;&#x7684;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x4EFB;&#x52A1;&#x65F6;&#x9047;&#x5230;&#x8F83;&#x591A;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x901A;&#x5E38;&#x5404;&#x5C42;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#xFF1A;</p>
<ul>
<li>&#x5DEE;&#x9519;&#x63A7;&#x5236;&#xFF1A;&#x4F7F;&#x76F8;&#x5E94;&#x5C42;&#x6B21;&#x5BF9;&#x7B49;&#x65B9;&#x7684;&#x901A;&#x4FE1;&#x66F4;&#x52A0;&#x53EF;&#x9760;&#x3002;</li>
<li>&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF1A;&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x53D1;&#x9001;&#x901F;&#x7387;&#x5FC5;&#x987B;&#x4F7F;&#x63A5;&#x6536;&#x7AEF;&#x6765;&#x5F97;&#x53CA;&#x63A5;&#x53D7;&#x3002;</li>
<li>&#x5206;&#x6BB5;&#x548C;&#x91CD;&#x88C5;&#xFF1A;&#x53D1;&#x9001;&#x7AEF;&#x5C06;&#x8981;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x5757;&#x5212;&#x5206;&#x4E3A;&#x66F4;&#x5C0F;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#x5C06;&#x5176;&#x8FD8;&#x539F;&#x3002;</li>
<li>&#x590D;&#x7528;&#x548C;&#x5206;&#x7528;&#xFF1A;&#x53D1;&#x9001;&#x7AEF;&#x9AD8;&#x5C42;&#x7ED8;&#x753B;&#x590D;&#x7528;&#x4E00;&#x6761;&#x5E95;&#x5C42;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#x518D;&#x8FDB;&#x884C;&#x5206;&#x7528;&#x3002;(&#x76EE;&#x6D4B;&#x53EA;&#x8981;&#x67D0;&#x5C42;&#x5177;&#x6709;&#x4E0A;&#x4E0B;&#x5C42;&#x5C31;&#x8981;&#x6C42;&#x5B9E;&#x73B0;&#x8BE5;&#x529F;&#x80FD;&#xFF1F;)</li>
<li>&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x548C;&#x91CA;&#x653E;&#xFF1A;&#x4EA4;&#x6362;&#x6570;&#x636E;&#x524D;&#x5148;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x6570;&#x636E;&#x4F20;&#x9001;&#x7ED3;&#x675F;&#x540E;&#x91CA;&#x653E;&#x8FDE;&#x63A5;&#x3002;</li>
</ul>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x4F7F;&#x4E0D;&#x540C;&#x4F53;&#x7CFB;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x7528;&#x6237; &#x80FD;&#x591F;&#x76F8;&#x4E92;&#x8FDE;&#x63A5;&#x4EA4;&#x4E92;&#x4FE1;&#x606F;&#xFF0C;ISO&#xFF08;&#x56FD;&#x9645;&#x6807;&#x51C6;&#x5316;&#x7EC4;&#x7EC7;&#xFF09;&#x63D0;&#x51FA;&#x4E86;<strong>OSI/RM(Open Systems Interconnection Reference Model, &#x5F00;&#x653E;&#x7CFB;&#x7EDF;&#x4E92;&#x8FDE;&#x57FA;&#x672C;&#x53C2;&#x8003;&#x6A21;&#x578B;)</strong>&#xFF0C;&#x4F46;&#x5728;&#x5B83;&#x5F97;&#x4EE5;&#x5B8C;&#x5584;&#x4E4B;&#x524D;&#xFF0C;&#x57FA;&#x4E8E;<strong>TCP/IP</strong>&#x7684;&#x4E92;&#x8054;&#x7F51;&#x5DF2;&#x7ECF;&#x5728;&#x5168;&#x7403;&#x8303;&#x56F4;&#x5185;&#x6210;&#x529F;&#x5730;&#x8FD0;&#x884C;&#x4E86;&#x3002;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x8BD5;&#x56FE;&#x660E;&#x786E;&#x7F51;&#x7EDC;&#x4E2D;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x7684;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;&#x4EE5;&#x53CA;&#x6709;&#x5173;&#x7684;&#x540C;&#x6B65;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x7531;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;</p>
<ul>
<li><strong>&#x8BED;&#x6CD5;&#xFF1A;&#x6570;&#x636E;&#x4E0E;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x7684;&#x7ED3;&#x6784;&#x6216;&#x683C;&#x5F0F;</strong></li>
<li><strong>&#x8BED;&#x4E49;&#xFF1A;&#x9700;&#x8981;&#x53D1;&#x51FA;&#x4F55;&#x79CD;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x54CD;&#x5E94;&#x63A7;&#x5236;&#x4FE1;&#x606F;</strong></li>
<li><strong>&#x540C;&#x6B65;&#xFF1A;&#x5BF9;&#x4E8B;&#x4EF6;&#x7684;&#x5B9E;&#x73B0;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x8BF4;&#x660E;</strong></li>
</ul>
<p>OSI&#x7684;&#x4E03;&#x5C42;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7406;&#x8BBA;&#x5B8C;&#x6574;&#x4F46;&#x590D;&#x6742;&#x53C8;&#x4E0D;&#x5B9E;&#x7528;&#xFF0C;TCP/IP&#x7684;&#x56DB;&#x5C42;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4F46;&#x5B9E;&#x8D28;&#x4E0A;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x53EA;&#x6709;&#x6700;&#x4E0A;&#x9762;&#x7684;&#x4E09;&#x5C42;&#x3002;<strong>&#x4EC5;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x5019;</strong>&#xFF0C;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x4E3A;&#x4ECB;&#x7ECD;&#x4E92;&#x8054;&#x7F51;&#x7ED3;&#x6784;&#x800C;&#x8BBE;&#x8BA1;&#x7684;5&#x5C42;&#x534F;&#x8BAE;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200930001744.jpg" alt="&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;"></p>
<p>&#x8FD9;&#x91CC;&#x4F5C;&#x4E3A;&#x6982;&#x8FF0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7B80;&#x8FF0;&#x5404;&#x90E8;&#x5206;&#x7684;&#x529F;&#x80FD;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x5C42;</th>
<th>&#x529F;&#x80FD;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x5E94;&#x7528;&#x5C42;&#xFF08;application layer&#xFF09;</td>
<td>&#x901A;&#x8FC7;<strong>&#x5E94;&#x7528;&#x8FDB;&#x7A0B;</strong>&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x6765;&#x5B8C;&#x6210;&#x7279;&#x5B9A;&#x7684;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#xFF0C;&#x5B9A;&#x4E49;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x548C;&#x4EA4;&#x4E92;&#x7684;&#x89C4;&#x5219;&#x3002;</td>
</tr>
<tr>
<td>&#x8FD0;&#x8F93;&#x5C42;(transport layer)</td>
<td>&#x8D1F;&#x8D23;&#x5411;&#x4E24;&#x53F0;&#x4E3B;&#x673A;&#x4E2D;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x63D0;&#x4F9B;&#x901A;&#x7528;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x670D;&#x52A1;&#xFF0C;&#x4F20;&#x8F93;&#x5C42;&#x6700;&#x4E3B;&#x8981;&#x4F7F;&#x7528;TCP(Transmission Control Protocol,&#x6570;&#x636E;&#x4F20;&#x8F93;&#x63A7;&#x5236;&#x534F;&#x8BAE;)&#x548C;UDP(User Datagram Protocol,&#x7528;&#x6237;&#x6570;&#x636E;&#x62A5;&#x534F;&#x8BAE;),</td>
</tr>
<tr>
<td>&#x7F51;&#x7EDC;&#x5C42;&#xFF08;network layer&#xFF09;</td>
<td>&#x8D1F;&#x8D23;&#x4E3A;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x7F51;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x4E3B;&#x673A;&#x63D0;&#x4F9B;&#x901A;&#x4FE1;&#x670D;&#x52A1;&#xFF0C;<strong>&#x53D1;&#x9001;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x7531;&#x7F51;&#x7EDC;&#x5C42;&#x628A;&#x8FD0;&#x8F93;&#x5C42;&#x4EA7;&#x751F;&#x7684;&#x62A5;&#x6587;&#x6BB5;&#x6216;&#x7528;&#x6237;&#x6570;&#x636E;&#x5C01;&#x88C5;&#x6210;&#x5206;&#x7EC4;&#x6216;&#x5305;&#x8FDB;&#x884C;&#x4F20;</strong>&#x9001;&#xFF0C;&#x5728;TCP/IP&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x4F7F;&#x7528;IP(Internet Protocol,&#x7F51;&#x9645;&#x534F;&#x8BAE;)&#x534F;&#x8BAE;&#xFF0C;&#x6240;&#x4EE5;<strong>&#x5728;&#x6B64;&#x4E8C;&#x8005;&#x6761;&#x4EF6;&#x7B26;&#x5408;&#x7684;&#x6761;&#x4EF6;&#x4E0B;</strong>&#xFF0C;&#x4E5F;&#x5C06;&#x5206;&#x7EC4;&#x79F0;&#x4F5C;IP&#x6570;&#x636E;&#x62A5;&#x3002;</td>
</tr>
<tr>
<td>&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#xFF08;data link layer&#xFF09;</td>
<td>&#x5728;<strong>&#x4E24;&#x4E2A;&#x76F8;&#x90BB;&#x7ED3;&#x70B9;</strong>&#x4E4B;&#x95F4;&#x4F20;&#x9001;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5C06;&#x7F51;&#x7EDC;&#x5C42;&#x4EA4;&#x4E0B;&#x6765;&#x7684;IP&#x6570;&#x636E;&#x62A5;&#x7EC4;&#x88C5;&#x6210;&#x5E27;&#xFF0C;&#x5728;&#x4E24;&#x4E2A;&#x76F8;&#x90BB;&#x7ED3;&#x70B9;&#x95F4;&#x7684;&#x94FE;&#x8DEF;&#x4E0A;&#x4F20;&#x9001;&#x5E27;&#xFF0C;<strong>&#x6BCF;&#x4E00;&#x5E27;&#x5305;&#x62EC;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x548C;&#x6570;&#x636E;</strong>&#x3002;&#x5728;&#x63A5;&#x53D7;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x4F7F;&#x63A5;&#x6536;&#x7AEF;&#x80FD;&#x77E5;&#x9053;&#x4E00;&#x5E27;&#x4E2D;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x7684;&#x4F4D;&#x7F6E;&#x53CA;&#x5E27;&#x4E2D;&#x6709;&#x65E0;&#x5DEE;&#x9519;&#x3002;</td>
</tr>
<tr>
<td>&#x7269;&#x7406;&#x5C42;&#xFF08;physical layer&#xFF09;</td>
<td>&#x5728;&#x7269;&#x7406;&#x5C42;&#x4E0A;&#x4F20;&#x9001;&#x6570;&#x636E;&#x7684;&#x5355;&#x4F4D;&#x4F7F;bit&#xFF0C;&#x7269;&#x7406;&#x5C42;&#x8981;&#x8003;&#x8651;&#x4E0E;&#x4F20;&#x8F93;&#x5A92;&#x4ECB;&#x7684;&#x63A5;&#x53E3;&#x6709;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x673A;&#x68B0;&#x7279;&#x6027;&#x3001;&#x7535;&#x6C14;&#x7279;&#x6027;&#x3001;&#x529F;&#x80FD;&#x7279;&#x6027;&#x548C;&#x8FC7;&#x7A0B;&#x7279;&#x6027;&#x3002;<strong>&#x6CE8;&#x610F;&#xFF0C;&#x4F20;&#x9012;&#x4FE1;&#x606F;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x4F20;&#x8F93;&#x5A92;&#x4ECB;&#x5E76;&#x4E0D;&#x5C5E;&#x4E8E;&#x7269;&#x7406;&#x5C42;&#x3002;</strong></td>
</tr>
</tbody></table>
<p>&#x5728;&#x4E86;&#x89E3;&#x4E86;&#x4EE5;&#x4E0A;&#x53EA;&#x662F;&#x540E;&#xFF0C;&#x8FD9;&#x91CC;&#x518D;&#x5BF9;&#x534F;&#x8BAE;&#x7684;&#x5185;&#x6DB5;&#x505A;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x89E3;&#x91CA;&#xFF1A;<strong>&#x534F;&#x8BAE;&#x662F;&#x63A7;&#x5236;&#x4E24;&#x4E2A;&#x5BF9;&#x7B49;&#x5B9E;&#x4F53;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x7684;&#x89C4;&#x5219;&#x7684;&#x96C6;&#x5408;</strong>&#x3002;&#x5728;&#x534F;&#x8BAE;&#x7684;&#x63A7;&#x5236;&#x4E0B;&#xFF0C;&#x4E24;&#x4E2A;&#x5BF9;&#x7B49;&#x5B9E;&#x4F53;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x4F7F;&#x5F97;&#x672C;&#x5C42;&#x80FD;&#x591F;&#x5411;&#x4E0A;&#x4E00;&#x5C42;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x8981;&#x5B9E;&#x73B0;&#x672C;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x8FD8;&#x8981;&#x4F7F;&#x7528;&#x4E0B;&#x4E00;&#x5C42;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x3002;&#x4ECE;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x5BF9;&#x7B49;&#x201D;&#x7684;&#x5185;&#x6DB5;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;<strong>&#x534F;&#x8BAE;&#x7684;&#x4F5C;&#x7528;&#x5B9E;&#x4F53;&#x662F;&#x201C;&#x6C34;&#x5E73;&#x201D;&#x7684;&#xFF0C;&#x4F46;&#x201C;&#x670D;&#x52A1;&#x201D;&#x662F;&#x201D;&#x5782;&#x76F4;&#x201C;&#x7684;&#x3002;</strong></p>
<h2><span id="&#x4E92;&#x8054;&#x7F51;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;-&#x7269;&#x7406;&#x5C42;">&#x4E92;&#x8054;&#x7F51;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;-&#x7269;&#x7406;&#x5C42;</span></h2><p>&#x7269;&#x7406;&#x5C42;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x5B9E;&#x73B0;&#x5728;&#x5404;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x4F20;&#x8F93;&#x5A92;&#x4F53;&#x4E0A;&#x4F20;&#x8F93;&#x6BD4;&#x7279;&#x6D41;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6307;&#x5177;&#x4F53;&#x7684;&#x4F20;&#x8F93;&#x5A92;&#x4F53;&#xFF0C;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x8FD9;&#x4E00;&#x4EFB;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x7269;&#x7406;&#x5C42;&#x7684;&#x7279;&#x6027;&#x63CF;&#x8FF0;&#x4E3A;&#x4EE5;&#x4E0B;4&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li><p>&#x673A;&#x68B0;&#x7279;&#x6027;&#xFF1A;&#x6307;&#x660E;&#x63A5;&#x53E3;&#x6240;&#x7528;&#x7684;&#x63A5;&#x7EBF;&#x5668;&#x7684;&#x5F62;&#x72B6;&#x548C;&#x5C3A;&#x5BF8;&#x3001;&#x5F15;&#x811A;&#x6570;&#x76EE;&#x548C;&#x6392;&#x5217;&#x3001;&#x6392;&#x5217;&#x548C;&#x9501;&#x5B9A;&#x88C5;&#x7F6E;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x7535;&#x6C14;&#x7279;&#x6027;&#xFF1A;&#x6307;&#x660E;&#x5728;&#x63A5;&#x53E3;&#x7535;&#x7F06;&#x7684;&#x5404;&#x6761;&#x7EBF;&#x4E0A;&#x51FA;&#x73B0;&#x7684;&#x7535;&#x538B;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
</li>
<li><p>&#x529F;&#x80FD;&#x7279;&#x6027;&#xFF1A;&#x6307;&#x660E;&#x67D0;&#x6761;&#x7EBF;&#x4E0A;&#x7684;&#x67D0;&#x4E00;&#x7535;&#x5E73;&#x7684;&#x7535;&#x538B;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
</li>
<li><p>&#x8FC7;&#x7A0B;&#x7279;&#x6027;&#xFF1A;&#x6307;&#x660E;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x7684;&#x53EF;&#x80FD;&#x7684;&#x5404;&#x79CD;&#x4E8B;&#x4EF6;&#x7684;&#x51FA;&#x73B0;&#x987A;&#x5E8F;&#x3002;</p>
</li>
</ul>
<p>&#x5176;&#x5B9E;&#x7269;&#x7406;&#x5C42;&#x7684;&#x542B;&#x4E49;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x4F59;&#x4E0B;&#x8BE5;&#x8BF4;&#x660E;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x7269;&#x7406;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x4E0A;&#x7684;&#x65B9;&#x4FBF;&#xFF0C;&#x4EE5;&#x4E0B;&#x4E5F;&#x5BF9;&#x6570;&#x636E;&#x901A;&#x4FE1;&#x505A;&#x7B80;&#x77ED;&#x7684;&#x6982;&#x8FF0;&#x3002;</p>
<p>&#x6570;&#x636E;&#x901A;&#x4FE1;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x6570;&#x636E;&#x6A21;&#x578B;&#x901A;&#x4FE1;&#x7CFB;&#x7EDF;&#x90E8;&#x5206;</th>
<th>&#x7EC4;&#x6210;&#x90E8;&#x5206;</th>
<th>&#x5907;&#x6CE8;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x6E90;&#x7CFB;&#x7EDF;&#xFF08;&#x53D1;&#x9001;&#x7AEF;&#x3001;&#x53D1;&#x9001;&#x65B9;&#xFF09;</td>
<td>&#x6E90;&#x70B9;&#xFF08;&#x539F;&#x7AD9;&#x3001;&#x4FE1;&#x6E90;&#xFF09;&#xFF1B;&#x53D1;&#x9001;&#x5668;</td>
<td>&#x6E90;&#x70B9;&#x8BBE;&#x5907;&#x4EA7;&#x751F;&#x6570;&#x636E;&#xFF1B;&#x53D1;&#x9001;&#x5668;&#x5C06;&#x6E90;&#x70B9;&#x751F;&#x6210;&#x7684;&#x6BD4;&#x7279;&#x6D41;&#x7F16;&#x7801;&#x4EE5;&#x4FBF;&#x4E8E;&#x4F20;&#x8F93;&#x4F7F;&#x7528;&#xFF1B;</td>
</tr>
<tr>
<td>&#x4F20;&#x8F93;&#x7CFB;&#x7EDF;&#xFF08;&#x4F20;&#x8F93;&#x7F51;&#x7EDC;&#xFF09;</td>
<td>&#x7B80;&#x5355;&#x7684;&#x4F20;&#x8F93;&#x7EBF;&#x6216;&#x8005;&#x590D;&#x6742;&#x7684;&#x4F20;&#x8F93;&#x7F51;&#x7EDC;</td>
<td></td>
</tr>
<tr>
<td>&#x76EE;&#x7684;&#x7CFB;&#x7EDF;&#xFF08;&#x63A5;&#x6536;&#x7AEF;&#x3001;&#x63A5;&#x6536;&#x65B9;&#xFF09;</td>
<td>&#x63A5;&#x6536;&#x5668;&#xFF1B;&#x7EC8;&#x70B9;</td>
<td>&#x63A5;&#x53D7;&#x4F20;&#x8F93;&#x7CFB;&#x7EDF;&#x4F20;&#x9001;&#x8FC7;&#x6765;&#x7684;&#x4FE1;&#x53F7;&#x5E76;&#x5C06;&#x5176;&#x89E3;&#x7801;&#x8FD8;&#x539F;&#xFF1B;(&#x4E66;&#x4E2D;&#x8BF4;&#x8FD8;&#x539F;&#x6210;&#x53D1;&#x9001;&#x7AEF;&#x4EA7;&#x751F;&#x7684;&#x6BD4;&#x7279;&#x6D41;&#xFF0C;&#x4F46;&#x53D1;&#x9001;&#x7AEF;&#x8F93;&#x51FA;&#x7684;&#x6BD4;&#x7279;&#x6D41;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7ECF;&#x8FC7;&#x7F16;&#x7801;&#x7684;&#xFF0C;&#x5E94;&#x662F;&#x6E90;&#x70B9;&#x4EA7;&#x751F;&#x7684;&#x6BD4;&#x7279;&#x6D41;&#x624D;&#x5BF9;&#xFF1F;)&#x4ECE;&#x63A5;&#x6536;&#x5668;&#x83B7;&#x53D6;&#x4F20;&#x9001;&#x8FC7;&#x6765;&#x7684;&#x6570;&#x5B57;&#x6BD4;&#x7279;&#x6D41;&#x5E76;&#x5C06;&#x5176;&#x8F93;&#x51FA;&#x3002;</td>
</tr>
</tbody></table>
<p>&#x4FE1;&#x9053;&#x662F;&#x5411;&#x67D0;&#x4E00;&#x65B9;&#x5411;&#x4F20;&#x8F93;&#x6D88;&#x606F;&#x7684;&#x5A92;&#x4F53;&#xFF0C;&#x4E0E;&#x7535;&#x8DEF;&#x5E76;&#x4E0D;&#x7B49;&#x540C;&#xFF0C;&#x4E00;&#x6761;&#x7535;&#x8DEF;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x6761;&#x53D1;&#x9001;&#x4FE1;&#x9053;&#x548C;&#x63A5;&#x6536;&#x4FE1;&#x9053;&#x3002;&#x4ECE;&#x4FE1;&#x9053;&#x53CC;&#x65B9;&#x4FE1;&#x606F;&#x4EA4;&#x4E92;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x770B;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x57FA;&#x672C;&#x65B9;&#x5F0F;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x4FE1;&#x9053;&#x4FE1;&#x606F;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;</th>
<th>&#x542B;&#x4E49;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x5355;&#x5411;&#x901A;&#x4FE1;&#xFF08;&#x5355;&#x5DE5;&#x901A;&#x4FE1;&#xFF09;</td>
<td>&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x7684;&#x901A;&#x4FE1;&#x800C;&#x6CA1;&#x6709;&#x53CD;&#x65B9;&#x5411;&#x7684;&#x4EA4;&#x4E92;&#xFF1B;&#x53EA;&#x9700;&#x4E00;&#x6761;&#x4FE1;&#x9053;</td>
</tr>
<tr>
<td>&#x53CC;&#x5411;&#x4EA4;&#x66FF;&#x901A;&#x4FE1;&#xFF08;&#x534A;&#x53CC;&#x5DE5;&#x901A;&#x4FE1;&#xFF09;</td>
<td>&#x53CC;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#xFF1B;&#x9700;&#x4E24;&#x6761;&#x4FE1;&#x9053;</td>
</tr>
<tr>
<td>&#x53CC;&#x5411;&#x540C;&#x65F6;&#x901A;&#x4FE1;&#xFF08;&#x5168;&#x53CC;&#x5DE5;&#x901A;&#x4FE1;&#xFF09;</td>
<td>&#x901A;&#x4FE1;&#x53CC;&#x65B9;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x6D88;&#x606F;&#xFF1B;&#x9700;&#x4E24;&#x6761;&#x4FE1;&#x9053;</td>
</tr>
</tbody></table>
<p>&#x6765;&#x81EA;&#x4FE1;&#x6E90;&#x7684;&#x4FE1;&#x53F7;&#x79F0;&#x4E3A;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x5305;&#x542B;&#x5F88;&#x591A;&#x4F4E;&#x9891;&#x6210;&#x5206;&#x751A;&#x81F3;&#x6709;&#x76F4;&#x6D41;&#x6210;&#x5206;&#xFF0C;&#x4F46;&#x8BB8;&#x591A;&#x4FE1;&#x9053;&#x5E76;&#x4E0D;&#x80FD;&#x4F20;&#x8F93;&#x8FD9;&#x79CD;&#x4F4E;&#x9891;&#x5206;&#x91CF;&#x6216;&#x76F4;&#x6D41;&#x5206;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x8C03;&#x5236;&#xFF0C;&#x8C03;&#x5236;&#x53EF;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF1A;&#x57FA;&#x5E26;&#x8C03;&#x5236;&#x548C;&#x5E26;&#x901A;&#x8C03;&#x5236;&#xFF0C;&#x524D;&#x8005;&#x5BF9;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x6CE2;&#x5F62;&#x53D8;&#x6362;&#xFF0C;&#x4F7F;&#x5B83;&#x80FD;&#x591F;&#x4E0E;&#x4FE1;&#x9053;&#x7279;&#x6027;&#x76F8;&#x9002;&#x5E94;&#xFF0C;&#x53D8;&#x6362;&#x540E;&#x7684;&#x4FE1;&#x53F7;&#x4ECD;&#x662F;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E5F;&#x79F0;&#x4E3A;&#x7F16;&#x7801;&#xFF1B;&#x540E;&#x8005;&#x4F7F;&#x7528;&#x8F7D;&#x6CE2;&#x8FDB;&#x884C;&#x8C03;&#x5236;&#xFF0C;&#x5C06;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#x642C;&#x79FB;&#x5230;&#x8F83;&#x9AD8;&#x7684;&#x9891;&#x6BB5;&#xFF0C;&#x5E76;&#x8F6C;&#x6362;&#x4E3A;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x5728;&#x6A21;&#x62DF;&#x4FE1;&#x9053;&#x4E2D;&#x4F20;&#x8F93;&#xFF0C;&#x7ECF;&#x8FC7;&#x8F7D;&#x6CE2;&#x8C03;&#x5236;&#x540E;&#x7684;&#x4FE1;&#x53F7;&#x79F0;&#x4E3A;&#x5E26;&#x901A;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x57FA;&#x5E26;&#x8C03;&#x5236;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x56DB;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x7F16;&#x7801;&#x65B9;&#x5F0F;</th>
<th>&#x542B;&#x4E49;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x4E0D;&#x5F52;&#x96F6;&#x5236;</td>
<td>&#x6B63;&#x7535;&#x5E73;&#x4EE3;&#x8868;1&#xFF0C;&#x8D1F;&#x7535;&#x5E73;&#x4EE3;&#x8868;0</td>
</tr>
<tr>
<td>&#x5F52;&#x96F6;&#x5236;</td>
<td>&#x6B63;&#x8109;&#x51B2;&#x4EE3;&#x8868;1&#xFF0C;&#x8D1F;&#x8109;&#x51B2;&#x4EE3;&#x8868;0</td>
</tr>
<tr>
<td>&#x66FC;&#x5F7B;&#x65AF;&#x7279;&#x7F16;&#x7801;</td>
<td>&#x4F4D;&#x4E8E;&#x5468;&#x671F;&#x4E2D;&#x5FC3;&#x7684;&#x5411;&#x4E0A;&#x8DF3;&#x53D8;&#x4EE3;&#x8868;1&#xFF0C;&#x5411;&#x4E0B;&#x8DF3;&#x53D8;&#x4EE3;&#x8868;0</td>
</tr>
<tr>
<td>&#x5DEE;&#x5206;&#x66FC;&#x5F7B;&#x65AF;&#x7279;&#x7F16;&#x7801;</td>
<td>&#x5728;&#x6BCF;&#x4F4D;&#x7684;&#x4E2D;&#x5FC3;&#x59CB;&#x7EC8;&#x90FD;&#x6709;&#x8DF3;&#x53D8;&#xFF0C;&#x4F46;&#x5728;&#x6BCF;&#x4E00;&#x4F4D;&#x7684;&#x5F00;&#x59CB;&#x8FB9;&#x754C;&#x6709;&#x8DF3;&#x53D8;&#x4EE3;&#x8868;1&#xFF0C;&#x5426;&#x5219;&#x4EE3;&#x8868;0</td>
</tr>
</tbody></table>
<p>&#x5BF9;&#x4E8E;&#x5E26;&#x901A;&#x8C03;&#x5236;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#x57FA;&#x672C;&#x7684;&#x8C03;&#x5236;&#x65B9;&#x6CD5;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x5E26;&#x901A;&#x8C03;&#x5236;&#x65B9;&#x6CD5;</th>
<th>&#x542B;&#x4E49;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x8C03;&#x5E45;&#xFF08;AM,amplitude modulation&#xFF09;</td>
<td>&#x8F7D;&#x6CE2;&#x7684;&#x632F;&#x5E45;&#x968F;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#x800C;&#x53D8;&#x5316;</td>
</tr>
<tr>
<td>&#x8C03;&#x9891;&#xFF08;FM,frequency modulation&#xFF09;</td>
<td>&#x8F7D;&#x6CE2;&#x7684;&#x9891;&#x7387;&#x968F;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#x800C;&#x53D8;&#x5316;</td>
</tr>
<tr>
<td>&#x8C03;&#x76F8;&#xFF08;PM,phase modulation&#xFF09;</td>
<td>&#x8F7D;&#x6CE2;&#x7684;&#x521D;&#x59CB;&#x76F8;&#x4F4D;&#x968F;&#x57FA;&#x5E26;&#x4FE1;&#x53F7;&#x800C;&#x53D8;&#x5316;</td>
</tr>
</tbody></table>
<p>&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x8BF4;&#xFF0C;&#x9650;&#x5236;&#x7801;&#x5143;&#x5728;&#x4FE1;&#x9053;&#x4E0A;&#x7684;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x7684;&#x56E0;&#x7D20;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#xFF1A;</p>
<ul>
<li><p>&#x4FE1;&#x9053;&#x6240;&#x80FD;&#x901A;&#x8FC7;&#x7684;&#x9891;&#x7387;&#x8303;&#x56F4;&#x3002;&#x4E66;&#x4E2D;&#x6CA1;&#x6709;&#x5BF9;&#x8FD9;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x89E3;&#x91CA;&#xFF1A;&#x7801;&#x95F4;&#x5E72;&#x6270;&#x73B0;&#x8C61;&#x548C;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x7684;&#x5173;&#x7CFB;&#xFF1B;&#x9AD8;&#x9891;&#x5206;&#x91CF;&#x548C;&#x4FE1;&#x9053;&#x9891;&#x7387;&#x8303;&#x56F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x7ED3;&#x8BBA;&#x662F;&#xFF1A;&#x82E5;&#x7801;&#x5143;&#x7684;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x8D85;&#x8FC7;&#x4E86;&#x4E0A;&#x9650;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x4E25;&#x91CD;&#x7684;&#x7801;&#x95F4;&#x5E72;&#x6270;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x63A5;&#x6536;&#x7AEF;&#x4E0D;&#x53EF;&#x80FD;&#x8BC6;&#x522B;&#x7801;&#x5143;&#x3002;</p>
</li>
<li><p>&#x4FE1;&#x566A;&#x6BD4;&#x3002;&#x4FE1;&#x566A;&#x6BD4;&#x6307;&#x4FE1;&#x53F7;&#x7684;&#x5E73;&#x5747;&#x529F;&#x7387;&#x4E0E;&#x566A;&#x58F0;&#x7684;&#x5E73;&#x5747;&#x529F;&#x7387;&#x4E4B;&#x6BD4;&#xFF0C;&#x8BB0;&#x4F5C;S/N&#xFF0C;&#x5E38;&#x4EE5;dB&#x505A;&#x8BA1;&#x91CF;&#x5355;&#x4F4D;$dB=10\log_{10}{S/N}(dB)$,&#x9999;&#x519C;&#x516C;&#x5F0F;&#x4E3A;&#xFF1A;<br>$$<br>C = W log_{2}{1+S/N}\qquad(bits/s)<br>$$<br>&#x5176;&#x4E2D;&#xFF0C;C&#x662F;&#x4FE1;&#x9053;&#x7684;&#x6781;&#x9650;&#x4F20;&#x8F93;&#x901F;&#x7387;&#xFF0C;W&#x4E3A;&#x4FE1;&#x9053;&#x7684;&#x5E26;&#x5BBD;&#xFF08;HZ&#xFF09;&#x3002;</p>
</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x7269;&#x7406;&#x5C42;&#x4E0B;&#x7684;&#x4F20;&#x8F93;&#x5A92;&#x4F53;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x4F1A;&#x7565;&#x8FC7;&#x505A;&#x7B80;&#x4ECB;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x4F20;&#x8F93;&#x5A92;&#x4F53;&#x5206;&#x7C7B;</th>
<th>&#x793A;&#x4F8B;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x5F15;&#x5BFC;&#x578B;&#x4F20;&#x8F93;&#x5A92;&#x4F53;</td>
<td>&#x53CC;&#x7EDE;&#x7EBF;&#xFF1B;&#x540C;&#x8F74;&#x7535;&#x7F06;&#xFF1B;&#x5149;&#x7F06;&#xFF1B;</td>
</tr>
<tr>
<td>&#x975E;&#x5F15;&#x5BFC;&#x578B;&#x4F20;&#x8F93;&#x5A92;&#x4F53;</td>
<td>&#x4F4E;&#x9891;&#x901A;&#x4FE1;&#xFF1B;&#x77ED;&#x6CE2;&#x901A;&#x4FE1;&#xFF08;&#x9AD8;&#x9891;&#x901A;&#x4FE1;&#xFF09;&#xFF1B;&#x5FAE;&#x6CE2;&#x901A;&#x4FE1;&#xFF08;&#x7279;&#x9AD8;&#x9891;&#x5230;&#x6781;&#x9AD8;&#x9891;&#xFF09;&#xFF1A;&#x5730;&#x9762;&#x5FAE;&#x6CE2;&#x63A5;&#x529B;&#x901A;&#x4FE1;&#xFF0C;&#x536B;&#x661F;&#x901A;&#x4FE1;&#xFF1B;&#x7EA2;&#x5916;&#x901A;&#x4FE1;&#xFF1B;&#x6FC0;&#x5149;&#x901A;&#x4FE1;&#xFF1B;</td>
</tr>
</tbody></table>
<p>&#x4EE5;&#x4E0B;&#x5BF9;&#x4FE1;&#x9053;&#x590D;&#x7528;&#x6280;&#x672F;&#x505A;&#x603B;&#x7ED3;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x590D;&#x7528;&#x6280;&#x672F;</th>
<th>&#x542B;&#x4E49;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x9891;&#x5206;&#x590D;&#x7528;(FDM,frequency Division Multiplxing)</td>
<td>&#x7528;&#x6237;&#x5728;&#x76F8;&#x540C;&#x65F6;&#x95F4;&#x5360;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5E26;&#x5BBD;&#x8D44;&#x6E90;</td>
</tr>
<tr>
<td>&#x65F6;&#x5206;&#x590D;&#x7528;(TDM,Time Division Multiplexing)</td>
<td>&#x7528;&#x6237;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x5360;&#x7528;&#x76F8;&#x540C;&#x9891;&#x5E26;&#x5BBD;&#x5EA6;</td>
</tr>
<tr>
<td>&#x7EDF;&#x8BA1;&#x65F6;&#x5206;&#x590D;&#x7528;&#xFF08;&#x5F02;&#x6B65;&#x65F6;&#x5206;&#x590D;&#x7528;&#xFF09;</td>
<td>&#x4F7F;&#x7528;STMD&#x5E27;&#x6765;&#x4F20;&#x9001;&#x670D;&#x7528;&#x6570;&#x636E;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x4E00;&#x4E2A;&#x5E27;&#x653E;&#x6EE1;&#x4E86;&#x624D;&#x53D1;&#x9001;&#x51FA;&#x53BB;</td>
</tr>
<tr>
<td>&#x6CE2;&#x5206;&#x590D;&#x7528;(WDM,Wavelength Division Multiplexing)</td>
<td>&#x5149;&#x7684;&#x9891;&#x5206;&#x590D;&#x7528;&#xFF0C;&#x6B64;&#x65F6;&#x5206;&#x7684;&#x662F;&#x5149;&#x6CE2;</td>
</tr>
<tr>
<td>&#x7801;&#x5206;&#x590D;&#x7528;&#xFF08;CMD, Code Division Multiplexing&#xFF09;</td>
<td>&#x4F7F;&#x7528;CMDA&#x7684;&#x6BCF;&#x4E2A;&#x7AD9;&#x88AB;&#x6307;&#x6D3E;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x7801;&#x7247;&#x5E8F;&#x5217;,&#x82E5;&#x8BE5;&#x7AD9;&#x8981;&#x53D1;&#x9001;&#x6BD4;&#x7279;&#x4F4D;1&#xFF0C;&#x5219;&#x53D1;&#x9001;&#x8BE5;&#x7801;&#x7247;&#x5E8F;&#x5217;&#xFF0C;&#x5426;&#x5219;&#x53D1;&#x9001;&#x6539;&#x7801;&#x7247;&#x5E8F;&#x5217;&#x7684;&#x53CD;&#x7801;&#x3002;&#x4E3A;&#x5B9E;&#x73B0;&#x590D;&#x7528;&#xFF0C;&#x6BCF;&#x4E2A;&#x7AD9;&#x7684;&#x7801;&#x7247;&#x5E8F;&#x5217;&#x5FC5;&#x987B;&#x6B63;&#x4EA4;&#xFF0C;&#x5982;&#x6B64;&#x624D;&#x80FD;&#x5C06;&#x6BCF;&#x4E2A;&#x7AD9;&#x7684;&#x4FE1;&#x606F;&#x5206;&#x79BB;&#xFF0C;&#x5177;&#x4F53;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</td>
</tr>
</tbody></table>
<p>&#x5411;&#x91CF;S&#x8868;&#x793A;&#x7AD9;S&#x7684;&#x7801;&#x7247;&#xFF0C;&#x82E5;&#x5185;&#x79EF;&#x4E3A;1&#xFF0C;&#x5219;&#x8868;&#x793A;S&#x7AD9;&#x53D1;&#x9001;&#x6BD4;&#x7279;&#x4F4D;1&#xFF0C;&#x82E5;&#x5185;&#x79EF;&#x4E3A;-1&#xFF0C;&#x5219;&#x8868;&#x793A;S&#x7AD9;&#x53D1;&#x9001;&#x6BD4;&#x7279;&#x4F4D;0&#xFF0C;&#x82E5;&#x5185;&#x79EF;&#x4E3A;0&#xFF0C;&#x5219;&#x8868;&#x793A;S&#x7AD9;&#x672A;&#x53D1;&#x9001;&#x6BD4;&#x7279;&#x4F4D;&#x3002;<br>$$<br>S\cdot S = \frac{1}{m}\Sigma_{i=1}^{m}S_iS_i =\frac{1}{m}\Sigma_{i=1}^{m}{S_i}^2= \frac{1}{m}\Sigma_{i=1}^{m}(\pm1)^2 = 1<br>$$<br>&#x6570;&#x5B57;&#x4F20;&#x8F93;&#x7CFB;&#x7EDF;&#xFF08;&#x8FD9;&#x90E8;&#x5206;&#x5565;&#x554A;&#x90FD;&#xFF09;</p>
<p>&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;-&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#xFF0C;&#x672A;&#x5B8C;&#x5F85;&#x7EED;&#x2026;&#x2026;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Study/">#Study</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Computer-Network/">#Computer Network</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/Ubuntu20-04-cuda-cuDNN-opencv3-4-0-opencv-contrib/">Ubuntu20.04+cuda+cuDNN+opencv3.4.0+opencv_contrib</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/Computer-Graphics/">Computer Graphics</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-5f4bad760706948f' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/Computer-Network/';
        this.page.identifier = 'Computer-Network/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'https-www-youngvoice-online-1' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Junhui Luo&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="西南交通大学官网" href="http://jwc.swjtu.edu.cn/index.html" target="_blank" rel="noopener">
                    
                    西南交通大学官网
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Taunt" href="https://blog.csdn.net/Taunt_" target="_blank" rel="noopener">
                    
                    Taunt
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Seldon" href="https://seldon1224.top" target="_blank" rel="noopener">
                    
                    Seldon
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>