<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>计算机网络 - 饮冰室</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta property="og:type" content="article">
<meta property="og:title" content="计算机网络">
<meta property="og:url" content="http://yoursite.com/Computer-Network/index.html">
<meta property="og:site_name" content="饮冰室">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200924195950.jpg">
<meta property="og:image" content="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200929004132.jpg">
<meta property="article:published_time" content="2020-09-24T11:42:59.000Z">
<meta property="article:modified_time" content="2020-09-29T14:42:21.038Z">
<meta property="article:author" content="Junhui Luo">
<meta property="article:tag" content="Study">
<meta property="article:tag" content="Computer Network">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200924195950.jpg">





<link rel="icon" href="/images/logo.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/categories/Vision/">视觉</a>
            
            <a class="navbar-item "
               href="/categories/CPlus/">C++</a>
            
            <a class="navbar-item "
               href="/categories/Algorithm/">算法</a>
            
            <a class="navbar-item "
               href="/categories/Study/">学习</a>
            
            <a class="navbar-item "
               href="/about/">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="目录">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#">1&nbsp;&nbsp;<b>互联网概述</b></a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/luojunhui1" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            计算机网络
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-09-24T11:42:59.000Z" itemprop="datePublished">9月 24 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Study/">Study</a><span>></span><a class="article-category-link" href="/categories/Study/Computer-Network/">Computer Network</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            9 分钟 读完 (约 1405 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p><img src="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200924195950.jpg" alt="&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;"></p>
<a id="more"></a>

<h2><span id="&#x4E92;&#x8054;&#x7F51;&#x6982;&#x8FF0;">&#x4E92;&#x8054;&#x7F51;&#x6982;&#x8FF0;</span></h2><p>&#x73B0;&#x4EE3;&#x793E;&#x4F1A;&#x6709;&#x5927;&#x5BB6;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;&#x4E09;&#x79CD;&#x7F51;&#x7EDC;&#xFF0C;&#x5373;<strong>&#x7535;&#x4FE1;&#x7F51;&#x7EDC;</strong>&#x3001;<strong>&#x6709;&#x7EBF;&#x7535;&#x89C6;&#x7F51;&#x7EDC;</strong>&#x548C;<strong>&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;</strong>&#xFF0C;&#x8FD9;&#x4E09;&#x8005;&#x5728;&#x6700;&#x521D;&#x8BBE;&#x8BA1;&#x65F6;&#x5404;&#x6709;&#x5206;&#x5DE5;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x5404;&#x81EA;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x7535;&#x4FE1;&#x7F51;&#x7EDC;&#x548C;&#x6709;&#x7EBF;&#x7535;&#x89C6;&#x7F51;&#x7EDC;&#x9010;&#x6E10;&#x878D;&#x5165;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x3002;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E09;&#x79CD;&#x7F51;&#x7EDC;&#x878D;&#x5408;&#x4E3A;&#x4E00;&#x79CD;&#x7F51;&#x7EDC;&#x6765;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x201C;<strong>&#x4E09;&#x7F51;&#x878D;&#x5408;</strong>&#x201D;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p><strong>&#x201C;&#x4E92;&#x8054;&#x7F51;&#x201D;&#xFF08;Internet&#xFF09;</strong>&#x548C;<strong>&#x201C;&#x4E92;&#x8FDE;&#x7F51;&#x201D;&#xFF08;internet&#xFF09;</strong>&#x6982;&#x5FF5;&#x5E76;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x540E;&#x8005;&#x901A;&#x5E38;&#x6CDB;&#x6307;&#x7531;&#x591A;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4E92;&#x8FDE;&#x800C;&#x6210;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;,&#x9700;&#x8981;&#x660E;&#x786E;&#x7684;&#x6982;&#x5FF5;&#x662F;&#xFF1A;&#x7F51;&#x7EDC;&#x628A;&#x591A;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x800C;&#x4E92;&#x8FDE;&#x7F51;&#x628A;&#x8BB8;&#x591A;&#x7F51;&#x7EDC;&#x901A;&#x8FC7;&#x8DEF;&#x7531;&#x5668;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6240;&#x4EE5;&#x4E92;&#x8FDE;&#x7F51;&#x4E5F;&#x662F;&#x201C;<strong>&#x7F51;&#x7EDC;&#x7684;&#x7F51;&#x7EDC;</strong>&#x201D;&#xFF0C;&#x7F51;&#x7EDC;&#x800C;&#x524D;&#x8005;&#x901A;&#x5E38;&#x7279;&#x6307;&#x5F53;&#x524D;&#x5168;&#x7403;&#x6700;&#x5927;&#x7684;&#x3001;&#x5F00;&#x653E;&#x7684;&#x3001;&#x7531;&#x4F17;&#x591A;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x800C;&#x6210;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x4E92;&#x8FDE;&#x7F51;&#xFF0C;&#x5B83;&#x91C7;&#x7528;<strong>TCP/IP&#x534F;&#x8BAE;&#x65CF;</strong>&#x4F5C;&#x4E3A;&#x901A;&#x4FE1;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x524D;&#x8EAB;&#x4E3A;&#x7F8E;&#x56FD;&#x7684;ARPANET&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x53D1;&#x5C55;&#x5171;&#x6709;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;<strong>&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x662F;&#x4ECE;&#x5355;&#x4E2A;&#x7F51;&#x7EDC;ARPANET&#x5411;&#x4E92;&#x8FDE;&#x7F51;&#x53D1;&#x5C55;&#x7684;&#x8FC7;&#x7A0B;</strong>&#xFF0C;<strong>&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x662F;&#x5EFA;&#x6210;&#x4E86;&#x4E09;&#x7EA7;&#x7ED3;&#x6784;&#x7684;&#x4E92;&#x8054;&#x7F51;</strong>&#xFF0C;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x8D44;&#x52A9;&#x7684;NSFNET&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#xFF0C;&#x5206;&#x4E3A;&#x4E3B;&#x5E72;&#x7F51;&#x3001;&#x5730;&#x533A;&#x7F51;&#x548C;&#x6821;&#x56ED;&#x7F51;&#xFF08;&#x4F01;&#x4E1A;&#x7F51;&#xFF09;&#xFF0C;&#x5728;&#x8FD9;&#x9636;&#x6BB5;&#x8BB8;&#x591A;&#x516C;&#x53F8;&#x5C31;&#x5DF2;&#x7ECF;&#x63A5;&#x5165;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x51B3;&#x5B9A;&#x5C06;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4E3B;&#x5E72;&#x7F51;&#x4EA4;&#x7ED9;&#x79C1;&#x4EBA;&#x516C;&#x53F8;&#x6765;&#x7ECF;&#x8425;&#x3002;<strong>&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#x7684;&#x7279;&#x70B9;&#x662F;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x4E86;&#x591A;&#x5C42;&#x6B21;&#x7684;ISP&#xFF08;Internet Service Provider&#xFF09;&#x7ED3;&#x6784;&#x7684;&#x4E92;&#x8054;&#x7F51;</strong>&#xFF0C;&#x6839;&#x636E;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x8986;&#x76D6;&#x9762;&#x79EF;&#x4EE5;&#x53CA;&#x62E5;&#x6709;&#x7684;IP&#x5730;&#x5740;&#x6570;&#x76EE;&#x7684;&#x4E0D;&#x540C;&#xFF0C;ISP&#x4E5F;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#xFF1A;&#x4E3B;&#x5E72;ISP&#x3001;&#x5730;&#x533A;ISP&#x548C;&#x672C;&#x5730;ISP&#xFF0C;&#x968F;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x66F4;&#x5FEB;&#x5730;&#x8F6C;&#x53D1;&#x5206;&#x7EC4;&#x4EE5;&#x53CA;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5229;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x8D44;&#x6E90;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4EA4;&#x6362;&#x70B9;&#x51FA;&#x73B0;&#x4E86;&#xFF08;IXP, Internet eXchange Point&#xFF09;&#xFF0C;<strong>IXP&#x901A;&#x5E38;&#x91C7;&#x7528;&#x5DE5;&#x4F5C;&#x5728;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;</strong>&#xFF0C;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;&#x901A;&#x5E38;&#x7528;&#x5C40;&#x57DF;&#x7F51;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x4ECE;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x4E0A;&#x6765;&#x8BF4;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;<strong>&#x8FB9;&#x7F18;&#x90E8;&#x5206;</strong>&#x548C;<strong>&#x6838;&#x5FC3;&#x90E8;&#x5206;</strong>&#xFF0C;<strong>&#x524D;&#x8005;&#x7531;&#x7528;&#x6237;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7684;&#x8FDE;&#x63A5;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x4E3B;&#x673A;&#x7EC4;&#x6210;&#xFF0C;&#x540E;&#x8005;&#x7531;&#x7F51;&#x7EDC;&#x548C;&#x8FDE;&#x63A5;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x7EC4;&#x6210;</strong>&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4E3A;&#x8FB9;&#x7F18;&#x63D0;&#x4F9B;&#x8FDE;&#x901A;&#x6027;&#x548C;&#x4EA4;&#x6362;&#x3002;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8FB9;&#x7F18;&#x90E8;&#x5206;&#xFF0C;&#x7AEF;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;<strong>&#x5BA2;&#x6237;-&#x670D;&#x52A1;&#x5668;(Client-Server )&#x65B9;&#x5F0F;</strong>&#x53CA;<strong>&#x5BF9;&#x7B49;&#x65B9;&#x5F0F;&#xFF08;P2P, Peer-to-Peer&#xFF09;</strong>&#xFF0C;&#x524D;&#x8005;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x4E3A;&#x5BA2;&#x6237;&#x4E3A;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#x65B9;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x662F;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x65B9;&#xFF1B;&#x540E;&#x8005;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x8BF4;&#x4ECD;&#x7136;&#x662F;CS&#x65B9;&#x5F0F;&#xFF0C;&#x53EA;&#x662F;&#x5BF9;&#x7B49;&#x8FDE;&#x63A5;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x4E3B;&#x673A;&#x65E2;&#x662F;&#x5BA2;&#x6237;&#x53C8;&#x662F;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8FB9;&#x7F18;&#x90E8;&#x5206;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x662F;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x6784;&#x5EFA;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;<strong>&#x5206;&#x7EC4;&#x8F6C;&#x53D1;</strong>&#xFF0C;&#x91C7;&#x7528;<strong>&#x5B58;&#x50A8;&#x8F6C;&#x53D1;&#x6280;&#x672F;</strong>&#xFF0C;&#x5C06;&#x62A5;&#x6587;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x7B49;&#x957F;&#x7684;&#x6570;&#x636E;&#x6BB5;&#xFF0C;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x5FC5;&#x8981;&#x4FE1;&#x606F;&#x7EC4;&#x6210;&#x7684;&#x9996;&#x90E8;&#xFF0C;&#x5C31;&#x6784;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#xFF08;&#x5305;&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x5206;&#x7EC4;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x8BF8;&#x5982;&#x76EE;&#x7684;&#x5730;&#x5740;&#x548C;&#x6E90;&#x5730;&#x5740;&#x7B49;&#x4E3B;&#x8981;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x7EC4;&#x90FD;&#x80FD;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x72EC;&#x7ACB;&#x5730;&#x9009;&#x62E9;&#x4F20;&#x8F93;&#x8DEF;&#x5F84;&#xFF0C;&#x5E76;&#x88AB;&#x6B63;&#x786E;&#x5730;&#x4EA4;&#x4ED8;&#x5230;&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#x7684;&#x7EC8;&#x70B9;&#x3002;<strong>&#x5206;&#x7EC4;&#x4F20;&#x8F93;&#x65F6;&#x4F1A;&#x4E00;&#x6BB5;&#x4E00;&#x6BB5;&#x5730;&#x65AD;&#x7EED;&#x5360;&#x7528;&#x901A;&#x4FE1;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x975E;&#x5E38;&#x9002;&#x5408;&#x4F20;&#x9001;&#x7A81;&#x53D1;&#x5F0F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6570;&#x636E;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x7535;&#x8DEF;&#x4EA4;&#x6362;&#x6240;&#x9700;&#x7684;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x548C;&#x91CA;&#x653E;&#x8FDE;&#x63A5;&#x7684;&#x5F00;&#x9500;</strong>&#xFF0C;&#x4F20;&#x8F93;&#x7684;&#x6548;&#x7387;&#x5C31;&#x66F4;&#x9AD8;&#x3002;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x901A;&#x4FE1;&#x65F6;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5E26;&#x5BBD;&#xFF0C;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x65F6;&#x5EF6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x7F51;&#x4E5F;&#x9700;&#x8981;&#x5177;&#x6709;&#x5904;&#x7406;&#x5305;&#x5934;&#x4E0A;&#x7684;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/luojunhui1/BlogPicture/Windows/20200929004132.jpg" alt="&#x7535;&#x8DEF;&#x4EA4;&#x6362; &#x62A5;&#x6587;&#x4EA4;&#x6362; &#x5206;&#x7EC4;&#x4EA4;&#x6362;"></p>
<p>&#x4E92;&#x8054;&#x7F51;&#x6709;&#x4E24;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5373;<strong>&#x8FDE;&#x901A;&#x6027;</strong>&#x548C;<strong>&#x8D44;&#x6E90;&#x5171;&#x4EAB;</strong>&#xFF0C;&#x524D;&#x8005;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x7ECF;&#x6D4E;&#x3001;&#x4FBF;&#x6377;&#x7684;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x540E;&#x8005;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4FBF;&#x6377;&#x5730;&#x5229;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#x3002;</p>
<p><strong>&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;</strong>&#x9700;&#x8981;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6982;&#x5FF5;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#xFF0C;&#x5B83;&#x6307;&#x7531;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x3001;&#x53EF;&#x7F16;&#x7A0B;&#x7684;&#x786C;&#x4EF6;&#x4E92;&#x8FDE;&#x800C;&#x6210;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6309;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7C7B;&#x6807;&#x51C6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x5206;&#x4E3A;&#xFF1A;</p>
<ul>
<li>&#x6309;&#x7F51;&#x7EDC;&#x4F5C;&#x7528;&#x7684;&#x8303;&#x56F4;&#x5206;&#x7C7B;&#xFF1A;<strong>&#x5E7F;&#x57DF;&#x7F51;&#xFF08;WAN,Wide Area Network&#xFF09;&#x3001;&#x57CE;&#x57DF;&#x7F51;(MAN,Metropolitan Area Network)&#x3001;&#x5C40;&#x57DF;&#x7F51;(LAN,Local Area Network)&#x3001;&#x4E2A;&#x4EBA;&#x533A;&#x57DF;&#x7F51;(PAN,Personal Area Network)</strong>&#x3002;</li>
<li>&#x6309;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x8005;&#x5206;&#x7C7B;&#xFF1A;<strong>&#x516C;&#x7528;&#x7F51;&#x3001;&#x4E13;&#x7528;&#x7F51;</strong></li>
</ul>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x628A;&#x7528;&#x6237;&#x63A5;&#x5165;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5373;<strong>&#x63A5;&#x5165;&#x7F51;</strong>&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x65E2;&#x4E0D;&#x5C5E;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x4E5F;&#x4E0D;&#x5C5E;&#x4E8E;&#x8FB9;&#x7F18;&#x90E8;&#x5206;&#xFF0C;&#x4ECE;&#x8986;&#x76D6;&#x8303;&#x56F4;&#x6765;&#x770B;&#xFF0C;&#x5F88;&#x591A;&#x63A5;&#x5165;&#x7F51;&#x8FD8;&#x5C5E;&#x4E8E;&#x5C40;&#x57DF;&#x7F51;&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x672A;&#x5B8C;&#x5F85;&#x7EED;&#x2026;&#x2026;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Study/">#Study</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Computer-Network/">#Computer Network</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/Computer-Graphics/">Computer Graphics</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-5f4bad760706948f' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'http://yoursite.com/Computer-Network/';
        this.page.identifier = 'Computer-Network/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'https-www-youngvoice-online-1' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Junhui Luo&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="西南交通大学官网" href="http://jwc.swjtu.edu.cn/index.html" target="_blank" rel="noopener">
                    
                    西南交通大学官网
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Taunt" href="https://blog.csdn.net/Taunt_" target="_blank" rel="noopener">
                    
                    Taunt
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Seldon" href="https://seldon1224.top" target="_blank" rel="noopener">
                    
                    Seldon
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>