<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>三级联动方案 - 青年之声工作站</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta name="description" content="&amp;#x4E00;&amp;#x3001;&amp;#x8054;&amp;#x52A8;&amp;#x76EE;&amp;#x7684;&amp;#x4E3A;&amp;#x4FBF;&amp;#x4E8E;&amp;#x5E7F;&amp;#x6CDB;&amp;#x542C;&amp;#x53D6;&amp;#x5B66;&amp;#x751F;&amp;#x610F;&amp;#x89C1;&amp;#xFF0C;&amp;#x4EE3;&amp;#x8868;&amp;#x548C;&amp;#x7EF4;&amp;#x62A4;&amp;#x5E7F;&amp;#x5927;">
<meta property="og:type" content="website">
<meta property="og:title" content="三级联动方案">
<meta property="og:url" content="http://yoursite.com/DOC1/%E4%B8%89%E7%BA%A7%E8%81%94%E5%8A%A82019.html">
<meta property="og:site_name" content="青年之声工作站">
<meta property="og:description" content="&amp;#x4E00;&amp;#x3001;&amp;#x8054;&amp;#x52A8;&amp;#x76EE;&amp;#x7684;&amp;#x4E3A;&amp;#x4FBF;&amp;#x4E8E;&amp;#x5E7F;&amp;#x6CDB;&amp;#x542C;&amp;#x53D6;&amp;#x5B66;&amp;#x751F;&amp;#x610F;&amp;#x89C1;&amp;#xFF0C;&amp;#x4EE3;&amp;#x8868;&amp;#x548C;&amp;#x7EF4;&amp;#x62A4;&amp;#x5E7F;&amp;#x5927;">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="http://yoursite.com/sjld/sjld1.png">
<meta property="og:image" content="http://yoursite.com/sjld/sjld2.png">
<meta property="og:image" content="http://yoursite.com/DOC1/%E5%BE%AE%E8%A7%82%E5%AF%9F1.assets/clip_image006.gif">
<meta property="article:published_time" content="2020-05-13T17:55:26.000Z">
<meta property="article:modified_time" content="2020-05-13T18:20:44.183Z">
<meta property="article:author" content="Junhui Luo">
<meta property="article:tag" content="三级联动">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="http://yoursite.com/sjld/sjld1.png">





<link rel="icon" href="/images/logo.ico">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/DOC1">三级联动</a>
            
            <a class="navbar-item "
               href="/DOC2">微观察</a>
            
            <a class="navbar-item "
               href="/DOC3">院班联动</a>
            
            <a class="navbar-item "
               href="/DOC4">提案回复</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="http://weavesilk.com/" target="_blank" rel="noopener">
                
                <i class="fab fa-envira"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            三级联动方案
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-05-13T17:55:26.000Z" itemprop="datePublished">5月 14 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/">undefined</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            29 分钟 读完 (约 4412 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><h1 id="&#x4E00;&#x3001;&#x8054;&#x52A8;&#x76EE;&#x7684;"><a href="#&#x4E00;&#x3001;&#x8054;&#x52A8;&#x76EE;&#x7684;" class="headerlink" title="&#x4E00;&#x3001;&#x8054;&#x52A8;&#x76EE;&#x7684;"></a>&#x4E00;&#x3001;&#x8054;&#x52A8;&#x76EE;&#x7684;</h1><p>&#x4E3A;&#x4FBF;&#x4E8E;&#x5E7F;&#x6CDB;&#x542C;&#x53D6;&#x5B66;&#x751F;&#x610F;&#x89C1;&#xFF0C;&#x4EE3;&#x8868;&#x548C;&#x7EF4;&#x62A4;&#x5E7F;&#x5927;&#x540C;&#x5B66;&#x5408;&#x6CD5;&#x6743;&#x76CA;&#xFF0C;&#x52A0;&#x5F3A;&#x9662;&#x6821;&#x73ED;&#x4E09;&#x7EA7;&#x4FE1;&#x606F;&#x6C9F;&#x901A;&#x548C;&#x4EA4;&#x6D41;&#xFF0C;&#x7279;&#x7F16;&#x5199;&#x300A;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201C;&#x6821;&#x3001;&#x9662;&#x3001;&#x73ED;&#x4E09;&#x7EA7;&#x8054;&#x52A8;&#x300B;&#x3002;</p>
<h1 id="&#x4E8C;&#x3001;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x81EA;&#x8EAB;&#x7EC4;&#x7EC7;&#x5DE5;&#x4F5C;&#x5EFA;&#x8BBE;"><a href="#&#x4E8C;&#x3001;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x81EA;&#x8EAB;&#x7EC4;&#x7EC7;&#x5DE5;&#x4F5C;&#x5EFA;&#x8BBE;" class="headerlink" title="&#x4E8C;&#x3001;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x81EA;&#x8EAB;&#x7EC4;&#x7EC7;&#x5DE5;&#x4F5C;&#x5EFA;&#x8BBE;"></a>&#x4E8C;&#x3001;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x81EA;&#x8EAB;&#x7EC4;&#x7EC7;&#x5DE5;&#x4F5C;&#x5EFA;&#x8BBE;</h1><p>2017&#x5E74;2&#x6708;&#xFF0C;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x6B63;&#x5F0F;&#x542F;&#x52A8;&#x8FD0;&#x884C;&#xFF0C;&#x672C;&#x7AD9;&#x4EE5;&#x7EF4;&#x62A4;&#x5B66;&#x751F;&#x6743;&#x76CA;&#x4E3A;&#x5DF1;&#x4EFB;&#xFF0C;&#x81F4;&#x529B;&#x4E8E;&#x505A;&#x5B66;&#x751F;&#x4E0E;&#x5B66;&#x6821;&#x9886;&#x5BFC;&#x6C9F;&#x901A;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x5B66;&#x751F;&#x5DE5;&#x4F5C;&#x7684;&#x5EFA;&#x8A00;&#x732E;&#x7B56;&#x8005;&#xFF0C;&#x63D0;&#x9AD8;&#x5B66;&#x751F;&#x7FA4;&#x4F53;&#x6743;&#x76CA;&#x610F;&#x8BC6;&#x7684;&#x4E3B;&#x529B;&#x519B;&#xFF0C;&#x79EF;&#x6781;&#x5C06;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5E73;&#x53F0;&#x5EFA;&#x8BBE;&#x6210;&#x4E3A;&#x5EFA;&#x8A00;&#x732E;&#x7B56;&#x3001;&#x7EF4;&#x6743;&#x53D1;&#x58F0;&#x7684;&#x4E2D;&#x6D41;&#x7825;&#x67F1;&#x3002;</p>
<p>&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x4EE5;&#x201C;&#x63D0;&#x6848;&#x201D;&#x5DE5;&#x4F5C;&#x4E3A;&#x91CD;&#x5FC3;&#xFF0C;&#x8BBE;&#x7F6E;3&#x4E2A;&#x5DE5;&#x4F5C;&#x7EC4;&#x5904;&#x7406;&#x76F8;&#x5173;&#x95EE;&#x9898;&#x3002;&#x5176;&#x4E2D;&#x5E94;&#x63D0;&#x6848;&#x5185;&#x5BB9;&#x8BBE;&#x7F6E;&#x4E24;&#x4E2A;&#x7EC4;&#xFF0C;&#x5206;&#x522B;&#x4E3A;&#x6821;&#x56ED;&#x7BA1;&#x7406;&#x4E0E;&#x6559;&#x5B66;&#x5C0F;&#x7EC4;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E0E;&#x670D;&#x52A1;&#x5C0F;&#x7EC4;&#xFF0C;&#x5E94;&#x90E8;&#x95E8;&#x5EFA;&#x8BBE;&#x8BBE;&#x7F6E;&#x5BF9;&#x63A5;&#x4E0E;&#x7EFC;&#x5408;&#x5C0F;&#x7EC4;&#x3002;&#x524D;&#x4E24;&#x4E2A;&#x5C0F;&#x7EC4;&#x5171;&#x540C;&#x8D1F;&#x8D23;&#x63D0;&#x6848;&#x7684;&#x91C7;&#x96C6;&#x3001;&#x5206;&#x6790;&#x3001;&#x7B5B;&#x9009;&#xFF0C;&#x5206;&#x522B;&#x8D1F;&#x8D23;&#x5BF9;&#x5E94;&#x63D0;&#x6848;&#x7684;&#x8C03;&#x67E5;&#x548C;&#x56DE;&#x590D;&#xFF0C;&#x5BF9;&#x63A5;&#x4E0E;&#x7EFC;&#x5408;&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x4E0E;&#x5B66;&#x751F;&#x4F1A;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x7684;&#x5DE5;&#x4F5C;&#x5BF9;&#x63A5;&#x548C;&#x90E8;&#x95E8;&#x5404;&#x9879;&#x6D3B;&#x52A8;&#x7684;&#x7B79;&#x5907;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5728;&#x63D0;&#x6848;&#x91C7;&#x96C6;&#x65B9;&#x9762;&#xFF0C;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x6784;&#x5EFA;&#x8D77;&#x7EBF;&#x4E0A;&#x4E0E;&#x7EBF;&#x4E0B;&#x76F8;&#x7ED3;&#x5408;&#x7684;&#x5B66;&#x751F;&#x610F;&#x89C1;&#x53CD;&#x6620;&#x548C;&#x6536;&#x96C6;&#x6E20;&#x9053;&#x3002; </p>
<p>&#x7EBF;&#x4E0A;&#xFF1A;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x5DF2;&#x5F00;&#x8BBE;&#x7EF4;&#x6743;&#x670D;&#x52A1;&#x4E13;&#x680F;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5B98;&#x65B9;&#x5FAE;&#x535A;&#x3001;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5B98;&#x65B9;QQ&#x3001;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5B98;&#x65B9;QQ&#x5747;&#x4F1A;24&#x5C0F;&#x65F6;&#x63A5;&#x6536;&#x7EF4;&#x6743;&#x63D0;&#x6848;&#x3002;</p>
<p>&#x7EBF;&#x4E0B;&#xFF1A;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5C06;&#x4F1A;&#x5B9A;&#x65F6;&#x53EC;&#x5F00;&#x6821;&#x7EA7;&#x4EE5;&#x53CA;&#x9662;&#x7EA7;&#x6743;&#x76CA;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF0C;&#x5C4A;&#x65F6;&#x5C06;&#x4F1A;&#x5BF9;&#x5404;&#x9662;&#x6216;&#x5404;&#x73ED;&#x7684;&#x7EF4;&#x6743;&#x63D0;&#x6848;&#x8FDB;&#x884C;&#x7EDF;&#x8BA1;&#x548C;&#x4E0A;&#x62A5;&#x3002;</p>
<p>&#x5728;&#x63D0;&#x6848;&#x7684;&#x8C03;&#x67E5;&#x56DE;&#x590D;&#x65B9;&#x9762;&#xFF0C;&#x4F9D;&#x6258;&#x4E8E;&#x6821;&#x9662;&#x4E24;&#x7EA7;&#x6743;&#x76CA;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF0C;&#x4F18;&#x5316;&#x5B8C;&#x5584;&#x534F;&#x8C03;&#x5316;&#x89E3;&#x673A;&#x5236;&#x3002;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x4EE5;&#x53CA;&#x5404;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x4F1A;&#x4E3B;&#x52A8;&#x8054;&#x7CFB;&#x4E0E;&#x5B66;&#x751F;&#x5229;&#x76CA;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x7684;&#x804C;&#x80FD;&#x90E8;&#x95E8;&#xFF0C;&#x6C9F;&#x901A;&#x534F;&#x5546;&#x5316;&#x89E3;&#x529E;&#x6CD5;&#x3002;&#x7D27;&#x5BC6;&#x8054;&#x7CFB;&#x201C;&#x6821;&#x9886;&#x5BFC;&#x63A5;&#x5F85;&#x65E5;&#x201D;&#x5E73;&#x53F0;&#x4EE5;&#x53CA;&#x201C;&#x5C0F;&#x60E0;&#x8BF7;&#x4F60;&#x6765;&#x559D;&#x8336;&#x201D;&#x6D3B;&#x52A8;&#xFF0C;&#x53CA;&#x65F6;&#x53CD;&#x6620;&#x6D89;&#x53CA;&#x540C;&#x5B66;&#x4EEC;&#x91CD;&#x5927;&#x4E8B;&#x9879;&#x3001;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x91C7;&#x53D6;&#x4E09;&#x7EA7;&#x54CD;&#x5E94;&#x673A;&#x5236;&#xFF1A;</p>
<p>&#x521D;&#x7EA7;&#x54CD;&#x5E94;&#xFF1A;&#x63D0;&#x6848;&#x5C0F;&#x7EC4;&#x6BCF;&#x5468;&#x7B5B;&#x67E5;&#x3001;&#x5206;&#x7C7B;&#x540C;&#x5B66;&#x4EEC;&#x7684;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#xFF0C;&#x5BF9;&#x57FA;&#x7840;&#x6027;&#x3001;&#x653F;&#x7B56;&#x6027;&#x7684;&#x7B80;&#x5355;&#x95EE;&#x9898;&#xFF0C;&#x4F9D;&#x6CD5;&#x4F9D;&#x89C4;&#x505A;&#x597D;&#x56DE;&#x590D;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E2D;&#x7EA7;&#x54CD;&#x5E94;&#xFF1A;&#x63D0;&#x6848;&#x5C0F;&#x7EC4;&#x6BCF;&#x6708;&#x6574;&#x7406;&#x51FA;&#x76F8;&#x5173;&#x95EE;&#x9898;&#x7684;&#x529E;&#x7406;&#x8FDB;&#x5C55;&#xFF0C;&#x5BF9;&#x540C;&#x5B66;&#x4EEC;&#x53CD;&#x6620;&#x7684;&#x5171;&#x6027;&#x95EE;&#x9898;&#x3001;&#x7D27;&#x6025;&#x95EE;&#x9898;&#xFF0C;&#x505A;&#x597D;&#x82D7;&#x5934;&#x6027;&#x3001;&#x503E;&#x5411;&#x6027;&#x95EE;&#x9898;&#x7684;&#x9884;&#x8B66;&#xFF0C;&#x9080;&#x8BF7;&#x76F8;&#x5173;&#x5355;&#x4F4D;&#x8D1F;&#x8D23;&#x4EBA;&#x4E0E;&#x540C;&#x5B66;&#x4EEC;&#x9762;&#x5BF9;&#x9762;&#x8FDB;&#x884C;&#x89E3;&#x7B54;&#x548C;&#x56DE;&#x590D;&#x3002;</p>
<p>&#x9AD8;&#x7EA7;&#x54CD;&#x5E94;&#xFF1A;&#x5BF9;&#x540C;&#x5B66;&#x4EEC;&#x53CD;&#x6620;&#x5F3A;&#x70C8;&#x4E14;&#x96BE;&#x4EE5;&#x534F;&#x8C03;&#x5316;&#x89E3;&#x7684;&#x91CD;&#x8981;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x6848;&#x5C0F;&#x7EC4;&#x8D1F;&#x8D23;&#x7B5B;&#x9009;&#x5206;&#x6790;&#x7814;&#x5224;&#xFF0C;&#x4E0A;&#x62A5;&#x6821;&#x9886;&#x5BFC;&#x63A5;&#x5F85;&#x65E5;&#x7B49;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<h1 id="&#x4E09;&#x3001;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;"><a href="#&#x4E09;&#x3001;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;" class="headerlink" title="&#x4E09;&#x3001;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;"></a>&#x4E09;&#x3001;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;</h1><p>&#x6821;&#x7EA7;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF1A;&#x4E3A;&#x65B9;&#x4FBF;&#x5404;&#x5B66;&#x9662;&#x95F4;&#x8FDB;&#x884C;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x4EA4;&#x6D41;&#xFF0C;&#x4E5F;&#x4FBF;&#x4E8E;&#x4E86;&#x89E3;&#x5404;&#x5B66;&#x9662;&#x5DE5;&#x4F5C;&#x8FDB;&#x5C55;&#xFF0C;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x4E8E;&#x6BCF;&#x6708;&#x53EC;&#x5F00;&#x4E00;&#x6B21;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF08;&#x65F6;&#x95F4;&#x5B9A;&#x4E8E;&#x5468;&#x4E09;&#x4E2D;&#x5348;12:30&#xFF0C;&#x53EC;&#x5F00;&#x6559;&#x5BA4;&#x7531;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x8D1F;&#x8D23;&#x501F;&#x7528;&#xFF0C;&#x5C4A;&#x65F6;&#x4F1A;&#x63D0;&#x524D;&#x901A;&#x77E5;&#xFF09;&#xFF0C;&#x5404;&#x5B66;&#x9662;&#x7EF4;&#x6743;&#x90E8;&#x95E8;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x5E94;&#x51C6;&#x65F6;&#x4E0E;&#x4F1A;&#x3002;</p>
<p>&#x9662;&#x7EA7;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF1A;&#x5404;&#x9662;&#x6743;&#x76CA;&#x90E8;&#x95E8;&#x8D1F;&#x8D23;&#x4EBA;&#x5E94;&#x81F3;&#x5C11;&#x6BCF;&#x6708;&#x4E00;&#x6B21;&#x7EC4;&#x7EC7;&#x53EC;&#x5F00;&#x9662;&#x7EA7;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x5E76;&#x901A;&#x77E5;&#x9662;&#x5185;&#x5404;&#x73ED;&#x6743;&#x76CA;&#x59D4;&#x5458;&#x4E0E;&#x4F1A;&#xFF0C;&#x4F1A;&#x8BAE;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x6536;&#x96C6;&#x5404;&#x9662;&#x540C;&#x5B66;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x4E0E;&#x5EFA;&#x8BAE;&#xFF0C;&#x5177;&#x4F53;&#x4F1A;&#x8BAE;&#x65F6;&#x95F4;&#x5730;&#x70B9;&#x7531;&#x5404;&#x9662;&#x6743;&#x76CA;&#x90E8;&#x95E8;&#x8D1F;&#x8D23;&#x4EBA;&#x81EA;&#x884C;&#x62DF;&#x5B9A;&#x3002;</p>
<h1 id="&#x56DB;&#x3001;&#x5404;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x804C;&#x8D23;&#x8303;&#x56F4;"><a href="#&#x56DB;&#x3001;&#x5404;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x804C;&#x8D23;&#x8303;&#x56F4;" class="headerlink" title="&#x56DB;&#x3001;&#x5404;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x804C;&#x8D23;&#x8303;&#x56F4;"></a>&#x56DB;&#x3001;&#x5404;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x804C;&#x8D23;&#x8303;&#x56F4;</h1><p>1&#x3001;&#x8D1F;&#x8D23;&#x5F00;&#x5C55;&#x4EE3;&#x8868;&#x548C;&#x7EF4;&#x62A4;&#x5B66;&#x9662;&#x5E08;&#x751F;&#x5408;&#x6CD5;&#x6743;&#x76CA;&#x7684;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#xFF1B;</p>
<p>2&#x3001;&#x52A0;&#x5F3A;&#x6821;-&#x9662;-&#x73ED;&#x4E09;&#x7EA7;&#x8054;&#x52A8;&#xFF0C;&#x5404;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#x8981;&#x505A;&#x597D;&#x5B66;&#x9662;&#x4E0E;&#x73ED;&#x7EA7;&#x4E4B;&#x95F4;&#x7684;&#x8854;&#x63A5;&#xFF0C;&#x505A;&#x73ED;&#x7EA7;&#x5B66;&#x751F;&#x4E0E;&#x5B66;&#x9662;&#x4E4B;&#x95F4;&#x7684;&#x6865;&#x6881;</p>
<p>3&#x3001;&#x5404;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#x6743;&#x76CA;&#x90E8;&#x95E8;&#xFF08;&#x6216;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x7EC4;&#x7EC7;&#xFF09;&#x5EFA;&#x7ACB;&#x65E5;&#x5E38;&#x7EF4;&#x6743;&#x673A;&#x5236;&#xFF0C;&#x642D;&#x5EFA;&#x7F51;&#x7EDC;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#xFF0C;&#x53CA;&#x65F6;&#x6536;&#x96C6;&#x3001;&#x542C;&#x53D6;&#x6D89;&#x53CA;&#x73ED;&#x7EA7;&#x540C;&#x5B66;&#x5207;&#x8EAB;&#x5229;&#x76CA;&#x548C;&#x666E;&#x904D;&#x8BC9;&#x6C42;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5206;&#x5C42;&#x6B21;&#x6574;&#x7406;&#x540C;&#x5B66;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x76F4;&#x63A5;&#x80FD;&#x56DE;&#x590D;&#x7684;&#x95EE;&#x9898;&#x76F4;&#x63A5;&#x56DE;&#x590D;&#xFF1B;</p>
<p>&#x9700;&#x8981;&#x8DDF;&#x5B66;&#x9662;&#x6709;&#x5173;&#x90E8;&#x95E8;&#x3001;&#x7EC4;&#x7EC7;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#x7684;&#x95EE;&#x9898;&#x7531;&#x5404;&#x5B66;&#x9662;&#x6743;&#x76CA;&#x90E8;&#x95E8;&#xFF08;&#x6216;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x7EC4;&#x7EC7;&#xFF09;&#x4F1A;&#x8BAE;&#x8BA8;&#x8BBA;&#x51B3;&#x5B9A;&#x5904;&#x7406;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x7531;&#x5404;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x81EA;&#x884C;&#x8DDF;&#x8FDB;&#xFF0C;&#x76F4;&#x63A5;&#x4E0E;&#x76F8;&#x5173;&#x90E8;&#x95E8;&#x8D1F;&#x8D23;&#x4EBA;&#x8FDB;&#x884C;&#x534F;&#x5546;&#x5904;&#x7406;&#xFF0C;&#x5207;&#x5B9E;&#x63A8;&#x52A8;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#xFF1B;</p>
<p>&#x9700;&#x8981;&#x8DDF;&#x5B66;&#x6821;&#x6709;&#x5173;&#x90E8;&#x95E8;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#x7684;&#x95EE;&#x9898;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5E73;&#x53F0;&#x6216;&#x8005;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x53CA;&#x65F6;&#x5411;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x53CD;&#x6620;&#xFF0C;&#x5E76;&#x7531;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x8FDB;&#x884C;&#x8DDF;&#x8FDB;&#xFF0C;&#x5207;&#x5B9E;&#x63A8;&#x52A8;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#xFF1B;</p>
<p>4&#x3001;&#x53CA;&#x65F6;&#x8F6C;&#x8F7D;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5B98;&#x65B9;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x63A8;&#x51FA;&#x7684;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x7CFB;&#x5217;&#x63A8;&#x9001;&#x4EE5;&#x53CA;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5B98;&#x65B9;QQ&#x7684;&#x7EF4;&#x6743;&#x670D;&#x52A1;&#x76F8;&#x5173;&#x8BF4;&#x8BF4;&#x5230;&#x5404;&#x9662;&#x73ED;&#x7FA4;&#x3002;</p>
<p>5&#x3001;&#x8D1F;&#x8D23;&#x4E0E;&#x5185;&#x5404;&#x73ED;&#x7684;&#x6743;&#x76CA;&#x59D4;&#x5458;&#x76F4;&#x63A5;&#x4EA4;&#x6D41;&#xFF0C;&#x5E76;&#x5B9A;&#x671F;&#x53EC;&#x5F00;&#x9662;&#x7EA7;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x3002;</p>
<p>6&#x3001;&#x5BF9;&#x5E94;&#x6743;&#x76CA;&#x90E8;&#x95E8;&#x8D1F;&#x8D23;&#x4EBA;&#x6BCF;&#x4E24;&#x5468;&#x4E00;&#x6B21;&#x53C2;&#x4E0E;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x5E76;&#x53CA;&#x65F6;&#x5C06;&#x53D1;&#x73B0;&#x7684;&#x5236;&#x5EA6;&#x6F0F;&#x6D1E;&#x53CD;&#x5E94;&#x7ED9;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#xFF0C;&#x800C;&#x540E;&#x8FDB;&#x884C;&#x6743;&#x76CA;&#x7EF4;&#x62A4;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#x4EA4;&#x6D41;&#x4EE5;&#x53CA;&#x60F3;&#x6CD5;&#x5206;&#x4EAB;&#x3002;</p>
<p>7&#x3001;&#x6BCF;&#x5B66;&#x671F;&#x671F;&#x672B;&#x505A;&#x4E00;&#x4E2A;&#x5B66;&#x671F;&#x5DE5;&#x4F5C;&#x6C47;&#x62A5;&#xFF0C;&#x6C47;&#x62A5;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x63D0;&#x6848;&#x641C;&#x96C6;&#x60C5;&#x51B5;&#x3001;&#x5904;&#x7406;&#x60C5;&#x51B5;&#x3001;&#x53CD;&#x9988;&#x60C5;&#x51B5;&#x3001;&#x672A;&#x6765;&#x8BA1;&#x5212;&#x7B49;&#x3002;</p>
<h1 id="&#x4E94;&#x3001;&#x95EE;&#x9898;&#x6536;&#x96C6;&#x7AEF;&#x53E3;"><a href="#&#x4E94;&#x3001;&#x95EE;&#x9898;&#x6536;&#x96C6;&#x7AEF;&#x53E3;" class="headerlink" title="&#x4E94;&#x3001;&#x95EE;&#x9898;&#x6536;&#x96C6;&#x7AEF;&#x53E3;"></a>&#x4E94;&#x3001;&#x95EE;&#x9898;&#x6536;&#x96C6;&#x7AEF;&#x53E3;</h1><p>1&#x3001;&#x7EBF;&#x4E0A;&#xFF1A;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x3001;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5B98;&#x65B9;QQ&#x3001;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5B98;&#x65B9;&#x5FAE;&#x535A;&#x3001;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5B98;&#x65B9;QQ&#xFF1B;</p>
<p>&#x6CE8;&#xFF1A;1&#x3001;&#x7EBF;&#x4E0A;&#x7A97;&#x53E3;&#x8BBE;&#x7F6E;&#x4F7F;&#x7528;&#x7EDF;&#x4E00;&#x7684;&#x95EE;&#x5377;&#x661F;&#x6A21;&#x677F;&#xFF0C;&#x53EF;&#x6839;&#x636E;&#x5404;&#x5B66;&#x9662;&#x7279;&#x8272;&#x589E;&#x52A0;&#x76F8;&#x5E94;&#x5185;&#x5BB9;&#x3002;</p>
<p>2&#x3001;&#x7A97;&#x53E3;&#x8BBE;&#x7F6E;&#x5728;&#x83DC;&#x5355;&#x680F;&#x4E00;&#x7EA7;&#x7A97;&#x53E3;&#xFF0C;&#x4F7F;&#x7528;&#x7EDF;&#x4E00;&#x540D;&#x79F0;&#x9752;&#x5E74;&#x4E4B;&#x58F0;</p>
<p>2&#x3001;&#x7EBF;&#x4E0B;&#xFF1A;&#x7531;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x6536;&#x96C6;&#x7EC4;&#x6210;&#x3002;</p>
<h1 id="&#x516D;&#x3001;&#x8FD0;&#x884C;&#x673A;&#x5236;"><a href="#&#x516D;&#x3001;&#x8FD0;&#x884C;&#x673A;&#x5236;" class="headerlink" title="&#x516D;&#x3001;&#x8FD0;&#x884C;&#x673A;&#x5236;"></a>&#x516D;&#x3001;&#x8FD0;&#x884C;&#x673A;&#x5236;</h1><p>1&#x3001;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x4F8B;&#x4F1A;&#x6BCF;&#x5468;&#x4E3E;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x65E5;&#x5E38;&#x8FD0;&#x884C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7EBF;&#x4E0A;&#x6216;&#x7EBF;&#x4E0B;&#x7684;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>2&#x3001;&#x7EBF;&#x4E0A;&#x56DE;&#x590D;&#xFF1A;</p>
<p>&#x6240;&#x6709;&#x7AEF;&#x53E3;&#x5728;&#x6536;&#x96C6;&#x5230;&#x95EE;&#x9898;&#x5EFA;&#x8BAE;&#x540E;&#xFF0C;&#x8FDB;&#x884C;&#x6D88;&#x606F;&#x5904;&#x7406;&#x548C;&#x6536;&#x5230;&#x901A;&#x77E5;&#xFF1B;</p>
<p>&#x5404;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x8D1F;&#x8D23;&#x5728;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x4E2D;&#x548C;&#x89E3;&#x51B3;&#x540E;&#x8FDB;&#x884C;&#x56DE;&#x590D;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x6708;&#x4E00;&#x6B21;&#x7684;&#x62A5;&#x544A;&#x63A8;&#x9001;&#xFF1B;</p>
<p>3&#x3001;&#x7EBF;&#x4E0B;&#x6536;&#x5355;&#xFF1A;</p>
<p>&#x7531;&#x5404;&#x73ED;&#x6743;&#x76CA;&#x59D4;&#x5458;&#x8D1F;&#x8D23;&#x7EDF;&#x8BA1;&#x73ED;&#x4E0A;&#x540C;&#x5B66;&#x7684;&#x95EE;&#x9898;&#x5EFA;&#x8BAE;&#x5E76;&#x5728;&#x9662;&#x7EA7;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x4E0A;&#x6216;&#x7EBF;&#x4E0A;&#x8FDB;&#x884C;&#x53CD;&#x5E94;&#xFF0C;&#x5404;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x5BF9;&#x6536;&#x96C6;&#x5230;&#x7684;&#x95EE;&#x9898;&#x5EFA;&#x8BAE;&#x8FDB;&#x884C;&#x7B5B;&#x9009;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x89E3;&#x51B3;&#x7684;&#x624D;&#x5728;&#x6821;&#x7EA7;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x4E0A;&#x6216;&#x7EBF;&#x4E0A;&#x62A5;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5904;&#x7406;&#x3002;</p>
<table>
<thead>
<tr>
<th></th>
<th></th>
<th></th>
<th></th>
</tr>
</thead>
<tbody><tr>
<td></td>
<td><img src="/sjld/sjld1.png" alt="img"></td>
<td></td>
<td></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img src="/sjld/sjld2.png" alt="img"></td>
<td></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td></td>
</tr>
</tbody></table>
<h1 id><a href="#" class="headerlink" title></a></h1><h1 id="-1"><a href="#-1" class="headerlink" title></a></h1><h1 id="-2"><a href="#-2" class="headerlink" title></a></h1><h1 id="-3"><a href="#-3" class="headerlink" title></a></h1><h1 id="&#x4E03;&#x3001;&#x95EE;&#x9898;&#x53CD;&#x9988;"><a href="#&#x4E03;&#x3001;&#x95EE;&#x9898;&#x53CD;&#x9988;" class="headerlink" title="&#x4E03;&#x3001;&#x95EE;&#x9898;&#x53CD;&#x9988;"></a>&#x4E03;&#x3001;&#x95EE;&#x9898;&#x53CD;&#x9988;</h1><p><strong>1</strong>&#x3001;&#x5411;&#x7EBF;&#x4E0A;&#x5E73;&#x53F0;&#x76F4;&#x63A5;&#x53D1;&#x9001;&#x7684;&#x95EE;&#x9898;&#x5EFA;&#x8BAE;&#xFF1A;</p>
<p>&#x7ECF;&#x89E3;&#x51B3;&#x540E;&#x76F4;&#x63A5;&#x5728;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5B98;&#x65B9;QQ &#x548C;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x5B66;&#x751F;&#x4F1A;&#x5B98;&#x65B9;&#x5FAE;&#x4FE1;&#x5E73;&#x53F0;&#x540C;&#x6B65;&#x53D1;&#x9001;&#x8BF4;&#x8BF4;&#x6216;&#x63A8;&#x9001;&#x56DE;&#x590D;&#x3002;</p>
<p><strong>2</strong>&#x3001;&#x5411;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#x63D0;&#x4EA4;&#x7684;&#x95EE;&#x9898;&#x5EFA;&#x8BAE;&#xFF1A;</p>
<p>1&#xFF09;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#x6709;&#x80FD;&#x529B;&#x76F4;&#x63A5;&#x89E3;&#x51B3;&#x7684;&#x7531;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#x5168;&#x6743;&#x8D1F;&#x8D23;&#x5E76;&#x81EA;&#x4E3B;&#x56DE;&#x590D;&#x3002;</p>
<p>2&#xFF09;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x5728;&#x6821;&#x9662;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x4E0A;&#x53CD;&#x6620;&#x7ED9;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#xFF0C;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x7ECF;&#x8FC7;&#x5904;&#x7406;&#x540E;&#x5C06;&#x7ED3;&#x679C;&#x518D;&#x6B21;&#x8FD4;&#x56DE;&#x7ED9;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#xFF0C;&#x7531;&#x9662;&#x7EA7;&#x5B66;&#x751F;&#x4F1A;&#x8FDB;&#x884C;&#x4F20;&#x8FBE;&#x3002;</p>
<h1 id="&#x516B;&#x3001;&#x8003;&#x6838;&#x5236;&#x5EA6;"><a href="#&#x516B;&#x3001;&#x8003;&#x6838;&#x5236;&#x5EA6;" class="headerlink" title="&#x516B;&#x3001;&#x8003;&#x6838;&#x5236;&#x5EA6;"></a>&#x516B;&#x3001;&#x8003;&#x6838;&#x5236;&#x5EA6;</h1><p>&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x4E0D;&#x5B9A;&#x671F;&#x8054;&#x5408;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x5BF9;&#x5404;&#x9662;&#x7684;&#x8054;&#x52A8;&#x5DE5;&#x4F5C;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x62BD;&#x67E5;&#xFF0C;&#x5E76;&#x5BF9;&#x4E8E;&#x62BD;&#x67E5;&#x7ED3;&#x679C;&#x7ED9;&#x5B9A;&#x8BC4;&#x5206;&#x3002;&#x8BC4;&#x5206;&#x7531;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x7684;&#x6253;&#x5206;&#x90E8;&#x5206;&#xFF08;&#x5360;&#x603B;&#x5206;70%&#xFF09;&#x548C;&#x5176;&#x5B83;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x6253;&#x5206;&#x90E8;&#x5206;&#xFF08;&#x5360;&#x603B;&#x5206;30%&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x5404;&#x5B66;&#x9662;&#x6743;&#x76CA;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x5728;&#x201C;&#x5341;&#x4F73;&#x4F18;&#x79C0;&#x5B66;&#x751F;&#x4F1A;&#x201D;&#x8BC4;&#x9009;&#x4E2D;&#x5360;17&#x5206;&#xFF0C;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x5728;&#x201C;&#x5341;&#x4F73;&#x4F18;&#x79C0;&#x5B66;&#x751F;&#x4F1A;&#x201D;&#x8BC4;&#x9009;&#x524D;&#x5915;&#x7EDF;&#x8BA1;&#x6240;&#x6709;&#x62BD;&#x67E5;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8003;&#x6838;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th></th>
<th>&#x5E8F;&#x53F7;</th>
<th>&#x8003;&#x6838;&#x4E8B;&#x9879;</th>
<th>&#x7EC6;&#x5219;</th>
<th>&#x5206;&#x6570;</th>
</tr>
</thead>
<tbody><tr>
<td>&#x9662;&#x73ED;</td>
<td>1</td>
<td>&#x8054;&#x52A8;&#x673A;&#x5236;</td>
<td>&#x5404;&#x9662;&#x5B8C;&#x5584;&#x5B66;&#x9662;&#xFF08;&#x5B66;&#x751F;&#x4F1A;&#x6743;&#x76CA;&#x90E8;&#xFF09;&#x3001;&#x73ED;&#x7EA7;&#xFF08;&#x6743;&#x76CA;&#x59D4;&#x5458;&#xFF09;&#x4E24;&#x7EA7;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x8054;&#x52A8;&#x673A;&#x5236;&#xFF08;&#x65B9;&#x6848;&#xFF09;</td>
<td>1&#x5206;</td>
</tr>
<tr>
<td>2</td>
<td>&#x8054;&#x52A8;&#x4F1A;&#x8BAE;</td>
<td>&#x5B9A;&#x671F;&#x53EC;&#x5F00;&#x9662;&#x73ED;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF0C;&#x6709;&#x5B8C;&#x6574;&#x4F1A;&#x8BAE;&#x8BB0;&#x5F55;</td>
<td>1&#x5206;</td>
<td></td>
</tr>
<tr>
<td>3</td>
<td>&#x63D0;&#x6848;&#x5DE5;&#x4F5C;</td>
<td>&#x5BF9;&#x4E8E;&#x9662;&#x5185;&#x53EF;&#x81EA;&#x884C;&#x89E3;&#x51B3;&#x7684;&#x63D0;&#x6848;&#xFF0C;&#x53CA;&#x65F6;&#x8DDF;&#x8FDB;&#x5904;&#x7406;&#x60C5;&#x51B5;&#xFF0C;&#x505A;&#x597D;&#x63D0;&#x6848;&#x53CD;&#x9988;&#x5DE5;&#x4F5C;</td>
<td>1&#x5206;</td>
<td></td>
</tr>
<tr>
<td>4</td>
<td>&#x8C03;&#x7814;&#x673A;&#x5236;</td>
<td>&#x6709;&#x76F8;&#x5BF9;&#x5B8C;&#x5584;&#x7684;&#x8C03;&#x7814;&#x673A;&#x5236;&#xFF0C;&#x5B66;&#x671F;&#x5185;&#x81F3;&#x5C11;&#x8FDB;&#x884C;&#x4E24;&#x6B21;&#x8D70;&#x8BBF;&#x8C03;&#x7814;&#x6D3B;&#x52A8;&#xFF0C;&#x4E86;&#x89E3;&#x5B66;&#x751F;&#x5BF9;&#x76F8;&#x5173;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x7684;&#x60F3;&#x6CD5;&#x53CA;&#x53CD;&#x9988;&#xFF0C;&#x5F62;&#x6210;&#x56FE;&#x50CF;&#x53CA;&#x6587;&#x5B57;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x5728;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#x53D1;&#x5E03;&#x63A8;&#x9001;</td>
<td>1&#x5206;</td>
<td></td>
</tr>
<tr>
<td>5</td>
<td>&#x5BF9;&#x63D0;&#x6848;&#x6309;&#x7C7B;&#x5F52;&#x6863;</td>
<td>&#x63D0;&#x6848;&#x6309;&#x6821;&#x56ED;&#x7BA1;&#x7406;&#x3001;&#x6559;&#x5B66;&#x6559;&#x7814;&#x3001;&#x6210;&#x957F;&#x6210;&#x624D;&#x3001;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3001;&#x751F;&#x6D3B;&#x670D;&#x52A1;&#x4E94;&#x5927;&#x7C7B;&#x5F52;&#x6863;</td>
<td>1&#x5206;</td>
<td></td>
</tr>
<tr>
<td>&#x6821;&#x9662;</td>
<td>6</td>
<td>&#x914D;&#x5408;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5C55;&#x5F00;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;</td>
<td>&#x914D;&#x5408;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5E73;&#x53F0;&#x5F00;&#x5C55;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E2E;&#x8F6C;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x76F8;&#x5173;&#x63A8;&#x9001;&#xFF08;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x76F8;&#x5173;&#x6D3B;&#x52A8;&#x3001;&#x63D0;&#x6848;&#x8FDB;&#x5EA6;&#x53CD;&#x9988;&#x7B49;&#xFF09;</td>
<td>1&#x5206;&#xFF0C;&#x5C11;&#x63A8;&#x4E00;&#x6B21;&#x6263;0.2&#x5206;&#xFF0C;&#x6263;&#x5B8C;&#x4E3A;&#x6B62;</td>
</tr>
<tr>
<td>7</td>
<td>&#x76F8;&#x5173;&#x4EBA;&#x5458;&#x53C2;&#x4E0E;&#x4E09;&#x7EA7;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;</td>
<td>&#x5206;&#x7BA1;&#x4E3B;&#x5E2D;&#x53C2;&#x52A0;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x6821;&#x9662;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF0C;&#x5206;&#x7BA1;&#x4E3B;&#x5E2D;&#x6216;&#x6743;&#x76CA;&#x90E8;&#x90E8;&#x957F;&#x53C2;&#x52A0;&#x9662;&#x73ED;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x8003;&#x6838;</td>
<td>1&#x5206;&#xFF0C;&#x65E0;&#x6545;&#x7F3A;&#x5E2D;&#x4E00;&#x6B21;&#x6263;0.2&#x5206;&#xFF0C;&#x8BF7;&#x5047;&#x8BF4;&#x660E;&#x7531;&#x5176;&#x4ED6;&#x4E3B;&#x5E2D;&#x56E2;&#x6210;&#x5458;&#x4EE3;&#x66FF;&#x53EF;&#x4E0D;&#x6263;&#x5206;&#xFF0C;&#x8FDF;&#x5230;&#x65E9;&#x9000;&#x4E00;&#x6B21;&#x6263;0.1&#x5206;&#xFF0C;&#x6263;&#x5B8C;&#x4E3A;&#x6B62;</td>
<td></td>
</tr>
<tr>
<td>8</td>
<td>&#x63D0;&#x6848;&#x8D28;&#x91CF;</td>
<td>&#x5B66;&#x9662;&#x5E94;&#x5BF9;&#x6536;&#x96C6;&#x63D0;&#x6848;&#x8FDB;&#x884C;&#x521D;&#x7EA7;&#x7B5B;&#x9009;&#xFF0C;&#x7EFC;&#x5408;&#x8003;&#x5BDF;&#x63D0;&#x6848;&#x53EF;&#x884C;&#x6027;&#x3001;&#x91CD;&#x590D;&#x6027;&#x3001;&#x5468;&#x671F;&#x6027;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x786E;&#x4FDD;&#x63D0;&#x6848;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x5E76;&#x53CA;&#x65F6;&#x63D0;&#x4EA4;&#x81F3;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;</td>
<td>5&#x5206;</td>
<td></td>
</tr>
<tr>
<td>9</td>
<td>&#x63D0;&#x6848;&#x6570;&#x91CF;</td>
<td>&#x8003;&#x8651;&#x5230;&#x5404;&#x9662;&#x4EBA;&#x6570;&#x5DEE;&#x8DDD;&#x53CA;&#x591A;&#x65B9;&#x9762;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x5BF9;&#x63D0;&#x6848;&#x6570;&#x91CF;&#x5236;&#x5B9A;&#x5F3A;&#x5236;&#x6027;&#x7EDF;&#x4E00;&#x89C4;&#x5B9A;&#xFF0C;&#x6309;&#x7167;&#x5404;&#x9662;&#x5927;&#x5C0F;&#x5BF9;&#x4E0A;&#x4EA4;&#x63D0;&#x6848;&#x6570;&#x91CF;&#x8FDB;&#x884C;&#x7075;&#x6D3B;&#x6027;&#x6253;&#x5206;&#x3002;</td>
<td>2&#x5206;</td>
<td></td>
</tr>
<tr>
<td>10</td>
<td>&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x603B;&#x7ED3;</td>
<td>&#x5B66;&#x671F;&#x672B;&#x6309;&#x8981;&#x6C42;&#x63D0;&#x4EA4;&#x672C;&#x5B66;&#x671F;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x603B;&#x7ED3;</td>
<td>2&#x5206;&#xFF0C;&#x6BCF;&#x6B21;1&#x5206;</td>
<td></td>
</tr>
</tbody></table>
<p>&#x5E38;&#x4EE3;&#x8868;&#x5168;&#x7A0B;&#x76D1;&#x7763;&#x9662;&#x7CFB;&#x5728;&#x5B66;&#x671F;&#x5185;&#x7684;&#x76F8;&#x5173;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#xFF0C;&#x636E;&#x5404;&#x9662;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x5B9E;&#x9645;&#x5F00;&#x5C55;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x53C2;&#x4E0E;&#xFF0C;&#x5305;&#x62EC;&#x7EBF;&#x4E0B;&#x5B9A;&#x671F;&#x8C03;&#x7814;&#x8BBF;&#x8C08;&#x6D3B;&#x52A8;&#xFF0C;&#x73ED;&#x7EA7;&#x6743;&#x76CA;&#x59D4;&#x5458;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#xFF0C;&#x9662;&#x73ED;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x8BB0;&#x5F55;&#x7B49;&#xFF0C;&#x5728;&#x5B66;&#x671F;&#x672B;&#x5F62;&#x6210;&#x5B66;&#x9662;&#x5E74;&#x5EA6;&#x89C2;&#x5BDF;&#x62A5;&#x544A;&#xFF0C;&#x5E76;&#x4E0A;&#x4EA4;&#x81F3;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x897F;&#x5357;&#x4EA4;&#x901A;&#x5927;&#x5B66;&#x201C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x201D;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x5BF9;&#x73ED;&#x7EA7;&#x6743;&#x76CA;&#x59D4;&#x5458;&#x5173;&#x4E8E;&#x5B66;&#x9662;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x7684;&#x5C55;&#x5F00;&#x60C5;&#x51B5;&#x3001;&#x770B;&#x6CD5;&#x548C;&#x5EFA;&#x8BAE;&#x8FDB;&#x884C;&#x968F;&#x673A;&#x63D0;&#x95EE;&#x3002;</p>
<h1 id="&#x4E5D;&#x3001;&#x5956;&#x60E9;&#x5236;&#x5EA6;"><a href="#&#x4E5D;&#x3001;&#x5956;&#x60E9;&#x5236;&#x5EA6;" class="headerlink" title="&#x4E5D;&#x3001;&#x5956;&#x60E9;&#x5236;&#x5EA6;"></a>&#x4E5D;&#x3001;&#x5956;&#x60E9;&#x5236;&#x5EA6;</h1><p>&#x5404;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x8054;&#x52A8;&#x5DE5;&#x4F5C;&#x4E0E;&#x6743;&#x76CA;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#x5F00;&#x5C55;&#x60C5;&#x51B5;&#x5C06;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x201C;&#x5341;&#x4F73;&#x4F18;&#x79C0;&#x5B66;&#x751F;&#x4F1A;&#x201D;&#x8BC4;&#x9009;&#x6210;&#x7EE9;&#xFF0C;&#x4EE5;&#x53CA;&#x4E2A;&#x4EBA;&#x8363;&#x8A89;&#x8BC4;&#x5B9A;&#x3002;</p>
<p>&#x6BCF;&#x5B66;&#x671F;&#x671F;&#x672B;&#x5C06;&#x8BC4;&#x9009;&#x51FA;&#x5EFA;&#x8A00;&#x732E;&#x7B56;&#x3001;&#x7EF4;&#x6743;&#x670D;&#x52A1;&#x5DE5;&#x4F5C;&#x548C;&#x63D0;&#x5347;&#x6743;&#x76CA;&#x610F;&#x8BC6;&#x5DE5;&#x4F5C;&#x6700;&#x51FA;&#x8272;&#x7684;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x4EE5;&#x53CA;&#x6743;&#x76CA;&#x59D4;&#x5458;&#xFF0C;&#x6821;&#x4F1A;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x6388;&#x4E88;&#x5956;&#x72B6;&#x548C;&#x5956;&#x54C1;&#x3002;</p>
<h1 id="&#x5341;&#x3001;&#x9488;&#x5BF9;&#x90E8;&#x5206;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x65E0;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#x53CA;&#x5B66;&#x9662;&#x7EC4;&#x7EC7;&#x8D1F;&#x8D23;&#x6743;&#x76CA;&#x8D1F;&#x8D23;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x5341;&#x3001;&#x9488;&#x5BF9;&#x90E8;&#x5206;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x65E0;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#x53CA;&#x5B66;&#x9662;&#x7EC4;&#x7EC7;&#x8D1F;&#x8D23;&#x6743;&#x76CA;&#x8D1F;&#x8D23;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x5341;&#x3001;&#x9488;&#x5BF9;&#x90E8;&#x5206;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x65E0;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#x53CA;&#x5B66;&#x9662;&#x7EC4;&#x7EC7;&#x8D1F;&#x8D23;&#x6743;&#x76CA;&#x8D1F;&#x8D23;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x5341;&#x3001;&#x9488;&#x5BF9;&#x90E8;&#x5206;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x65E0;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#x53CA;&#x5B66;&#x9662;&#x7EC4;&#x7EC7;&#x8D1F;&#x8D23;&#x6743;&#x76CA;&#x8D1F;&#x8D23;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h1><p>1&#x3001;&#x56E0;&#x90E8;&#x5206;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x65E0;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#xFF0C;&#x4E3A;&#x53CA;&#x65F6;&#x6536;&#x96C6;&#x3001;&#x542C;&#x53D6;&#x6D89;&#x53CA;&#x5E7F;&#x5927;&#x540C;&#x5B66;&#x5207;&#x8EAB;&#x5229;&#x76CA;&#x548C;&#x666E;&#x904D;&#x8BC9;&#x6C42;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5EFA;&#x8BAE;&#x5229;&#x7528;&#x5B66;&#x9662;&#x7EC4;&#x7EC7;&#x65B0;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#x8FDB;&#x884C;&#x7EBF;&#x4E0A;&#x95EE;&#x9898;&#x6536;&#x96C6;&#xFF0C;&#x5E76;&#x8981;&#x6C42;&#x7531;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x6743;&#x76CA;&#x90E8;&#x95E8;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x95EE;&#x9898;&#x6536;&#x96C6;&#x4EE5;&#x53CA;&#x6574;&#x4F53;&#x8FD0;&#x8425;&#x3001;&#x5BF9;&#x63A5;&#x3002;</p>
<p>2&#x3001;&#x56E0;&#x90E8;&#x5206;&#x5B66;&#x9662;&#x76EE;&#x524D;&#x7531;&#x5B66;&#x9662;&#x7EC4;&#x7EC7;&#x8D1F;&#x8D23;&#x6743;&#x76CA;&#x7EF4;&#x62A4;&#xFF0C;&#x4E3A;&#x66F4;&#x597D;&#x5B9E;&#x73B0;&#x201C;&#x6241;&#x5E73;&#x5316;&#x201D;&#xFF0C;&#x8981;&#x6C42;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x52A0;&#x5F3A;&#x6743;&#x76CA;&#x90E8;&#x95E8;&#x7684;&#x5EFA;&#x8BBE;&#xFF0C;&#x5E76;&#x7531;&#x5B66;&#x9662;&#x5B66;&#x751F;&#x4F1A;&#x76F8;&#x5173;&#x8D1F;&#x8D23;&#x4EBA;&#x8FDB;&#x884C;&#x5BF9;&#x63A5;&#x3002;</p>
<h1 id="&#x5341;&#x4E00;&#x3001;&#x76F8;&#x5173;&#x7EC6;&#x5219;"><a href="#&#x5341;&#x4E00;&#x3001;&#x76F8;&#x5173;&#x7EC6;&#x5219;" class="headerlink" title="&#x5341;&#x4E00;&#x3001;&#x76F8;&#x5173;&#x7EC6;&#x5219;"></a>&#x5341;&#x4E00;&#x3001;&#x76F8;&#x5173;&#x7EC6;&#x5219;</h1><p><strong>1</strong>&#x3001;&#x63D0;&#x6848;&#x8D28;&#x91CF;&#x3001;&#x6570;&#x91CF;&#x5177;&#x4F53;&#x7EC6;&#x5219;&#xFF1A;</p>
<p>&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x9662;&#x7CFB;&#x60C5;&#x51B5;&#xFF0C;&#x5BF9;&#x63D0;&#x6848;&#x6570;&#x91CF;&#x7684;&#x8981;&#x6C42;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#xFF0C;&#x5C06;&#x4EE5;&#x5B66;&#x9662;&#x4EBA;&#x6570;&#x7CFB;&#x6570;&#x4E3A;&#x6807;&#x51C6;&#x5BF9;&#x6240;&#x6709;&#x5B66;&#x9662;&#x6392;&#x5E8F;&#xFF0C;&#x53D6;&#x524D;&#x516D;&#x4E2A;&#x9662;&#x201C;&#x5927;&#x9662;&#x201D;&#xFF0C;&#x5176;&#x4F59;&#x4E3A;&#x201C;&#x5C0F;&#x9662;&#x201D;&#x3002;&#x5F53;&#x5B66;&#x9662;&#x4EBA;&#x6570;&#x7CFB;&#x6570;&#x5B58;&#x5728;&#x660E;&#x663E;&#x5206;&#x5C42;&#x65F6;&#xFF0C;&#x5219;&#x6309;&#x4EBA;&#x6570;&#x7CFB;&#x6570;&#x5206;&#x5C42;&#x60C5;&#x51B5;&#x6765;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5E76;&#x4E0D;&#x62D8;&#x6CE5;&#x4E8E;&#x5355;&#x4E00;&#x5F62;&#x5F0F;&#x3002;</p>
<p><strong>&#xFF08;&#x4EBA;&#x6570;&#x7CFB;&#x6570;=&#x5927;&#x4E00;&#x5B66;&#x751F;&#x4EBA;&#x6570;</strong><img src="%E5%BE%AE%E8%A7%82%E5%AF%9F1.assets/clip_image006.gif" alt="img"><strong>+**</strong>&#x5927;&#x4E8C;&#x5B66;&#x751F;&#x4EBA;&#x6570;X0.4&#xFF09;**</p>
<p>&#x5BF9;&#x4E8E;&#x201C;&#x5927;&#x9662;&#x201D;&#x800C;&#x8A00;&#xFF0C;&#x5B66;&#x671F;&#x6709;&#x6548;&#x63D0;&#x6848;&#x603B;&#x6570;&#x8FBE;&#x5230;5&#x4EFD;&#x4E3A;&#x4F18;&#x79C0;&#xFF08;2&#x5206;&#xFF09;&#xFF0C;&#x6709;&#x6548;&#x63D0;&#x6848;&#x8FBE;&#x5230;3&#x4EFD;&#x4E3A;&#x826F;&#x597D;&#xFF08;1&#x5206;&#xFF09;&#xFF0C;&#x6709;&#x6548;&#x63D0;&#x6848;&#x8FBE;&#x5230;2&#x4EFD;&#x4E3A;&#x5408;&#x683C;&#xFF08;0.5&#x5206;&#xFF09;&#xFF0C;&#x6709;&#x6548;&#x63D0;&#x6848;&#x4F4E;&#x4E8E;2&#x4EFD;&#x4E0D;&#x5408;&#x683C;&#xFF0C;&#x4E0D;&#x8BA1;&#x5206;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x201C;&#x5C0F;&#x9662;&#x201D;&#x800C;&#x8A00;&#xFF0C;&#x5B66;&#x671F;&#x6709;&#x6548;&#x63D0;&#x6848;&#x603B;&#x6570;&#x8FBE;&#x5230;4&#x4EFD;&#x4E3A;&#x4F18;&#x79C0;&#xFF08;2&#x5206;&#xFF09;&#xFF0C;&#x6709;&#x6548;&#x63D0;&#x6848;&#x8FBE;&#x5230;2&#x4EFD;&#x4E3A;&#x826F;&#x597D;&#xFF08;1&#x5206;&#xFF09;&#xFF0C;&#x6709;&#x6548;&#x63D0;&#x6848;&#x8FBE;&#x5230;1&#x4EFD;&#x4E3A;&#x5408;&#x683C;&#xFF08;0.5&#x5206;&#xFF09;&#xFF0C;&#x6709;&#x6548;&#x63D0;&#x6848;&#x4F4E;&#x4E8E;1&#x4EFD;&#x4E0D;&#x5408;&#x683C;&#xFF0C;&#x4E0D;&#x8BA1;&#x5206;&#x3002;</p>
<p>&#x63D0;&#x6848;&#x8D28;&#x91CF;&#x5C06;&#x4ECE;&#x5404;&#x9662;&#x6709;&#x6548;&#x63D0;&#x6848;&#x7684;&#x5B9E;&#x65BD;&#x96BE;&#x5EA6;&#x3001;&#x91CD;&#x590D;&#x6027;&#x3001;&#x5468;&#x671F;&#x6027;&#x3001;&#x5B8C;&#x6574;&#x6027;&#x7B49;&#x5176;&#x4ED6;&#x591A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x8BC4;&#x5206;&#xFF0C;&#x5404;&#x9662;&#x4E00;&#x89C6;&#x540C;&#x4EC1;&#x3002;</p>
<h2 id="2&#x3001;&#x201C;&#x9662;&#x9662;&#x8003;&#x6838;&#x201D;&#x7EC6;&#x5219;&#xFF1A;"><a href="#2&#x3001;&#x201C;&#x9662;&#x9662;&#x8003;&#x6838;&#x201D;&#x7EC6;&#x5219;&#xFF1A;" class="headerlink" title="2&#x3001;&#x201C;&#x9662;&#x9662;&#x8003;&#x6838;&#x201D;&#x7EC6;&#x5219;&#xFF1A;"></a>2&#x3001;&#x201C;&#x9662;&#x9662;&#x8003;&#x6838;&#x201D;&#x7EC6;&#x5219;&#xFF1A;</h2><p>1&#x3001;&#x4E3A;&#x4E86;&#x8BA9;&#x5404;&#x9662;&#x4E86;&#x89E3;&#x8054;&#x52A8;&#x5DE5;&#x4F5C;&#x7684;&#x5177;&#x4F53;&#x8BC4;&#x5206;&#x60C5;&#x51B5;&#xFF0C;&#x4FC3;&#x8FDB;&#x5404;&#x9662;&#x95F4;&#x76F8;&#x4E92;&#x5B66;&#x4E60;&#x3001;&#x76F8;&#x4E92;&#x76D1;&#x7763;&#xFF0C;&#x4E86;&#x89E3;&#x76D1;&#x7763;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x7684;&#x6253;&#x5206;&#x8FC7;&#x7A0B;&#x548C;&#x6253;&#x5206;&#x60C5;&#x51B5;&#xFF0C;&#x8981;&#x6C42;&#x5404;&#x9662;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x9662;&#x8054;&#x52A8;&#x5DE5;&#x4F5C;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x8BC4;&#x5206;&#x3002;</p>
<p>2&#x3001;&#x5BF9;&#x5404;&#x5B66;&#x9662;&#x7684;&#x6743;&#x76CA;&#x5DE5;&#x4F5C;&#x8BC4;&#x5B9A;&#x5728;&#x201C;&#x5341;&#x4F73;&#x4F18;&#x79C0;&#x5B66;&#x751F;&#x4F1A;&#x201D;&#x8BC4;&#x9009;&#x4E2D;&#x5171;&#x5360;17&#x5206;&#xFF0C;&#x5176;&#x4E2D;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x8BC4;&#x5206;&#x5360;70%&#xFF0C;&#x5404;&#x9662;&#x4E92;&#x8BC4;&#x5360;30%&#x3002;</p>
<p>3&#x3001;&#x5404;&#x9662;&#x95F4;&#x7684;&#x8BC4;&#x5206;&#x5DE5;&#x4F5C;&#x7531;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x7EC4;&#x7EC7;&#x7EDF;&#x7B79;&#xFF0C;&#x4E92;&#x8BC4;&#x5BF9;&#x8C61;&#x7531;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x5B89;&#x6392;&#xFF0C;&#x5404;&#x9662;&#x6BCF;&#x5B66;&#x671F;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x9662;&#x8FDB;&#x884C;&#x8003;&#x6838;&#xFF0C;&#x4E3A;&#x4FDD;&#x8BC1;&#x8BC4;&#x5206;&#x73AF;&#x8282;&#x5BA2;&#x89C2;&#x516C;&#x6B63;&#xFF0C;&#x8003;&#x6838;&#x53CC;&#x65B9;&#x8EAB;&#x4EFD;&#x5C06;&#x4E8E;&#x7B2C;&#x4E00;&#x6B21;&#x6821;&#x9662;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#x4E0A;&#x8FDB;&#x884C;&#x516C;&#x793A;&#xFF0C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x8D1F;&#x8D23;&#x4E2D;&#x95F4;&#x534F;&#x5546;&#x5DE5;&#x4F5C;&#xFF0C;&#x8003;&#x6838;&#x987A;&#x5E8F;&#x53CA;&#x8003;&#x6838;&#x8868;&#x5C06;&#x5728;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x4E0E;&#x5404;&#x5B66;&#x9662;&#x6C9F;&#x901A;&#x4E4B;&#x540E;&#x53D1;&#x5E03;&#x3002;</p>
<p>4&#x3001;&#x5404;&#x9662;&#x4E92;&#x76F8;&#x8003;&#x6838;&#x7684;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1)   &#x5404;&#x9662;&#x6743;&#x76CA;&#x8D1F;&#x8D23;&#x4EBA;&#x6309;&#x8003;&#x6838;&#x8868;&#x51FA;&#x5E2D;&#x5BF9;&#x5E94;&#x88AB;&#x8003;&#x6838;&#x5B66;&#x9662;&#x7684;&#x9662;&#x73ED;&#x8054;&#x52A8;&#x4F1A;&#x8BAE;&#xFF0C;&#x5E76;&#x73B0;&#x573A;&#x6253;&#x5206;&#x3002;</p>
<p>2)   &#x5404;&#x9662;&#x5728;&#x8FDB;&#x884C;&#x8D70;&#x8BBF;&#x8C03;&#x7814;&#x6D3B;&#x52A8;&#x65F6;&#xFF0C;&#x5E94;&#x9080;&#x8BF7;&#x76F8;&#x5E94;&#x8003;&#x6838;&#x5B66;&#x9662;&#x6743;&#x76CA;&#x8D1F;&#x8D23;&#x4EBA;&#x4E00;&#x540C;&#x8FDB;&#x884C;&#x8D70;&#x8BBF;&#x8C03;&#x7814;&#xFF0C;&#x4EE5;&#x76D1;&#x7763;&#x5404;&#x9662;&#x7684;&#x8C03;&#x7814;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>3)   &#x5B66;&#x671F;&#x672B;&#xFF0C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x5BF9;&#x5404;&#x9662;&#x5B66;&#x671F;&#x63D0;&#x6848;&#x603B;&#x6570;&#x8FDB;&#x884C;&#x6574;&#x7406;&#xFF0C;&#x8003;&#x6838;&#x9662;&#x5E94;&#x5145;&#x5206;&#x8003;&#x5BDF;&#x5404;&#x63D0;&#x6848;&#x7684;&#x5B8C;&#x6574;&#x6027;&#xFF08;&#x662F;&#x5426;&#x4E25;&#x683C;&#x6309;&#x7167;&#x6307;&#x5B9A;&#x683C;&#x5F0F;&#x4E66;&#x5199;&#x63D0;&#x6848;&#xFF09;&#x3001;&#x53EF;&#x884C;&#x6027;&#xFF08;&#x5305;&#x62EC;&#x5B9E;&#x65BD;&#x96BE;&#x5EA6;&#x3001;&#x5B9E;&#x65BD;&#x5468;&#x671F;&#x7B49;&#xFF09;&#x3001;&#x521B;&#x65B0;&#x6027;&#xFF08;&#x662F;&#x5426;&#x80FD;&#x5F15;&#x8D77;&#x540C;&#x5B66;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x548C;&#x5174;&#x8DA3;&#xFF0C;&#x662F;&#x5426;&#x5BF9;&#x5B66;&#x6821;&#x957F;&#x8FDC;&#x53D1;&#x5C55;&#x548C;&#x5B66;&#x751F;&#x6743;&#x76CA;&#x7EF4;&#x62A4;&#x6709;&#x76CA;&#xFF0C;&#x662F;&#x5426;&#x5177;&#x6709;&#x5176;&#x4ED6;&#x53D1;&#x5C55;&#x524D;&#x666F;&#x7B49;&#xFF09;&#x3001;&#x5E7F;&#x6CDB;&#x6027;&#xFF08;&#x662F;&#x5426;&#x9002;&#x7528;&#x4E8E;&#x591A;&#x6570;&#x540C;&#x5B66;&#xFF09;&#x3001;&#x5177;&#x4F53;&#x6027;&#xFF08;&#x8981;&#x6C42;&#x95EE;&#x9898;&#x63CF;&#x8FF0;&#x7EC6;&#x81F4;&#xFF0C;&#x8BBE;&#x60F3;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x3001;&#x6709;&#x5FC5;&#x8981;&#x65F6;&#x5E94;&#x63D0;&#x4F9B;&#x76F8;&#x5E94;&#x7167;&#x7247;&#x6216;&#x73B0;&#x5B9E;&#x7D20;&#x6750;&#xFF09;&#x7B49;&#x65B9;&#x9762;&#xFF0C;&#x5BF9;&#x76F8;&#x5E94;&#x88AB;&#x8003;&#x6838;&#x9662;&#x672C;&#x5B66;&#x671F;&#x5F62;&#x6210;&#x63D0;&#x6848;&#x8FDB;&#x884C;&#x8BC4;&#x4EF7;&#x3002;</p>
<p>4)   &#x82E5;&#x5728;&#x5B66;&#x671F;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6709;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x6216;&#x6D3B;&#x52A8;&#x9700;&#x8981;&#x9662;&#x9662;&#x8003;&#x6838;&#x4E92;&#x8BC4;&#xFF0C;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x5C06;&#x89C6;&#x73B0;&#x5B9E;&#x60C5;&#x51B5;&#x7075;&#x6D3B;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#x7EDF;&#x7B79;&#x3002;</p>
<p>5&#x3001;&#x5404;&#x9662;&#x8FDB;&#x884C;&#x8BC4;&#x5206;&#x65F6;&#x5E94;&#x6309;&#x7167;&#x9752;&#x5E74;&#x4E4B;&#x58F0;&#x5DE5;&#x4F5C;&#x7AD9;&#x63D0;&#x4F9B;&#x7684;&#x5177;&#x4F53;&#x8BC4;&#x5206;&#x6807;&#x51C6;&#x6267;&#x884C;&#x3002;</p>
<p>6&#x3001;&#x5404;&#x9662;&#x8003;&#x6838;&#x4EBA;&#x5458;&#x5728;&#x8003;&#x6838;&#x65F6;&#x5747;&#x9700;&#x5230;&#x573A;&#xFF0C;&#x672A;&#x5230;&#x573A;&#x8005;&#x5C06;&#x914C;&#x60C5;&#x6263;&#x5206;&#x3002;</p>
<p>7&#x3001;&#x8003;&#x6838;&#x4EBA;&#x5458;&#x8BC4;&#x5206;&#x9700;&#x505A;&#x5230;&#x516C;&#x5E73;&#x516C;&#x6B63;&#xFF0C;&#x5982;&#x6709;&#x4E25;&#x91CD;&#x8BC4;&#x5206;&#x5931;&#x5B9E;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5219;&#x8BC4;&#x5206;&#x4F5C;&#x5E9F;&#x3002;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/">#</a></span>
    
    </div>
    
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='https://www.youngvoice.online' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<div id="comment-container"></div>
<link rel="stylesheet" href="https://imsun.github.io/gitment/style/default.css">
<script src="https://imsun.github.io/gitment/dist/gitment.browser.js"></script>
<script>
	var gitment = new Gitment({
		id: 'DOC1/三级联动2019.html',
		owner: 'luojunhui1',
		repo: 'https://github.com/luojunhui1/luojunhui1',
		oauth: {
			client_id: '9a0c86a290f27465ab0f',
			client_secret: '7133ddd0c7914b4f787e1547d595f50eac057e59',
		},
	})
	gitment.render('comment-container')
</script>

</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Junhui Luo&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="西南交通大学官网" href="http://jwc.swjtu.edu.cn/index.html" target="_blank" rel="noopener">
                    
                    西南交通大学官网
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="西南交通大学图书馆" href="http://www.lib.swjtu.edu.cn/" target="_blank" rel="noopener">
                    
                    西南交通大学图书馆
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="西南交通大学后勤与基建管理处" href="https://hjc.swjtu.edu.cn/" target="_blank" rel="noopener">
                    
                    西南交通大学后勤与基建管理处
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>